test.org
#+TITLE: Programmazione elementare in Ruby.
#+AUTHOR: Massimo Maria Ghisalberti - pragmas.org 2
#+SUB_AUTHOR: Massimo Maria Ghisalberti
#+DATE: 2014-10-21
#+EMAIL: massimo.ghisalberti@pragmas.org
#+STARTUP: showall 
#+OPTIONS: fnadjust, ^:{}
#+OPTIONS: H:6 num:6 toc:6
#+DESCRIPTION: Corso elementare di programmazione Ruby
#+KEYWORDS: Ruby, programmazione
#+LANGUAGE: it

#+OPTIONS: html-postamble:t html-preamble:t tex:t
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="./org.css" />

#+LATEX_CLASS: nissl-org-article
#+LATEX_CLASS_OPTIONS: [a4paper]

#+LATEX_HEADER:\fancypagestyle{plain}{
#+LATEX_HEADER:  \fancyhf{} 
#+LATEX_HEADER:  \fancyfoot[LO]{\small Pragmas s.n.c – via degli Olivi 12 - 06081 Assisi (loc. Palazzo), Italia \linebreak p.iva:  02660460540 - tel.: +39 3939018290/3939909262 – email: contact.info@pragmas.org }}
#+LATEX_HEADER:  \renewcommand{\headrulewidth}{0pt}
#+LATEX_HEADER:  \renewcommand{\footrulewidth}{0.4pt}
#+LATEX_HEADER:}

#+LATEX_HEADER:\fancypagestyle{fancyplain}{
#+LATEX_HEADER:  \fancyfoot[LO]{\small Pragmas s.n.c – via degli Olivi 12 - 06081 Assisi (loc. Palazzo), Italia  \linebreak p.iva:  02660460540 - tel.: +39 3939018290/3939909262 – email: contact.info@pragmas.org }}
#+LATEX_HEADER:  \renewcommand{\footrulewidth}{0.4pt}
#+LATEX_HEADER:}

#+LATEX_HEADER:\pagestyle{fancyplain}
#+LATEX_HEADER:\usemintedstyle{tango}

