test.html
<!DOCTYPE html>
<html>
<head>
<title>Programmazione elementare in Ruby.</title>
<!-- 2014-11-02 dom 15:38 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Massimo Maria Ghisalberti - pragmas.org">
<meta  name="description" content="Corso elementare di programmazione Ruby"
>
<meta  name="keywords" content="Ruby, programmazione">
<link rel="stylesheet" href="./org-minimalprocedure.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Programmazione elementare in Ruby.</h1>
<nav id="table-of-contents">
