test.org
* Premessa al corso di programmazione elementare

Il mondo moderno è immerso nella tecnologia.
Oggi sarebbe impensabile pensare ad una vita slegata dagli strumenti tecnologici che usiamo tutti i giorni, che siano semplici interruttori o automobili.
I computer oggi sono ubiquitari, che ce ne accorgiamo o no; sono nelle nostre lavatrici, nelle automobili, negli aerei, nei telefoni fino dal più semplice e non /smart/.

La popolazione è sostanzialmente divisa in /nativi/ e /non nativi/ digitali, persone che hanno potuto accedere al /computer/ in età adulta o post-adolescenziale e persone che sono nate e si sono formate in piena rivoluzione informatica.
Gli approcci delle due fasce di popolazione sono sostanzialmente diversi: La prima generalmente possiede una certa diffidenza /naturale/ verso il mezzo informatico, mentre la seconda lo usa con naturalezza e propensione.

Il computer è un superbo mezzo di comunicazione, di lavoro e svago; sempre più potente ed inserito nella vita normale. È un mezzo, per cui né /buono/ né /cattivo/, dipende solo dall'uso che ne viene fatto.
Il /nativo digitale/ a causa della sua naturalezza all'uso del mezzo informatico è oggi un soggetto potenzialmente a rischio. La maggior parte di noi è consapevole, per esempio, dell'approccio passivo alla televisione; della comunicazione a senso unico che porta e di come in taluni casi questa informazione possa essere manipolata e non corretta. Nessuno di noi però, è ancora propriamente consapevole dei pericoli insiti nell'uso acritico e non corretto dei nostri piccoli ed ubiquitari computer.

Abbiamo telefoni intelligenti, tablet o notebook che portiamo ovunque andiamo.
I nostri figli li hanno, mini e microcomputer perennemente connessi ad Internet, dove possono fruire più o meno liberamente dei contenuti più disparati.
Vietare non è la soluzione, impedirgli di usarli non è la soluzione ma solo un tampone temporaneo che presto imparerà a scavalcare.
Si dovrebbe insegnare ai nostri figli, /nativi digitali/, l'approccio consapevole ed informato. \\

Gli approcci agli insegnamenti informatici vanno rivisti e va rivista l'età in cui iniziare.
Le lezioni di /avviamento al computer/ che venivano e vengono utilizzati oggi non sono più adatti per i /nativi digitali/. Accendere un computer e lanciare una applicazione per i nostri figli è naturale come per noi accedere il televisore e cambiare canale. Usare un gioco, che è un software, è naturale per loro.
Passivamente naturale, il mito della interattività è solo un percorso preordinato tra tanti progettati a monte dell'utente e si è passivi nell'illusione di non esserlo.
Bisogna passare dalla semplice visione strumentale e /alfabetizzazione informatica/ alla fase di acquisizione delle /competenze digitali/. \\

Per questo motivo, si dovrebbe insegnare la /programmazione dei computer/ ai bambini in età scolare.
Non per creare una /generazione di programmatori/ (come mi si è accusato), ovviamente, ma per rendere delle persone consapevoli ed attive di fronte al mezzo informatico.

Programmare un computer è affrontare e risolvere problemi, /problem posing and solving/, è imparare a ordinare i pensieri per poter realizzare le idee. 
L'approccio può essere multidisciplinare e il metodo applicabile in molti campi e non necessariamente informatici. Lo studio della /programmazione/ è quindi, oltre alla sua mera applicazione, una formidabile palestra di logica che guida il ragazzo attraverso un percorso che passa per l'analisi, la scomposizione dei problemi, la verifica dei risultati e l'organizzazione del pensiero.

Imparare a programmare, insegna la collaborazione e la condivisione (se insegnata nella maniera adeguata) tramite un processo di /trial and error/ e permette allo studente di esprimersi in molti modi. L'approccio produttivo ed anche ludico, potrebbe permettere di attirare e coinvolgere studenti problematici e creare interesse. \\

/Quando i bambini creano un progetto come questo, imparano anche a programmare, ma, cosa ancora più importante, programmano per imparare. Perché imparando a programmare, imparano mille altre cose, aprendo nuove opportunità di apprendimento. Ripeto, è utile fare un'analogia con la lettura e la scrittura. Quando si impara a leggere e scrivere, si aprono nuove opportunità per imparare molte altre cose. Quando si impara a leggere, allora si potrà anche leggere per imparare. E imparare a programmare è la stessa cosa. Se si impara a programmare, allora si potrà anche programmare per imparare. Ora, alcune cose che si imparano sono piuttosto ovvie. Si impara qualcosa di più su come funzionano i computer. Ma questo è solamente il punto di partenza. Quando si impara a programmare, si apre la possibilità di imparare molte altre cose./ \\

/As kids are creating projects like this, *they're learning to code, but even more importantly, they're coding to learn*. Because as they learn to code, it enables them to learn many other things, opens up many new opportunities for learning. Again, it's useful to make an analogy to reading and writing. When you learn to read and write, it opens up opportunities for you to learn so many other things. When you learn to read, you can then read to learn. And it's the same thing with coding. If you learn to code, you can code to learn. Now some of the things you can learn are sort of obvious. You learn more about how computers work. But that's just where it starts. When you learn to code, it opens up for you to learn many other things./ \\

*Mitch Resnick* (http://www.ted.com/talks/mitch_resnick_let_s_teach_kids_to_code/transcript) \\

È nel contempo importante, insegnare come l'approccio al software ed alla sua produzione debba essere /morale/ spingendo lo studente verso il concetto di /Open Source/, spostando il valore dal prodotto in sé al produttore (il programmatore); combattendo la visione monopolistica delle grandi /software house/ o /software service/ verso un approccio sostanziale alle tipologie software (anche solo nel rispetto delle direttive ministeriali in materia di software da utilizzare nelle pubbliche amministrazioni). \\

Non va dimenticato inoltre, all'atto pratico, come in futuro la richiesta di programmatori diventerà altissima e quindi si potrebbe fornire agli studenti uno strumento in più.
Esistono numerose esperienze, specialmente negli U.S.A., di insegnamento della programmazione a bambini in età scolare (k-12); mentre per l'Europa si potrebbero citare le esperienze fatte in UK ed Estonia.

