test.html
<h2>Indice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Premessa al corso di programmazione elementare</a>
<ul>
<li><a href="#sec-1-1">1.1. Ambienti liberi per l'insegnamento della programmazione a bambini e ragazzi.</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Scratch</a></li>
<li><a href="#sec-1-1-2">1.1.2. Alice</a></li>
<li><a href="#sec-1-1-3">1.1.3. Hackety Hack</a></li>
<li><a href="#sec-1-1-4">1.1.4. KidsRuby</a></li>
<li><a href="#sec-1-1-5">1.1.5. Kojo</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Perché Ruby direttamente e non un ambiente <i>facilitato</i>.</a></li>
<li><a href="#sec-3">3. Programmare in Ruby</a>
<ul>
<li><a href="#sec-3-1">3.1. Premessa</a></li>
<li><a href="#sec-3-2">3.2. cosa è Ruby</a></li>
<li><a href="#sec-3-3">3.3. Cosa serve</a></li>
<li><a href="#sec-3-4">3.4. Le basi</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1. Iniziamo con i numeri e le stringhe</a></li>
<li><a href="#sec-3-4-2">3.4.2. Le variabili e gli assegnamenti</a></li>
<li><a href="#sec-3-4-3">3.4.3. Scriviamo un programma</a></li>
<li><a href="#sec-3-4-4">3.4.4. Riflessioni fino qui</a></li>
<li><a href="#sec-3-4-5">3.4.5. Confrontare le cose e decidere cosa fare</a></li>
<li><a href="#sec-3-4-6">3.4.6. Cicli, ripetere le cose da fare molte volte</a></li>
<li><a href="#sec-3-4-7">3.4.7. Scriviamo i nostri metodi, altrimenti a che serve?</a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5. Le cose serie</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1. Raggruppiamo i metodi in moduli</a></li>
<li><a href="#sec-3-5-2">3.5.2. Le classi (non quelle della scuola, o forse si?)</a></li>
<li><a href="#sec-3-5-3">3.5.3. Blocks e Procs, che non è il Rock'n'Roll ma ci si avvicina.</a></li>
<li><a href="#sec-3-5-4">3.5.4. Il mondo esterno</a></li>
<li><a href="#sec-3-5-5">3.5.5. I dizionari</a></li>
<li><a href="#sec-3-5-6">3.5.6. Le finestre che si aprono o si chiudono se fa freddo.</a>
<ul>
<li><a href="#sec-3-5-6-1">3.5.6.1. Divagazioni sul tema</a></li>
<li><a href="#sec-3-5-6-2">3.5.6.2. Facciamole queste finestre, che ci siamo annoiati!</a>
<ul>
<li><a href="#sec-3-5-6-2-1">3.5.6.2.1. il problema</a></li>
<li><a href="#sec-3-5-6-2-2">3.5.6.2.2. Le scarpette rosse</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3-6">3.6. Conclusioni</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Premessa al corso di programmazione elementare</h2>
<div class="outline-text-2" id="text-1">
<p>
Il mondo moderno è immerso nella tecnologia.
Oggi sarebbe impensabile pensare ad una vita slegata dagli strumenti tecnologici che usiamo tutti i giorni, che siano semplici interruttori o automobili.
I computer oggi sono ubiquitari, che ce ne accorgiamo o no; sono nelle nostre lavatrici, nelle automobili, negli aerei, nei telefoni fino dal più semplice e non <i>smart</i>.
</p>

<p>
La popolazione è sostanzialmente divisa in <i>nativi</i> e <i>non nativi</i> digitali, persone che hanno potuto accedere al <i>computer</i> in età adulta o post-adolescenziale e persone che sono nate e si sono formate in piena rivoluzione informatica.
Gli approcci delle due fasce di popolazione sono sostanzialmente diversi: La prima generalmente possiede una certa diffidenza <i>naturale</i> verso il mezzo informatico, mentre la seconda lo usa con naturalezza e propensione.
</p>

<p>
Il computer è un superbo mezzo di comunicazione, di lavoro e svago; sempre più potente ed inserito nella vita normale. È un mezzo, per cui né <i>buono</i> né <i>cattivo</i>, dipende solo dall'uso che ne viene fatto.
Il <i>nativo digitale</i> a causa della sua naturalezza all'uso del mezzo informatico è oggi un soggetto potenzialmente a rischio. La maggior parte di noi è consapevole, per esempio, dell'approccio passivo alla televisione; della comunicazione a senso unico che porta e di come in taluni casi questa informazione possa essere manipolata e non corretta. Nessuno di noi però, è ancora propriamente consapevole dei pericoli insiti nell'uso acritico e non corretto dei nostri piccoli ed ubiquitari computer.
</p>

<p>
Abbiamo telefoni intelligenti, tablet o notebook che portiamo ovunque andiamo.
I nostri figli li hanno, mini e microcomputer perennemente connessi ad Internet, dove possono fruire più o meno liberamente dei contenuti più disparati.
Vietare non è la soluzione, impedirgli di usarli non è la soluzione ma solo un tampone temporaneo che presto imparerà a scavalcare.
Si dovrebbe insegnare ai nostri figli, <i>nativi digitali</i>, l'approccio consapevole ed informato. <br >
</p>

<p>
Gli approcci agli insegnamenti informatici vanno rivisti e va rivista l'età in cui iniziare.
Le lezioni di <i>avviamento al computer</i> che venivano e vengono utilizzati oggi non sono più adatti per i <i>nativi digitali</i>. Accendere un computer e lanciare una applicazione per i nostri figli è naturale come per noi accedere il televisore e cambiare canale. Usare un gioco, che è un software, è naturale per loro.
Passivamente naturale, il mito della interattività è solo un percorso preordinato tra tanti progettati a monte dell'utente e si è passivi nell'illusione di non esserlo.
Bisogna passare dalla semplice visione strumentale e <i>alfabetizzazione informatica</i> alla fase di acquisizione delle <i>competenze digitali</i>. <br >
</p>

<p>
Per questo motivo, si dovrebbe insegnare la <i>programmazione dei computer</i> ai bambini in età scolare.
Non per creare una <i>generazione di programmatori</i> (come mi si è accusato), ovviamente, ma per rendere delle persone consapevoli ed attive di fronte al mezzo informatico.
</p>

<p>
Programmare un computer è affrontare e risolvere problemi, <i>problem posing and solving</i>, è imparare a ordinare i pensieri per poter realizzare le idee. 
L'approccio può essere multidisciplinare e il metodo applicabile in molti campi e non necessariamente informatici. Lo studio della <i>programmazione</i> è quindi, oltre alla sua mera applicazione, una formidabile palestra di logica che guida il ragazzo attraverso un percorso che passa per l'analisi, la scomposizione dei problemi, la verifica dei risultati e l'organizzazione del pensiero.
</p>

<p>
Imparare a programmare, insegna la collaborazione e la condivisione (se insegnata nella maniera adeguata) tramite un processo di <i>trial and error</i> e permette allo studente di esprimersi in molti modi. L'approccio produttivo ed anche ludico, potrebbe permettere di attirare e coinvolgere studenti problematici e creare interesse. <br >
</p>

<p>
<i>Quando i bambini creano un progetto come questo, imparano anche a programmare, ma, cosa ancora più importante, programmano per imparare. Perché imparando a programmare, imparano mille altre cose, aprendo nuove opportunità di apprendimento. Ripeto, è utile fare un'analogia con la lettura e la scrittura. Quando si impara a leggere e scrivere, si aprono nuove opportunità per imparare molte altre cose. Quando si impara a leggere, allora si potrà anche leggere per imparare. E imparare a programmare è la stessa cosa. Se si impara a programmare, allora si potrà anche programmare per imparare. Ora, alcune cose che si imparano sono piuttosto ovvie. Si impara qualcosa di più su come funzionano i computer. Ma questo è solamente il punto di partenza. Quando si impara a programmare, si apre la possibilità di imparare molte altre cose.</i> <br >
</p>

<p>
<i>As kids are creating projects like this, <b>they're learning to code, but even more importantly, they're coding to learn</b>. Because as they learn to code, it enables them to learn many other things, opens up many new opportunities for learning. Again, it's useful to make an analogy to reading and writing. When you learn to read and write, it opens up opportunities for you to learn so many other things. When you learn to read, you can then read to learn. And it's the same thing with coding. If you learn to code, you can code to learn. Now some of the things you can learn are sort of obvious. You learn more about how computers work. But that's just where it starts. When you learn to code, it opens up for you to learn many other things.</i> <br >
</p>

<p>
<b>Mitch Resnick</b> (<a href="http://www.ted.com/talks/mitch_resnick_let_s_teach_kids_to_code/transcript">http://www.ted.com/talks/mitch_resnick_let_s_teach_kids_to_code/transcript</a>) <br >
</p>

<p>
È nel contempo importante, insegnare come l'approccio al software ed alla sua produzione debba essere <i>morale</i> spingendo lo studente verso il concetto di <i>Open Source</i>, spostando il valore dal prodotto in sé al produttore (il programmatore); combattendo la visione monopolistica delle grandi <i>software house</i> o <i>software service</i> verso un approccio sostanziale alle tipologie software (anche solo nel rispetto delle direttive ministeriali in materia di software da utilizzare nelle pubbliche amministrazioni). <br >
</p>

<p>
Non va dimenticato inoltre, all'atto pratico, come in futuro la richiesta di programmatori diventerà altissima e quindi si potrebbe fornire agli studenti uno strumento in più.
Esistono numerose esperienze, specialmente negli U.S.A., di insegnamento della programmazione a bambini in età scolare (k-12); mentre per l'Europa si potrebbero citare le esperienze fatte in UK ed Estonia.
</p>
</div>
