test.org
** Ambienti liberi per l'insegnamento della programmazione a bambini e ragazzi.

Per avvicinare gli studenti alla programmazione informatica esistono già numerosi strumenti con un approccio più o meno /visuale/. In questa sede si prenderanno in considerazione solo strumenti Open Source per i motivi espressi sopra.

*** Scratch

È una piattaforma sviluppata al MIT (Massachusetts Institute of Technology) nel /Lifelong Kindergarten Group/ (http://scratch.mit.edu/) e progettata specificatamente per bambini di età scolare e prescolare. L'approccio è totalmente visuale con blocchi logici colorati e di facile comprensione. È adatto per insegnare la strutturazione del flusso delle istruzioni rendendola facilmente identificabile con risultati rapidi e non frustranti per il bambino.
Ne esistono attualmente due versioni una scritta in /Smalltalk/ (http://scratch.mit.edu/scratch_1.4), quella originale, mentre una seconda fruibile online e scritta in /ActionScript/ (http://scratch.mit.edu/projects/editor/?tip_bar=getStarted) o scaricabile (http://scratch.mit.edu/scratch2download/).

Scratch ha dato vita a numerosi progetti simili, come per esempio AppInventor (http://appinventor.mit.edu/explore/), Blockly (https://code.google.com/p/blockly/), Stencyl (http://www.stencyl.com/).

*** Alice

Alice è un ambiente visuale per la creazione di mondi virtuali in 3D ed è il risultato di un progetto della Carnegie Mellon University di Pittsburgh (Pennsylvania).

*** Hackety Hack

È un piccolo ambiente (http://hackety.com/) per l'insegnamento alla programmazione nel linguaggio Ruby (https://www.ruby-lang.org/it/). Il linguaggio di programmazione Ruby è nato nel 1992 scritto da Yukihiro Matsumoto. Oggi è un linguaggio molto popolare (anche se non popolarissimo in Italia). Le sue peculiari caratteristiche di immediatezza nell'utilizzo ne fanno un buon candidato per l'insegnamento anche a bambini in età scolare.

*** KidsRuby

KidsRuby (http://www.kidsruby.com/) è una evoluzione di Hackety Hack. Come il suo ispiratore usa Ruby come linguaggio.

*** Kojo
Kojo è sviluppato da Lalit Pant (Himjyoti school, Dehradun - India) ed è utilizzato in varie scuole indiane, statunitensi, inglesi e svedesi.
L'approccio usato nella piattaforma Kojo (http://www.kogics.net/kojo) è più ampio dei precedenti. Può essere rivolto a più livelli di apprendimento ed è dotato di parti specifiche, per esempio per la sperimentazione in ambito matematico con un laboratorio basato su GeoGebra (http://www.geogebra.org/cms/it/). Il linguaggio utilizzato è Scala (http://www.scala-lang.org/).
Scala è un linguaggio estremamente potente e multiparadigma (Orientato agli oggetti, funzionale) che può essere utilizzato a vari livelli, sufficientemente semplice da poter essere insegnato in età scolare (dalla classe 4° primaria). La sua caratteristica di linguaggio funzionale lo fa particolarmente utile nella risoluzione di problemi matematici. I linguaggi funzionali sono una modalità di programmazione in forte ascesa in questi ultimi anni e sicuramente lo saranno anche per i prossimi.



* Perché Ruby direttamente e non un ambiente /facilitato/.

È una scelta difficile non partire con un ambiente facilitato, come Scratch per esempio. Scratch è sicuramente un ottimo ambiente per l'insegnamento della logica di programmazione ai bambini. Scratch è colorato e simpatico, ha una mascotte (un gatto) e permette velocemente di ottenere risultati con grafica e suoni, sembra un gioco. Il suo sembrare /troppo/ un gioco tende però a fuorviare i bambini dallo scopo primario.
I nostri ragazzi non hanno una mentalità /anglosassone/ e sono meno organizzati e disciplinati degli /anglosassoni/, il che rende ambienti /troppo ludici/ dispersivi. I bambini /nativi digitali/ tenderanno a giocare troppo con gli strumenti; potendo, per esempio, facilmente disegnare /sprite/ (oggetti grafici) e farli muovere manualmente.

Scopo di un corso di programmazione è anche aumentare la percezione del computer stesso, come un insieme di hardware e sistema operativo con software applicativo. L'utente dovrebbe distinguere ed utilizzare le varie parti e capirne le relazioni, altrimenti si potrebbe incorrere nello stesso errore: il nascondere parti sostanziali; che renderà l'utilizzo dello strumento informatico più o meno passivo.

Inoltre, questi ambienti sono troppo orientati ad una /logica di tipo imperativo/ e legati ad un /diagramma di flusso/ di, ormai, vecchia concezione. Un problema tipico dei programmatori di computer è il cambio di /paradigma/ come molti studi ed esperienze dimostrano. Cambiare stile di programmazione è difficile e quindi introdurre i giovani verso linguaggi multiparadigma potrà solo renderli più flessibili in futuro. 


* Programmare in Ruby

** Premessa

Questo sarà un piccolo corso per l'avvio alla programmazione in Ruby, un linguaggio estremamente semplice e divertente ma non per questo banale.
Ruby ha in sé tutte le caratteristiche per essere un ottimo /linguaggio di programmazione multiparadigma/ ed essere adatto per l'insegnamento delle basi della programmazione dei computer moderna.

*/Ruby è divertente/*.

** cosa è Ruby

Questo è copiato semplicemente dal sito web di Ruby:

/Ruby è un linguaggio di equilibrio e armonia. Il suo creatore, Yukihiro “Matz” Matsumoto, ha fuso insieme parti dei suoi linguaggi di programmazione preferiti (Perl, Smalltalk, Eiffel, Ada e Lisp) per creare un nuovo linguaggio in grado di bilanciare programmazione funzionale con programmazione imperativa./

/Lui stesso ha detto più volte che sta continuamente "provando a rendere Ruby naturale, non semplice", in un modo che rispecchia la vita./

/Chiarificando questo concetto, Matz aggiunge:/

    /Ruby è apparentemente semplice, ma al suo interno è molto complesso, proprio come il corpo umano./


