test.html

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Ambienti liberi per l'insegnamento della programmazione a bambini e ragazzi.</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Per avvicinare gli studenti alla programmazione informatica esistono già numerosi strumenti con un approccio più o meno <i>visuale</i>. In questa sede si prenderanno in considerazione solo strumenti Open Source per i motivi espressi sopra.
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Scratch</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
È una piattaforma sviluppata al MIT (Massachusetts Institute of Technology) nel <i>Lifelong Kindergarten Group</i> (<a href="http://scratch.mit.edu/">http://scratch.mit.edu/</a>) e progettata specificatamente per bambini di età scolare e prescolare. L'approccio è totalmente visuale con blocchi logici colorati e di facile comprensione. È adatto per insegnare la strutturazione del flusso delle istruzioni rendendola facilmente identificabile con risultati rapidi e non frustranti per il bambino.
Ne esistono attualmente due versioni una scritta in <i>Smalltalk</i> (<a href="http://scratch.mit.edu/scratch_1.4">http://scratch.mit.edu/scratch_1.4</a>), quella originale, mentre una seconda fruibile online e scritta in <i>ActionScript</i> (<a href="http://scratch.mit.edu/projects/editor/?tip_bar=getStarted">http://scratch.mit.edu/projects/editor/?tip_bar=getStarted</a>) o scaricabile (<a href="http://scratch.mit.edu/scratch2download/">http://scratch.mit.edu/scratch2download/</a>).
</p>

<p>
Scratch ha dato vita a numerosi progetti simili, come per esempio AppInventor (<a href="http://appinventor.mit.edu/explore/">http://appinventor.mit.edu/explore/</a>), Blockly (<a href="https://code.google.com/p/blockly/">https://code.google.com/p/blockly/</a>), Stencyl (<a href="http://www.stencyl.com/">http://www.stencyl.com/</a>).
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Alice</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Alice è un ambiente visuale per la creazione di mondi virtuali in 3D ed è il risultato di un progetto della Carnegie Mellon University di Pittsburgh (Pennsylvania).
</p>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Hackety Hack</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
È un piccolo ambiente (<a href="http://hackety.com/">http://hackety.com/</a>) per l'insegnamento alla programmazione nel linguaggio Ruby (<a href="https://www.ruby-lang.org/it/">https://www.ruby-lang.org/it/</a>). Il linguaggio di programmazione Ruby è nato nel 1992 scritto da Yukihiro Matsumoto. Oggi è un linguaggio molto popolare (anche se non popolarissimo in Italia). Le sue peculiari caratteristiche di immediatezza nell'utilizzo ne fanno un buon candidato per l'insegnamento anche a bambini in età scolare.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> KidsRuby</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
KidsRuby (<a href="http://www.kidsruby.com/">http://www.kidsruby.com/</a>) è una evoluzione di Hackety Hack. Come il suo ispiratore usa Ruby come linguaggio.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> Kojo</h4>
<div class="outline-text-4" id="text-1-1-5">
<p>
Kojo è sviluppato da Lalit Pant (Himjyoti school, Dehradun - India) ed è utilizzato in varie scuole indiane, statunitensi, inglesi e svedesi.
L'approccio usato nella piattaforma Kojo (<a href="http://www.kogics.net/kojo">http://www.kogics.net/kojo</a>) è più ampio dei precedenti. Può essere rivolto a più livelli di apprendimento ed è dotato di parti specifiche, per esempio per la sperimentazione in ambito matematico con un laboratorio basato su GeoGebra (<a href="http://www.geogebra.org/cms/it/">http://www.geogebra.org/cms/it/</a>). Il linguaggio utilizzato è Scala (<a href="http://www.scala-lang.org/">http://www.scala-lang.org/</a>).
Scala è un linguaggio estremamente potente e multiparadigma (Orientato agli oggetti, funzionale) che può essere utilizzato a vari livelli, sufficientemente semplice da poter essere insegnato in età scolare (dalla classe 4° primaria). La sua caratteristica di linguaggio funzionale lo fa particolarmente utile nella risoluzione di problemi matematici. I linguaggi funzionali sono una modalità di programmazione in forte ascesa in questi ultimi anni e sicuramente lo saranno anche per i prossimi.
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Perché Ruby direttamente e non un ambiente <i>facilitato</i>.</h2>
<div class="outline-text-2" id="text-2">
<p>
È una scelta difficile non partire con un ambiente facilitato, come Scratch per esempio. Scratch è sicuramente un ottimo ambiente per l'insegnamento della logica di programmazione ai bambini. Scratch è colorato e simpatico, ha una mascotte (un gatto) e permette velocemente di ottenere risultati con grafica e suoni, sembra un gioco. Il suo sembrare <i>troppo</i> un gioco tende però a fuorviare i bambini dallo scopo primario.
I nostri ragazzi non hanno una mentalità <i>anglosassone</i> e sono meno organizzati e disciplinati degli <i>anglosassoni</i>, il che rende ambienti <i>troppo ludici</i> dispersivi. I bambini <i>nativi digitali</i> tenderanno a giocare troppo con gli strumenti; potendo, per esempio, facilmente disegnare <i>sprite</i> (oggetti grafici) e farli muovere manualmente.
</p>

<p>
Scopo di un corso di programmazione è anche aumentare la percezione del computer stesso, come un insieme di hardware e sistema operativo con software applicativo. L'utente dovrebbe distinguere ed utilizzare le varie parti e capirne le relazioni, altrimenti si potrebbe incorrere nello stesso errore: il nascondere parti sostanziali; che renderà l'utilizzo dello strumento informatico più o meno passivo.
</p>

<p>
Inoltre, questi ambienti sono troppo orientati ad una <i>logica di tipo imperativo</i> e legati ad un <i>diagramma di flusso</i> di, ormai, vecchia concezione. Un problema tipico dei programmatori di computer è il cambio di <i>paradigma</i> come molti studi ed esperienze dimostrano. Cambiare stile di programmazione è difficile e quindi introdurre i giovani verso linguaggi multiparadigma potrà solo renderli più flessibili in futuro. 
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Programmare in Ruby</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Premessa</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Questo sarà un piccolo corso per l'avvio alla programmazione in Ruby, un linguaggio estremamente semplice e divertente ma non per questo banale.
Ruby ha in sé tutte le caratteristiche per essere un ottimo <i>linguaggio di programmazione multiparadigma</i> ed essere adatto per l'insegnamento delle basi della programmazione dei computer moderna.
</p>

<p>
<b><i>Ruby è divertente</i></b>.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> cosa è Ruby</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Questo è copiato semplicemente dal sito web di Ruby:
</p>

<p>
<i>Ruby è un linguaggio di equilibrio e armonia. Il suo creatore, Yukihiro “Matz” Matsumoto, ha fuso insieme parti dei suoi linguaggi di programmazione preferiti (Perl, Smalltalk, Eiffel, Ada e Lisp) per creare un nuovo linguaggio in grado di bilanciare programmazione funzionale con programmazione imperativa.</i>
</p>

<p>
<i>Lui stesso ha detto più volte che sta continuamente "provando a rendere Ruby naturale, non semplice", in un modo che rispecchia la vita.</i>
</p>

<p>
<i>Chiarificando questo concetto, Matz aggiunge:</i>
</p>

<p>
<i>Ruby è apparentemente semplice, ma al suo interno è molto complesso, proprio come il corpo umano.</i>
</p>
</div>
</div>
