test.org
** Cosa serve

Ruby è un linguaggio di programmazione.
Un linguaggio di programmazione è, come un linguaggio naturale, un insieme di regole e convenzioni per permetterci di parlare con i computer.
I computer sono macchine di calcolo /stupide/ e devono essere istruite.
Per utilizzare un linguaggio di programmazione serve un /software/, un programma per computer. È il problema del /cane che si morde la coda/, per scrivere un /software/ ci vuole un altro /software/.
Quindi per usare Ruby dobbiamo installare l'/interprete/ *Ruby*.
Qui potremmo entrare in una distinzione inizialmente un po' difficile: cosa è un /interprete/ e cosa è un /compilatore/. La differenza oggi è molto /labile/, ma comunque in generale:

+ l'/interprete/ è un software che legge, interpreta direttamente ed esegue un programma scritto in un linguaggio.
+ un /compilatore/ è un software che legge, interpreta e trasforma in dati binari un programma scritto in un linguaggio, salvando sul disco un file detto /eseguibile/ che potrà essere lanciato (/eseguito/) direttamente.


Quindi abbiamo bisogno dell'/interprete/ Ruby.

Questo software è /multipiattaforma/, il che vuol dire che può funzionare (più o meno bene) su molti sistemi operativi.

Cosa è un sistema operativo:

+ Un sistema operativo è il /software di base/ del computer, senza esso non si potrebbe utilizzare.

Di sistemi operativi ne esistono molti. Forse il più conosciuto è Microsoft Windows^{(tm)} ma non è il solo. Esistono le distribuzioni Linux, per esempio, il MacOSX^{(tm)} o l'Android che avete probabilmente nei tablet o telefoni. Ne esistono davvero molti, a pagamento o gratuiti e per molteplici utilizzi.

Ruby funziona in molti di essi. 

Ruby ha un sito web dedicato: https://www.ruby-lang.org, dove ci sono tantissime informazioni su di esso, dalla sua storia alla documentazione e per finire al software stesso e le indicazioni su come installarlo (cioè metterlo) nel computer che possedete.
L'interprete può essere prelevato come codice sorgente, ha una licenza /Open Source/, compilarlo ed installarlo; altrimenti se ne può utilizzare una versione già pronta per il sistema operativo che volete.
Come si può vedere dalle pagine web relative: https://www.ruby-lang.org/it/downloads/ e https://www.ruby-lang.org/it/installation/, ci sono varie /implementazioni/ dell'/interprete/.

Installate o fatevi installare la più adatta.

Vi dovete anche procurare un /editor di testo/ per programmatori. È un più o meno semplice programma per scrivere, diverso dal /word processor/ che usate per scrivere. Spesso questi /editor/ hanno la possibilità di evidenziare la /sintassi/ (le parole) del linguaggio in colori diversi, permettendo di poter trovare le parti del programma che state scrivendo a /colpo d'occhio/ e limitandone anche gli errori di battitura.

Qui: https://www.ruby-lang.org/it/documentation/, ne trovate una lista in fondo alla pagina, sappiate comunque che esistono tantissimi /editor/ per programmatori che lì non sono elencati. Alcuni sono a pagamento ed altri sono gratuiti, /open Source/ o no.

Ruby è un linguaggio diffuso oggi, quindi un qualunque editor per programmatori avrà una evidenziazione colorata per la sua sintassi.


** Le basi

In questo capitolo vedremo la /base/ della programmazione in Ruby, alcuni elementi chiave e tipi di dati più diffusi.

