test.html


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Cosa serve</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Ruby è un linguaggio di programmazione.
Un linguaggio di programmazione è, come un linguaggio naturale, un insieme di regole e convenzioni per permetterci di parlare con i computer.
I computer sono macchine di calcolo <i>stupide</i> e devono essere istruite.
Per utilizzare un linguaggio di programmazione serve un <i>software</i>, un programma per computer. È il problema del <i>cane che si morde la coda</i>, per scrivere un <i>software</i> ci vuole un altro <i>software</i>.
Quindi per usare Ruby dobbiamo installare l'<i>interprete</i> <b>Ruby</b>.
Qui potremmo entrare in una distinzione inizialmente un po' difficile: cosa è un <i>interprete</i> e cosa è un <i>compilatore</i>. La differenza oggi è molto <i>labile</i>, ma comunque in generale:
</p>

<ul class="org-ul">
<li>l'<i>interprete</i> è un software che legge, interpreta direttamente ed esegue un programma scritto in un linguaggio.
</li>
<li>un <i>compilatore</i> è un software che legge, interpreta e trasforma in dati binari un programma scritto in un linguaggio, salvando sul disco un file detto <i>eseguibile</i> che potrà essere lanciato (<i>eseguito</i>) direttamente.
</li>
</ul>


<p>
Quindi abbiamo bisogno dell'<i>interprete</i> Ruby.
</p>

<p>
Questo software è <i>multipiattaforma</i>, il che vuol dire che può funzionare (più o meno bene) su molti sistemi operativi.
</p>

<p>
Cosa è un sistema operativo:
</p>

<ul class="org-ul">
<li>Un sistema operativo è il <i>software di base</i> del computer, senza esso non si potrebbe utilizzare.
</li>
</ul>

<p>
Di sistemi operativi ne esistono molti. Forse il più conosciuto è Microsoft Windows<sup>(tm)</sup> ma non è il solo. Esistono le distribuzioni Linux, per esempio, il MacOSX<sup>(tm)</sup> o l'Android che avete probabilmente nei tablet o telefoni. Ne esistono davvero molti, a pagamento o gratuiti e per molteplici utilizzi.
</p>

<p>
Ruby funziona in molti di essi. 
</p>

<p>
Ruby ha un sito web dedicato: <a href="https://www.ruby-lang.org">https://www.ruby-lang.org</a>, dove ci sono tantissime informazioni su di esso, dalla sua storia alla documentazione e per finire al software stesso e le indicazioni su come installarlo (cioè metterlo) nel computer che possedete.
L'interprete può essere prelevato come codice sorgente, ha una licenza <i>Open Source</i>, compilarlo ed installarlo; altrimenti se ne può utilizzare una versione già pronta per il sistema operativo che volete.
Come si può vedere dalle pagine web relative: <a href="https://www.ruby-lang.org/it/downloads/">https://www.ruby-lang.org/it/downloads/</a> e <a href="https://www.ruby-lang.org/it/installation/">https://www.ruby-lang.org/it/installation/</a>, ci sono varie <i>implementazioni</i> dell'<i>interprete</i>.
</p>

<p>
Installate o fatevi installare la più adatta.
</p>

<p>
Vi dovete anche procurare un <i>editor di testo</i> per programmatori. È un più o meno semplice programma per scrivere, diverso dal <i>word processor</i> che usate per scrivere. Spesso questi <i>editor</i> hanno la possibilità di evidenziare la <i>sintassi</i> (le parole) del linguaggio in colori diversi, permettendo di poter trovare le parti del programma che state scrivendo a <i>colpo d'occhio</i> e limitandone anche gli errori di battitura.
</p>

<p>
Qui: <a href="https://www.ruby-lang.org/it/documentation/">https://www.ruby-lang.org/it/documentation/</a>, ne trovate una lista in fondo alla pagina, sappiate comunque che esistono tantissimi <i>editor</i> per programmatori che lì non sono elencati. Alcuni sono a pagamento ed altri sono gratuiti, <i>open Source</i> o no.
</p>

<p>
Ruby è un linguaggio diffuso oggi, quindi un qualunque editor per programmatori avrà una evidenziazione colorata per la sua sintassi.
</p>
</div>
</div>


<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Le basi</h3>
<div class="outline-text-3" id="text-3-4">
<p>
In questo capitolo vedremo la <i>base</i> della programmazione in Ruby, alcuni elementi chiave e tipi di dati più diffusi.
</p>
</div>
