test.org
*** Iniziamo con i numeri e le stringhe

Ruby ha anche un /REPL/, /Read Eval Print Loop/, che a parte la parola difficile sta a significare che si possono mandare direttamente comandi all'interprete.
Nella distribuzione di Ruby c'è un programma (scritto in Ruby) che si chiama /irb (interactive ruby)/. Per lanciarlo dovete saper usare un minimo un terminale dei comandi. Un terminale dei comandi è, nel vostro sistema operativo moderno, una finestra in cui lo sfondo è spesso nero con un cursore che lampeggia. Ci potete scrivere dentro e mandare comandi al sistema operativo.

Cercate nei vai menù del sistema qualcosa del tipo: /prompt dei comandi/ o /terminale/...

Lanciata la /console dei comandi/ ci scrivete dentro /irb/ e premete invio.

#+begin_src ruby

irb(main):001:0> 

#+end_src

A questo punto potete inviare comandi all'interprete e confermare premendo invio.

#+begin_src ruby

irb(main):001:0>  1 + 2
=> 3
irb(main):002:0>
 
#+end_src

Se scrivete 1 + 2 avrete il risultato. Ruby è anche una /calcolatrice/.
Provate a fare dei calcoli con le operazioni che conoscete, saranno rispettate le regole matematiche di precedenza degli operatori che vi sono state insegnate: 

+ *+* addizione
+ *-* sottrazione
+ *** moltiplicazione
+ */* divisione
+ *%* modulo
+ **** esponente

Bisogna stare attenti alla divisione, come la maggior parte dei linguaggi di programmazione. Se per esempio:

#+begin_src ruby

irb(main):013:0> 10 / 7
=> 1
irb(main):014:0> 

#+end_src

potete vedere come il risultato è 1. Per trovare il resto della divisione dovete effettuare una operazione di /modulo/ che vi restituisce il resto:

#+begin_src ruby

irb(main):014:0> 10 % 7
=> 3
irb(main):015:0> 

#+end_src

che ovviamente è 3. Quindi l'operatore */* nel caso in cui i due numeri (operandi) siano di tipo /intero/ eseguirà una divisione intera, troncando la parte decimale.

Per avere la parte decimale si deve fare così:

#+begin_src ruby

irb(main):015:0> 10 / 7.0
=> 1.4285714285714286
irb(main):016:0> 

#+end_src

e cioè scrivere almeno uno degli operandi nella forma cosiddetta /a virgola mobile o flottante/ (float). L'interprete allora saprà che dovrà eseguire una divisione non intera.
Nel caso in cui facciate una operazione di modulo con almeno un operando di tipo /float/

#+begin_src ruby

irb(main):016:0> 10 % 7.0
=> 3.0
irb(main):017:0> 

#+end_src

il risultato sarà come per la divisione intera ma con il tipo del risultato in virgola (/float/).
Ruby supporta le parentesi tonde che possono essere annidate (scritte le une dentro le altre) liberamente.
Come per gli altri linguaggi di programmazione le parentesi graffe e quadre sono usate per altri scopi e non quello di alterare le precedenze degli operatori o raggruppare i calcoli.

#+begin_src ruby

irb(main):017:0> (2 + 3) * 2
=> 10
irb(main):018:0>
 
#+end_src

I linguaggi di programmazione sono in grado di manipolare numerosi tipi di dati e fino a qui ne abbiamo visti due:

+ numeri interi (/integer/)
+ numeri in virgola mobile (/float/)

questi sono chiamati in Ruby /Fixnum/ e /Float/ rispettivamente.

Per esempio:

#+begin_src ruby

irb(main):019:0> 1.class
=> Fixnum
irb(main):020:0> 1.0.class
=> Float
irb(main):021:0> 
 
#+end_src

Vedremo in seguito cosa significa /1.class/ e /1.0.class/, per adesso lasciamola come una cosa /magica/ di Ruby: la possibilità di sapere quando serve il tipo di un certo dato (la /riflessione/). \\

Un tipo di dato importantissimo in cui Ruby eccelle sono le stringhe (/String/).
Le stringhe sono una sequenza di caratteri, un testo insomma, una dietro l'altra compresi gli spazi ed i vari segni di punteggiatura.

#+begin_src ruby

irb(main):021:0> "ciao mondo"
=> "ciao mondo"
irb(main):022:0> 'ciao modo'
=> "ciao modo"
irb(main):023:0> 

#+end_src

Come potete vedere si possono usare sia le virgolette singole che quelle doppie. In questo caso non c'è differenza ma in altri sì e vedremo in seguito.
Le stringhe come i numeri possono essere sommate (/concatenate/):

#+begin_src ruby

irb(main):024:0> "ciao" + "mondo"
=> "ciaomondo"
irb(main):025:0> 

#+end_src

ma non sottratte (almeno non così):

#+begin_src ruby

irb(main):025:0> "ciao" - "mondo"
NoMethodError: undefined method `-' for "ciao":String
	from (irb):25
	from /home/nissl/bin/ruby-2.1/bin/irb:11:in `<main>'
irb(main):026:0> 

#+end_src

Come vedete l'interprete ha dato un errore e si è fermato comunicandolo. In questa maniera possiamo sapere dove è l'errore e che tipo di errore è.

Le stringhe possono però essere moltiplicate per un numero ma non per un'altra stringa:

#+begin_src ruby

irb(main):028:0> 'pippo' * 5
=> "pippopippopippopippopippo"
irb(main):029:0> 

irb(main):029:0> 'pippo' * 'pippo'
TypeError: no implicit conversion of String into Integer
	from (irb):29:in `*'
	from (irb):29
	from /home/nissl/bin/ruby-2.1/bin/irb:11:in `<main>'
irb(main):030:0> 

#+end_src

In questo esempio ho moltiplicato una stringa per un numero e sommata ad un'altra:

#+begin_src ruby

irb(main):031:0> "pippo" * 5 + "pluto"
=> "pippopippopippopippopippopluto"
irb(main):032:0> 

#+end_src

Come potete vedere, le regole di precedenza sono state applicate: prima la moltiplicazione e poi la somma.
Nelle stringhe è possibile fare degli errori strani.

Guardate questa:

#+begin_src ruby

'pippo è andato dall'altra parte'

#+end_src

Questo è un errore. Come potete vedere la stringa inizia con una virgoletta singola (/apice singolo/) e termina con una virgoletta singola. Dove termina però? La colorazione della sintassi può aiutare a capire.
Per l'interprete la stringa termina dopo la parola /dall/. Il resto non è nella stringa. Per superare problemi come questo ci sono due modi principali:

#+begin_src ruby

'pippo è andato dall\'altra parte'
"pippo è andato dall'altra parte"

#+end_src

Ho usato nella prima riga il carattere *\* (/escape/) che dice a Ruby di trattare il carattere che subito lo segue come un carattere della stringa e non come un terminatore della stessa.
Nel secondo caso, ho racchiuso la stringa tra virgolette doppie (/apice doppio/) e quindi ho potuto usare l'apice singolo liberamente.

Ora che ci siamo va capita bene la differenza tra numeri e stringhe:

+ 25 è un numero
+ '25' è una stringa
+ "25" è una stringa
+ '25 * 25' è una stringa e non una operazione
+ 25 * 25 è una moltiplicazione tra due numeri
+ "pippo" * 5 va bene e verrà ripetuta la parola /pippo/ per cinque volte
+ 5 * "pippo" non va bene perché significa /pippo volte il numero 5/.

Provate tutte le possibili varianti che vi vengono in mente.

