test.html

<div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> Iniziamo con i numeri e le stringhe</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
Ruby ha anche un <i>REPL</i>, <i>Read Eval Print Loop</i>, che a parte la parola difficile sta a significare che si possono mandare direttamente comandi all'interprete.
Nella distribuzione di Ruby c'è un programma (scritto in Ruby) che si chiama <i>irb (interactive ruby)</i>. Per lanciarlo dovete saper usare un minimo un terminale dei comandi. Un terminale dei comandi è, nel vostro sistema operativo moderno, una finestra in cui lo sfondo è spesso nero con un cursore che lampeggia. Ci potete scrivere dentro e mandare comandi al sistema operativo.
</p>

<p>
Cercate nei vai menù del sistema qualcosa del tipo: <i>prompt dei comandi</i> o <i>terminale</i>&#x2026;
</p>

<p>
Lanciata la <i>console dei comandi</i> ci scrivete dentro <i>irb</i> e premete invio.
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:001</span>:0&gt;
</pre>
</div>

<p>
A questo punto potete inviare comandi all'interprete e confermare premendo invio.
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:001</span>:0&gt;  1 + 2
=&gt; 3
irb(main)<span class="org-constant">:002</span>:0&gt;
</pre>
</div>

<p>
Se scrivete 1 + 2 avrete il risultato. Ruby è anche una <i>calcolatrice</i>.
Provate a fare dei calcoli con le operazioni che conoscete, saranno rispettate le regole matematiche di precedenza degli operatori che vi sono state insegnate: 
</p>

<ul class="org-ul">
<li><b>+</b>, addizione
</li>
<li><b>-</b>, sottrazione
</li>
<li><b>*</b>, moltiplicazione
</li>
<li><b>/</b>, divisione
</li>
<li><b>%</b>, modulo
</li>
<li><b>**</b>, esponente
</li>
</ul>

<p>
Bisogna stare attenti alla divisione, come la maggior parte dei linguaggi di programmazione. Se per esempio:
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:013</span>:0&gt; 10 / 7
=&gt; 1
irb(main)<span class="org-constant">:014</span>:0&gt;
</pre>
</div>

<p>
potete vedere come il risultato è 1. Per trovare il resto della divisione dovete effettuare una operazione di <i>modulo</i> che vi restituisce il resto:
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:014</span>:0&gt; 10 % 7
=&gt; 3
irb(main)<span class="org-constant">:015</span>:0&gt;
</pre>
</div>

<p>
che ovviamente è 3. Quindi l'operatore <b>/</b> nel caso in cui i due numeri (operandi) siano di tipo <i>intero</i> eseguirà una divisione intera, troncando la parte decimale.
</p>

<p>
Per avere la parte decimale si deve fare così:
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:015</span>:0&gt; 10 / 7.0
=&gt; 1.4285714285714286
irb(main)<span class="org-constant">:016</span>:0&gt;
</pre>
</div>

<p>
e cioè scrivere almeno uno degli operandi nella forma cosiddetta <i>a virgola mobile o flottante</i> (float). L'interprete allora saprà che dovrà eseguire una divisione non intera.
Nel caso in cui facciate una operazione di modulo con almeno un operando di tipo <i>float</i>
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:016</span>:0&gt; 10 % 7.0
=&gt; 3.0
irb(main)<span class="org-constant">:017</span>:0&gt;
</pre>
</div>

<p>
il risultato sarà come per la divisione intera ma con il tipo del risultato in virgola (<i>float</i>).
Ruby supporta le parentesi tonde che possono essere annidate (scritte le une dentro le altre) liberamente.
Come per gli altri linguaggi di programmazione le parentesi graffe e quadre sono usate per altri scopi e non quello di alterare le precedenze degli operatori o raggruppare i calcoli.
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:017</span>:0&gt; (2 + 3) * 2
=&gt; 10
irb(main)<span class="org-constant">:018</span>:0&gt;
</pre>
</div>

<p>
I linguaggi di programmazione sono in grado di manipolare numerosi tipi di dati e fino a qui ne abbiamo visti due:
</p>

<ul class="org-ul">
<li>numeri interi (<i>integer</i>)
</li>
<li>numeri in virgola mobile (<i>float</i>)
</li>
</ul>

<p>
questi sono chiamati in Ruby <i>Fixnum</i> e <i>Float</i> rispettivamente.
</p>

<p>
Per esempio:
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:019</span>:0&gt; 1.class
=&gt; <span class="org-type">Fixnum</span>
irb(main)<span class="org-constant">:020</span>:0&gt; 1.0.class
=&gt; <span class="org-type">Float</span>
irb(main)<span class="org-constant">:021</span>:0&gt;
</pre>
</div>

<p>
Vedremo in seguito cosa significa <i>1.class</i> e <i>1.0.class</i>, per adesso lasciamola come una cosa <i>magica</i> di Ruby: la possibilità di sapere quando serve il tipo di un certo dato (la <i>riflessione</i>). <br >
</p>

<p>
Un tipo di dato importantissimo in cui Ruby eccelle sono le stringhe (<i>String</i>).
Le stringhe sono una sequenza di caratteri, un testo insomma, una dietro l'altra compresi gli spazi ed i vari segni di punteggiatura.
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:021</span>:0&gt; <span class="org-string">"ciao mondo"</span>
=&gt; <span class="org-string">"ciao mondo"</span>
irb(main)<span class="org-constant">:022</span>:0&gt; <span class="org-string">'ciao modo'</span>
=&gt; <span class="org-string">"ciao modo"</span>
irb(main)<span class="org-constant">:023</span>:0&gt;
</pre>
</div>

<p>
Come potete vedere si possono usare sia le virgolette singole che quelle doppie. In questo caso non c'è differenza ma in altri sì e vedremo in seguito.
Le stringhe come i numeri possono essere sommate (<i>concatenate</i>):
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:024</span>:0&gt; <span class="org-string">"ciao"</span> + <span class="org-string">"mondo"</span>
=&gt; <span class="org-string">"ciaomondo"</span>
irb(main)<span class="org-constant">:025</span>:0&gt;
</pre>
</div>

<p>
ma non sottratte (almeno non così):
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:025</span>:0&gt; <span class="org-string">"ciao"</span> - <span class="org-string">"mondo"</span>
<span class="org-type">NoMethodError</span>: undefined method <span class="org-string">`-' for "ciao":String</span>
<span class="org-string">        from (irb):25</span>
<span class="org-string">        from /home/nissl/bin/ruby-2.1/bin/irb:11:in `</span>&lt;main&gt;<span class="org-string">'</span>
<span class="org-string">irb(main):026:0&gt;</span>
</pre>
</div>

<p>
Come vedete l'interprete ha dato un errore e si è fermato comunicandolo. In questa maniera possiamo sapere dove è l'errore e che tipo di errore è.
</p>

<p>
Le stringhe possono però essere moltiplicate per un numero ma non per un'altra stringa:
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:028</span>:0&gt; <span class="org-string">'pippo'</span> * 5
=&gt; <span class="org-string">"pippopippopippopippopippo"</span>
irb(main)<span class="org-constant">:029</span>:0&gt; 

irb(main)<span class="org-constant">:029</span>:0&gt; <span class="org-string">'pippo'</span> * <span class="org-string">'pippo'</span>
<span class="org-type">TypeError</span>: no implicit conversion of <span class="org-type">String</span> into <span class="org-type">Integer</span>
        from (irb)<span class="org-constant">:29</span>:in <span class="org-string">`*'</span>
<span class="org-string">        from (irb):29</span>
<span class="org-string">        from /home/nissl/bin/ruby-2.1/bin/irb:11:in `</span>&lt;main&gt;<span class="org-string">'</span>
<span class="org-string">irb(main):030:0&gt;</span>
</pre>
</div>

<p>
In questo esempio ho moltiplicato una stringa per un numero e sommata ad un'altra:
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:031</span>:0&gt; <span class="org-string">"pippo"</span> * 5 + <span class="org-string">"pluto"</span>
=&gt; <span class="org-string">"pippopippopippopippopippopluto"</span>
irb(main)<span class="org-constant">:032</span>:0&gt;
</pre>
</div>

<p>
Come potete vedere, le regole di precedenza sono state applicate: prima la moltiplicazione e poi la somma.
Nelle stringhe è possibile fare degli errori strani.
</p>

<p>
Guardate questa:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-string">'pippo &#232; andato dall'</span>altra parte<span class="org-string">'</span>
</pre>
</div>

<p>
Questo è un errore. Come potete vedere la stringa inizia con una virgoletta singola (<i>apice singolo</i>) e termina con una virgoletta singola. Dove termina però? La colorazione della sintassi può aiutare a capire.
Per l'interprete la stringa termina dopo la parola <i>dall</i>. Il resto non è nella stringa. Per superare problemi come questo ci sono due modi principali:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-string">'pippo &#232; andato dall\'altra parte'</span>
<span class="org-string">"pippo &#232; andato dall'altra parte"</span>
</pre>
</div>

<p>
Ho usato nella prima riga il carattere <b>\</b> (<i>escape</i>) che dice a Ruby di trattare il carattere che subito lo segue come un carattere della stringa e non come un terminatore della stessa.
Nel secondo caso, ho racchiuso la stringa tra virgolette doppie (<i>apice doppio</i>) e quindi ho potuto usare l'apice singolo liberamente.
</p>

<p>
Ora che ci siamo va capita bene la differenza tra numeri e stringhe:
</p>

<ul class="org-ul">
<li>25 è un numero
</li>
<li>'25' è una stringa
</li>
<li>"25" è una stringa
</li>
<li>'25 * 25' è una stringa e non una operazione
</li>
<li>25 * 25 è una moltiplicazione tra due numeri
</li>
<li>"pippo" * 5 va bene e verrà ripetuta la parola <i>pippo</i> per cinque volte
</li>
<li>5 * "pippo" non va bene perché significa <i>pippo volte il numero 5</i>.
</li>
</ul>

<p>
Provate tutte le possibili varianti che vi vengono in mente.
</p>
</div>
</div>
