test.org
*** Le variabili e gli assegnamenti

Ogni linguaggio d programmazione che si rispetti, ci permette di calcolare cose che non sappiamo /a priori/, altrimenti non servirebbero a niente. Fino ad adesso avete visto come utilizzare dei valori, ora vediamo come creare valori e recuperarli per quando ci servono.

Le /variabili/ sono come delle scatole dove mettete delle cose e l'/assegnamento/ è l'azione del mettercele dentro. Direi che è semplice.

#+begin_src ruby

numero_delle_pere = 12
numero_delle_pere_vendute = 5

#+end_src

Ho messo nella /variabile/ *numero_delle_pere* la quantità di pere del contadino prima di andare al mercato. Al mercato il contadino fa il conto e mette nella /variabile/ *numero_delle_pere_vendute* le pere che ha venduto e poi:

#+begin_src ruby

numero_delle_pere_rimaste = numero_delle_pere - numero_delle_pere_vendute

#+end_src

Il contadino ora sa che la /variabile/ *numero_delle_pere_rimaste* contiene il numero 7.

#+begin_src ruby

irb(main):045:0> numero_delle_pere = 12
=> 12
irb(main):046:0> numero_delle_pere_vendute = 5
=> 5
irb(main):047:0> numero_delle_per_rimaste = numero_delle_pere - numero_delle_pere_vendute
=> 7
irb(main):048:0> 

#+end_src

Possiamo mettere dentro la nostra /scatola/ quello che vogliamo. La comodità è che così noi ricordiamo più facilmente il nome piuttosto che il numero contenuto. È come quando vogliamo telefonare alla /mamma/, basta col nostro telefono scrivere /mamma/ o dire /mamma/, il telefono saprà il numero. \\

Possiamo fare con le /variabili/ quello che facciamo con i valori: moltiplicarle, dividerle, sommarle o sottrarle... e tante altre cose che vedremo.

*** Scriviamo un programma

Fino ad adesso abbiamo usato per fare gli esperimenti il /REPL/. Adesso scriveremo un programma. \\
Lanciate l'editor di testo e create un nuovo file. Sarete davanti ad un programma che vi permetterà di scrivere.

Abbiamo un problema: \\

/Ci sono dieci bambini che devono portare delle pere ad una festa, ognuno ha 3 pere. Tre di questi bambini ne mangiano due ciascuno. Quante pere arriveranno alla festa./ \\

Scrivete nel vostro /editor di testo/. \\

Questi sono i dati:
#+begin_src ruby

bambini = 10
pere_per_bambino = 3
bambini_che_hanno_mangiato_le_pere = 3
pere_mangiate_per_bambino = 2

#+end_src

Ora un po' di calcoli: 

#+begin_src ruby

pere_totali = bambini * pere_per_bambino
pere_mangiate = bambini_che_hanno_mangiato_le_pere * pere_mangiate_per_bambino
pere_arrivate_alla_festa = pere_totali - pere_mangiate

#+end_src

Aggiungete poi questo:

#+begin_src ruby

puts "Alla festa sono arrivate:"
puts pere_arrivate_alla_festa
puts "pere"

#+end_src

Ora potete salvare il file come /pere.rb/

Il vostro programma completo sarà questo:

#+begin_src ruby :tangle source/pere.rb :noweb yes

bambini = 10
pere_per_bambino = 3
bambini_che_hanno_mangiato_le_pere = 3
pere_mangiate_per_bambino = 2

pere_totali = bambini * pere_per_bambino
pere_mangiate = bambini_che_hanno_mangiato_le_pere * pere_mangiate_per_bambino
pere_arrivate_alla_festa = pere_totali - pere_mangiate

puts "Alla festa sono arrivate:"
puts pere_arrivate_alla_festa
puts "pere"

#+end_src

Avete scritto un programma per risolvere il problema delle pere. Ora dovete farlo funzionare.
Ritorniamo al /terminale/ di prima e nella cartella dove avete salvato il file scrivete:

#+begin_src sh
ruby pere.rb
#+end_src

Il file che contiene il programma sarà caricato da ruby ed eseguito. Se tutto è andato bene avrete avuto questo:

#+begin_src sh

➜  source  ruby pere.rb 
Alla festa sono arrivate:
24
pere
➜  source  

#+end_src

Complimenti! \\

Certo non è proprio bello, il risultato lo abbiamo su tre righe, non sarebbe meglio avere: /Alla festa sono arrivate 24 pere/?
Direi di si. \\
Allora facciamo in questo modo:

#+begin_src ruby :tangle source/pere2.rb :noweb yes

bambini = 10
pere_per_bambino = 3
bambini_che_hanno_mangiato_le_pere = 3
pere_mangiate_per_bambino = 2

pere_totali = bambini * pere_per_bambino
pere_mangiate = bambini_che_hanno_mangiato_le_pere * pere_mangiate_per_bambino
pere_arrivate_alla_festa = pere_totali - pere_mangiate

puts "Alla festa sono arrivate:" + pere_arrivate_alla_festa + "pere"

#+end_src

Lo salviamo come /pere2.rb/ e come prima scriviamo nel /terminale/:

#+begin_src sh
ruby pere2.rb
#+end_src

Però c'è un problema:

#+begin_src sh

➜  source  ruby pere2.rb
pere2.rb:11:in `+': no implicit conversion of Fixnum into String (TypeError)
	from pere2.rb:11:in `<main>'
➜  source  

#+end_src

Ruby non è riuscito a utilizzare la variabile /pere_arrivate_alla_festa/ come se fosse una stringa e quindi ci avverte.
Per non incorrere in questo errore dobbiamo /convertire/ il numero contenuto nella /variabile/ in una stringa:

#+begin_src ruby

puts "Alla festa sono arrivate:" + pere_arrivate_alla_festa.to_s + "pere"

#+end_src

A /pere_arrivate_alla_festa/ aggiungiamo /.to_s/ e magicamente diventa una stringa.

Combiamo il programma così e salviamo come /pere3.rb/

#+begin_src ruby :tangle source/pere3.rb :noweb yes

bambini = 10
pere_per_bambino = 3
bambini_che_hanno_mangiato_le_pere = 3
pere_mangiate_per_bambino = 2

pere_totali = bambini * pere_per_bambino
pere_mangiate = bambini_che_hanno_mangiato_le_pere * pere_mangiate_per_bambino
pere_arrivate_alla_festa = pere_totali - pere_mangiate

puts "Alla festa sono arrivate: " + pere_arrivate_alla_festa.to_s + " pere"

#+end_src

Eseguite il programma come prima:

#+begin_src sh

➜  source  ruby pere3.rb
Alla festa sono arrivate: 24 pere
➜  source  

#+end_src

Meglio no?

