test.html

<div id="outline-container-sec-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> Le variabili e gli assegnamenti</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
Ogni linguaggio d programmazione che si rispetti, ci permette di calcolare cose che non sappiamo <i>a priori</i>, altrimenti non servirebbero a niente. Fino ad adesso avete visto come utilizzare dei valori, ora vediamo come creare valori e recuperarli per quando ci servono.
</p>

<p>
Le <i>variabili</i> sono come delle scatole dove mettete delle cose e l'<i>assegnamento</i> è l'azione del mettercele dentro. Direi che è semplice.
</p>

<div class="org-src-container">

<pre class="src src-ruby">numero_delle_pere = 12
numero_delle_pere_vendute = 5
</pre>
</div>

<p>
Ho messo nella <i>variabile</i> <b>numero_delle_pere</b> la quantità di pere del contadino prima di andare al mercato. Al mercato il contadino fa il conto e mette nella <i>variabile</i> <b>numero_delle_pere_vendute</b> le pere che ha venduto e poi:
</p>

<div class="org-src-container">

<pre class="src src-ruby">numero_delle_pere_rimaste = numero_delle_pere - numero_delle_pere_vendute
</pre>
</div>

<p>
Il contadino ora sa che la <i>variabile</i> <b>numero_delle_pere_rimaste</b> contiene il numero 7.
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:045</span>:0&gt; numero_delle_pere = 12
=&gt; 12
irb(main)<span class="org-constant">:046</span>:0&gt; numero_delle_pere_vendute = 5
=&gt; 5
irb(main)<span class="org-constant">:047</span>:0&gt; numero_delle_per_rimaste = numero_delle_pere - numero_delle_pere_vendute
=&gt; 7
irb(main)<span class="org-constant">:048</span>:0&gt;
</pre>
</div>

<p>
Possiamo mettere dentro la nostra <i>scatola</i> quello che vogliamo. La comodità è che così noi ricordiamo più facilmente il nome piuttosto che il numero contenuto. È come quando vogliamo telefonare alla <i>mamma</i>, basta col nostro telefono scrivere <i>mamma</i> o dire <i>mamma</i>, il telefono saprà il numero. <br >
</p>

<p>
Possiamo fare con le <i>variabili</i> quello che facciamo con i valori: moltiplicarle, dividerle, sommarle o sottrarle&#x2026; e tante altre cose che vedremo.
</p>
</div>
</div>

<div id="outline-container-sec-3-4-3" class="outline-4">
<h4 id="sec-3-4-3"><span class="section-number-4">3.4.3</span> Scriviamo un programma</h4>
<div class="outline-text-4" id="text-3-4-3">
<p>
Fino ad adesso abbiamo usato per fare gli esperimenti il <i>REPL</i>. Adesso scriveremo un programma. <br >
Lanciate l'editor di testo e create un nuovo file. Sarete davanti ad un programma che vi permetterà di scrivere.
</p>

<p>
Abbiamo un problema: <br >
</p>

<p>
<i>Ci sono dieci bambini che devono portare delle pere ad una festa, ognuno ha 3 pere. Tre di questi bambini ne mangiano due ciascuno. Quante pere arriveranno alla festa.</i> <br >
</p>

<p>
Scrivete nel vostro <i>editor di testo</i>. <br >
</p>

<p>
Questi sono i dati:
</p>
<div class="org-src-container">

<pre class="src src-ruby">bambini = 10
pere_per_bambino = 3
bambini_che_hanno_mangiato_le_pere = 3
pere_mangiate_per_bambino = 2
</pre>
</div>

<p>
Ora un po' di calcoli: 
</p>

<div class="org-src-container">

<pre class="src src-ruby">pere_totali = bambini * pere_per_bambino
pere_mangiate = bambini_che_hanno_mangiato_le_pere * pere_mangiate_per_bambino
pere_arrivate_alla_festa = pere_totali - pere_mangiate
</pre>
</div>

<p>
Aggiungete poi questo:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-builtin">puts</span> <span class="org-string">"Alla festa sono arrivate:"</span>
<span class="org-builtin">puts</span> pere_arrivate_alla_festa
<span class="org-builtin">puts</span> <span class="org-string">"pere"</span>
</pre>
</div>

<p>
Ora potete salvare il file come <i>pere.rb</i>
</p>

<p>
Il vostro programma completo sarà questo:
</p>

<div class="org-src-container">

<pre class="src src-ruby">bambini = 10
pere_per_bambino = 3
bambini_che_hanno_mangiato_le_pere = 3
pere_mangiate_per_bambino = 2

pere_totali = bambini * pere_per_bambino
pere_mangiate = bambini_che_hanno_mangiato_le_pere * pere_mangiate_per_bambino
pere_arrivate_alla_festa = pere_totali - pere_mangiate

<span class="org-builtin">puts</span> <span class="org-string">"Alla festa sono arrivate:"</span>
<span class="org-builtin">puts</span> pere_arrivate_alla_festa
<span class="org-builtin">puts</span> <span class="org-string">"pere"</span>
</pre>
</div>

<p>
Avete scritto un programma per risolvere il problema delle pere. Ora dovete farlo funzionare.
Ritorniamo al <i>terminale</i> di prima e nella cartella dove avete salvato il file scrivete:
</p>

<div class="org-src-container">

<pre class="src src-sh">ruby pere.rb
</pre>
</div>

<p>
Il file che contiene il programma sarà caricato da ruby ed eseguito. Se tutto è andato bene avrete avuto questo:
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  source  ruby pere.rb 
Alla festa sono arrivate:
24
pere
&#10140;  source
</pre>
</div>

<p>
Complimenti! <br >
</p>

<p>
Certo non è proprio bello, il risultato lo abbiamo su tre righe, non sarebbe meglio avere: <i>Alla festa sono arrivate 24 pere</i>?
Direi di si. <br >
Allora facciamo in questo modo:
</p>

<div class="org-src-container">

<pre class="src src-ruby">bambini = 10
pere_per_bambino = 3
bambini_che_hanno_mangiato_le_pere = 3
pere_mangiate_per_bambino = 2

pere_totali = bambini * pere_per_bambino
pere_mangiate = bambini_che_hanno_mangiato_le_pere * pere_mangiate_per_bambino
pere_arrivate_alla_festa = pere_totali - pere_mangiate

<span class="org-builtin">puts</span> <span class="org-string">"Alla festa sono arrivate:"</span> + pere_arrivate_alla_festa + <span class="org-string">"pere"</span>
</pre>
</div>

<p>
Lo salviamo come <i>pere2.rb</i> e come prima scriviamo nel <i>terminale</i>:
</p>

<div class="org-src-container">

<pre class="src src-sh">ruby pere2.rb
</pre>
</div>

<p>
Però c'è un problema:
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  source  ruby pere2.rb
pere2.rb:11:in <span class="org-sh-quoted-exec">`+': no implicit conversion of Fixnum into String (TypeError)</span>
<span class="org-sh-quoted-exec">        from pere2.rb:11:in `</span>&lt;main&gt;<span class="org-string">'</span>
<span class="org-string">&#10140;  source</span>
</pre>
</div>

<p>
Ruby non è riuscito a utilizzare la variabile <i>pere_arrivate_alla_festa</i> come se fosse una stringa e quindi ci avverte.
Per non incorrere in questo errore dobbiamo <i>convertire</i> il numero contenuto nella <i>variabile</i> in una stringa:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-builtin">puts</span> <span class="org-string">"Alla festa sono arrivate:"</span> + pere_arrivate_alla_festa.to_s + <span class="org-string">"pere"</span>
</pre>
</div>

<p>
A <i>pere_arrivate_alla_festa</i> aggiungiamo <i>.to_s</i> e magicamente diventa una stringa.
</p>

<p>
Combiamo il programma così e salviamo come <i>pere3.rb</i>
</p>

<div class="org-src-container">

<pre class="src src-ruby">bambini = 10
pere_per_bambino = 3
bambini_che_hanno_mangiato_le_pere = 3
pere_mangiate_per_bambino = 2

pere_totali = bambini * pere_per_bambino
pere_mangiate = bambini_che_hanno_mangiato_le_pere * pere_mangiate_per_bambino
pere_arrivate_alla_festa = pere_totali - pere_mangiate

<span class="org-builtin">puts</span> <span class="org-string">"Alla festa sono arrivate: "</span> + pere_arrivate_alla_festa.to_s + <span class="org-string">" pere"</span>
</pre>
</div>

<p>
Eseguite il programma come prima:
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  source  ruby pere3.rb
Alla festa sono arrivate: 24 pere
&#10140;  source
</pre>
</div>

<p>
Meglio no?
</p>
</div>
</div>
