test.org
*** Riflessioni fino qui

In questa ultima parte abbiamo visto delle cose strane, delle /istruzioni/ che sicuramente non abbiamo capito.
Per primo vediamo l'istruzione /puts/. È un /metodo/.
Nei linguaggi di programmazione si sente spesso parlare di /funzioni/, /procedure/ o /metodi/; sono tutti un modo per indicare dei piccoli pezzi /codice/ (il linguaggio di programmazione scritto) che possono essere riutilizzati tramite un nome che gli abbiamo dato. In Ruby, come in altri linguaggi simili, le /funzioni/ vengono chiamate /metodi/.
Il /metodo/ /puts/ serve per scrivere del testo in uscita.
Spieghiamo questa cosa complicata con un esempio.

Immaginate una stanza con due porte, da una si entra e da una si esce. Quella da cui si entra, si chiama: /input/; quella da cui si esce: /output/.
Mettiamo che una sera la mamma debba uscire col babbo per una cena.
La mamma si vuole truccare per farsi bella e quindi:

+ entra dalla porta /input/
+ dentro la stanza viene truccata da una estetista e diventa più bella
+ esce dalla porta /output/

Insomma, la mamma sono i dati del metodo (la stanza dell'estetista) che entra struccata ed esce truccata. \\

*I dati (numeri o stringhe) entrano come /parametri/ nel metodo e ne escono modificati o no.*

Il metodo /puts/ è un metodo che Ruby fornisce da solo, come molti altri, ma noi li possiamo anche scrivere e cioè /definire/ quando vogliamo. La definizione di /puts/ ed il suo uso, per esempio, potrebbe essere come questa:

#+begin_src ruby

def puts(testo_in_output)
  testo_in_output
end

#si può invocare come:
puts "ciao mondo"

#oppure:

puts("ciao mondo")

#+end_src

Come vedete possiamo /invocare/ (cioè chiamare o usare) il metodo in due modi. Ruby permettere di non scrivere (/omettere/) le parentesi in alcuni casi.
Le righe che cominciano con /#/ sono considerate dei /commenti/, del testo che possiamo scrivere dentro il /codice/ senza che esso venga letto dall'interprete. Il /commento/ va dal carattere /#/ fino alla fine della riga. Se andate a capo senza mettere come primo carattere /#/ Ruby vi darà un errore.
Si possono fare anche commenti su più righe. 

Per ricapitolare:

#+begin_src ruby

#questo è un commento che arriva fino in fondo alla riga

#questo commento è
sbagliato

=begin
questo
commento
va
bene
=end

#+end_src

La possibilità di commentare un codice è molto importante, perché così possiamo scrivere del testo per ricordarci cosa stiamo facendo o per descriverlo ad altri che lo leggeranno in seguito. \\

Vediamo ora l'altro /metodo/ che abbiamo usato: /to_s/ \\
Lo abbiamo usato in questo modo:

#+begin_src ruby

pere_arrivate_alla_festa.to_s

#+end_src

per convertire un numero intero in una stringa. Il metodo /to_s/ significa semplicemente: /to string/ (in stringa).
Ricordate che la lingua inglese è la lingua ufficiale per i linguaggi di programmazione, quindi le /cose/ si chiameranno sempre in inglese. \\
Il metodo /to_s/ non ha dati in entrata (/input/), ma ugualmente fa qualcosa. Come vedete viene applicato invece a certi dati tramite il punto: /10.to_s fa diventare il 10 una stringa, "10"/.
Dovete sapere che Ruby è un linguaggio /orientato agli oggetti (Object Oriented)/ e cioè un linguaggio in cui noi possiamo descrivere o definire degli oggetti che comunicano con altri oggetti. \\

Complicato? \\

Vediamo un po'. \\

Molti di voi giocheranno coi mattoncini Lego^{(tm)} o almeno saprete sicuramente cosa sono.
Sapete che ci sono molti mattoncini di forme diverse che si attaccano insieme. Bene!
I mattoncini Lego^{(tm)} sono come un linguaggio /Object Oriented/. I mattoncini sono /oggetti/.
Se guardate un mattoncino, noterete che è diverso sopra e sotto, per permettervi di attaccarli insieme. La parte dove si attaccano è una /interfaccia/ di collegamento. I rilievi rotondi su una delle superfici sono i /metodi/.
In Ruby si dice che tutto è un /oggetto/ (è un linguaggio ad oggetti /puro/), quindi anche le stringhe ed i numeri.

+ L'oggetto delle stringhe si chiama: /String/.
+ L'oggetto dei numeri si chiama: /Fixnum/.

Il metodo /to_s/ è quindi un metodo dell'oggetto /Fixnum/. È un metodo però che tutti gli oggetti in Ruby ha, come molti altri; ma li vedremo in seguito.

Il modo di /invocare/ (chiamare o /call/) è quello tramite la /dot notation/, la /notazione a punto/.
Insomma per farla semplice: mettete un punto tra l'oggetto e il metodo. \\
Ricordate come lanciare /irb/?

#+begin_src ruby

irb(main):001:0> 10.to_s
=> "10"
irb(main):002:0> io_sono_un_numero = 12
=> 12
irb(main):003:0> io_sono_un_numero.to_s
=> "12"
irb(main):004:0> 

#+end_src

Questi per esempio sono i metodi di /Fixnum/:

#+begin_src ruby

irb(main):004:0> Fixnum.methods
=> [:allocate, :superclass, :freeze, :===, :==, :<=>, :<, :<=, :>, :>=, :to_s, :inspect, :included_modules, :include?, :name, :ancestors, :instance_methods, :public_instance_methods, :protected_instance_methods, :private_instance_methods, :constants, :const_get, :const_set, :const_defined?, :const_missing, :class_variables, :remove_class_variable, :class_variable_get, :class_variable_set, :class_variable_defined?, :public_constant, :private_constant, :singleton_class?, :include, :prepend, :module_exec, :class_exec, :module_eval, :class_eval, :method_defined?, :public_method_defined?, :private_method_defined?, :protected_method_defined?, :public_class_method, :private_class_method, :autoload, :autoload?, :instance_method, :public_instance_method, :nil?, :=~, :!~, :eql?, :hash, :class, :singleton_class, :clone, :dup, :taint, :tainted?, :untaint, :untrust, :untrusted?, :trust, :frozen?, :methods, :singleton_methods, :protected_methods, :private_methods, :public_methods, :instance_variables, :instance_variable_get, :instance_variable_set, :instance_variable_defined?, :remove_instance_variable, :instance_of?, :kind_of?, :is_a?, :tap, :send, :public_send, :respond_to?, :extend, :display, :method, :public_method, :singleton_method, :define_singleton_method, :object_id, :to_enum, :enum_for, :equal?, :!, :!=, :instance_eval, :instance_exec, :__send__, :__id__]
irb(main):005:0> 

#+end_src

Come vedete sono parecchi ed alcuni anche molto strani... Cercate /to_s/.

Quello che ho chiamato per sapere questa lista è /methods/. Il metodo /methods/ fa questo: restituisce una lista dei nomi dei metodi dell'oggetto su cui è invocato.

Nel gergo dei linguaggi orientati agli oggetti (puri) si dice: /mandare un messaggio ad un oggetto/.
Quindi in pratica ho /chiesto a Fixnum di dirmi tutti i nomi dei suoi metodi/. Come quando chiedete ad un amico di darvi il suo quaderno di matematica e lui ve lo da.

