test.html

<div id="outline-container-sec-3-4-4" class="outline-4">
<h4 id="sec-3-4-4"><span class="section-number-4">3.4.4</span> Riflessioni fino qui</h4>
<div class="outline-text-4" id="text-3-4-4">
<p>
In questa ultima parte abbiamo visto delle cose strane, delle <i>istruzioni</i> che sicuramente non abbiamo capito.
Per primo vediamo l'istruzione <i>puts</i>. È un <i>metodo</i>.
Nei linguaggi di programmazione si sente spesso parlare di <i>funzioni</i>, <i>procedure</i> o <i>metodi</i>; sono tutti un modo per indicare dei piccoli pezzi <i>codice</i> (il linguaggio di programmazione scritto) che possono essere riutilizzati tramite un nome che gli abbiamo dato. In Ruby, come in altri linguaggi simili, le <i>funzioni</i> vengono chiamate <i>metodi</i>.
Il <i>metodo</i> <i>puts</i> serve per scrivere del testo in uscita.
Spieghiamo questa cosa complicata con un esempio.
</p>

<p>
Immaginate una stanza con due porte, da una si entra e da una si esce. Quella da cui si entra, si chiama: <i>input</i>; quella da cui si esce: <i>output</i>.
Mettiamo che una sera la mamma debba uscire col babbo per una cena.
La mamma si vuole truccare per farsi bella e quindi:
</p>

<ul class="org-ul">
<li>entra dalla porta <i>input</i>
</li>
<li>dentro la stanza viene truccata da una estetista e diventa più bella
</li>
<li>esce dalla porta <i>output</i>
</li>
</ul>

<p>
Insomma, la mamma sono i dati del metodo (la stanza dell'estetista) che entra struccata ed esce truccata. <br >
</p>

<p>
<b>I dati (numeri o stringhe) entrano come <i>parametri</i> nel metodo e ne escono modificati o no.</b>
</p>

<p>
Il metodo <i>puts</i> è un metodo che Ruby fornisce da solo, come molti altri, ma noi li possiamo anche scrivere e cioè <i>definire</i> quando vogliamo. La definizione di <i>puts</i> ed il suo uso, per esempio, potrebbe essere come questa:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">def</span> <span class="org-function-name">puts</span>(testo_in_output)
  testo_in_output
<span class="org-keyword">end</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">si pu&#242; invocare come:</span>
<span class="org-builtin">puts</span> <span class="org-string">"ciao mondo"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">oppure:</span>

<span class="org-builtin">puts</span>(<span class="org-string">"ciao mondo"</span>)
</pre>
</div>

<p>
Come vedete possiamo <i>invocare</i> (cioè chiamare o usare) il metodo in due modi. Ruby permettere di non scrivere (<i>omettere</i>) le parentesi in alcuni casi.
Le righe che cominciano con <i>#</i> sono considerate dei <i>commenti</i>, del testo che possiamo scrivere dentro il <i>codice</i> senza che esso venga letto dall'interprete. Il <i>commento</i> va dal carattere <i>#</i> fino alla fine della riga. Se andate a capo senza mettere come primo carattere <i>#</i> Ruby vi darà un errore.
Si possono fare anche commenti su più righe. 
</p>

<p>
Per ricapitolare:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-comment-delimiter">#</span><span class="org-comment">questo &#232; un commento che arriva fino in fondo alla riga</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">questo commento &#232;</span>
sbagliato

<span class="org-comment">=begin</span>
<span class="org-comment">questo</span>
<span class="org-comment">commento</span>
<span class="org-comment">va</span>
<span class="org-comment">bene</span>
<span class="org-comment">=end</span>
</pre>
</div>

<p>
La possibilità di commentare un codice è molto importante, perché così possiamo scrivere del testo per ricordarci cosa stiamo facendo o per descriverlo ad altri che lo leggeranno in seguito. <br >
</p>

<p>
Vediamo ora l'altro <i>metodo</i> che abbiamo usato: <i>to_s</i> <br >
Lo abbiamo usato in questo modo:
</p>

<div class="org-src-container">

<pre class="src src-ruby">pere_arrivate_alla_festa.to_s
</pre>
</div>

<p>
per convertire un numero intero in una stringa. Il metodo <i>to_s</i> significa semplicemente: <i>to string</i> (in stringa).
Ricordate che la lingua inglese è la lingua ufficiale per i linguaggi di programmazione, quindi le <i>cose</i> si chiameranno sempre in inglese. <br >
Il metodo <i>to_s</i> non ha dati in entrata (<i>input</i>), ma ugualmente fa qualcosa. Come vedete viene applicato invece a certi dati tramite il punto: <i>10.to_s fa diventare il 10 una stringa, "10"/.
Dovete sapere che Ruby è un linguaggio /orientato agli oggetti (Object Oriented)</i> e cioè un linguaggio in cui noi possiamo descrivere o definire degli oggetti che comunicano con altri oggetti. <br >
</p>

<p>
Complicato? <br >
</p>

<p>
Vediamo un po'. <br >
</p>

<p>
Molti di voi giocheranno coi mattoncini Lego<sup>(tm)</sup> o almeno saprete sicuramente cosa sono.
Sapete che ci sono molti mattoncini di forme diverse che si attaccano insieme. Bene!
I mattoncini Lego<sup>(tm)</sup> sono come un linguaggio <i>Object Oriented</i>. I mattoncini sono <i>oggetti</i>.
Se guardate un mattoncino, noterete che è diverso sopra e sotto, per permettervi di attaccarli insieme. La parte dove si attaccano è una <i>interfaccia</i> di collegamento. I rilievi rotondi su una delle superfici sono i <i>metodi</i>.
In Ruby si dice che tutto è un <i>oggetto</i> (è un linguaggio ad oggetti <i>puro</i>), quindi anche le stringhe ed i numeri.
</p>

<ul class="org-ul">
<li>L'oggetto delle stringhe si chiama: <i>String</i>.
</li>
<li>L'oggetto dei numeri si chiama: <i>Fixnum</i>.
</li>
</ul>

<p>
Il metodo <i>to_s</i> è quindi un metodo dell'oggetto <i>Fixnum</i>. È un metodo però che tutti gli oggetti in Ruby ha, come molti altri; ma li vedremo in seguito.
</p>

<p>
Il modo di <i>invocare</i> (chiamare o <i>call</i>) è quello tramite la <i>dot notation</i>, la <i>notazione a punto</i>.
Insomma per farla semplice: mettete un punto tra l'oggetto e il metodo. <br >
Ricordate come lanciare <i>irb</i>?
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:001</span>:0&gt; 10.to_s
=&gt; <span class="org-string">"10"</span>
irb(main)<span class="org-constant">:002</span>:0&gt; io_sono_un_numero = 12
=&gt; 12
irb(main)<span class="org-constant">:003</span>:0&gt; io_sono_un_numero.to_s
=&gt; <span class="org-string">"12"</span>
irb(main)<span class="org-constant">:004</span>:0&gt;
</pre>
</div>

<p>
Questi per esempio sono i metodi di <i>Fixnum</i>:
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:004</span>:0&gt; <span class="org-type">Fixnum</span>.methods
=&gt; [<span class="org-constant">:allocate</span>, <span class="org-constant">:superclass</span>, <span class="org-constant">:freeze</span>, <span class="org-constant">:===</span>, <span class="org-constant">:==</span>, <span class="org-constant">:&lt;=&gt;</span>, <span class="org-constant">:&lt;</span>, <span class="org-constant">:&lt;=</span>, <span class="org-constant">:&gt;</span>, <span class="org-constant">:&gt;=</span>, <span class="org-constant">:to_s</span>, <span class="org-constant">:inspect</span>, <span class="org-constant">:included_modules</span>, <span class="org-constant">:include?</span>, <span class="org-constant">:name</span>, <span class="org-constant">:ancestors</span>, <span class="org-constant">:instance_methods</span>, <span class="org-constant">:public_instance_methods</span>, <span class="org-constant">:protected_instance_methods</span>, <span class="org-constant">:private_instance_methods</span>, <span class="org-constant">:constants</span>, <span class="org-constant">:const_get</span>, <span class="org-constant">:const_set</span>, <span class="org-constant">:const_defined?</span>, <span class="org-constant">:const_missing</span>, <span class="org-constant">:class_variables</span>, <span class="org-constant">:remove_class_variable</span>, <span class="org-constant">:class_variable_get</span>, <span class="org-constant">:class_variable_set</span>, <span class="org-constant">:class_variable_defined?</span>, <span class="org-constant">:public_constant</span>, <span class="org-constant">:private_constant</span>, <span class="org-constant">:singleton_class?</span>, <span class="org-constant">:include</span>, <span class="org-constant">:prepend</span>, <span class="org-constant">:module_exec</span>, <span class="org-constant">:class_exec</span>, <span class="org-constant">:module_eval</span>, <span class="org-constant">:class_eval</span>, <span class="org-constant">:method_defined?</span>, <span class="org-constant">:public_method_defined?</span>, <span class="org-constant">:private_method_defined?</span>, <span class="org-constant">:protected_method_defined?</span>, <span class="org-constant">:public_class_method</span>, <span class="org-constant">:private_class_method</span>, <span class="org-constant">:autoload</span>, <span class="org-constant">:autoload?</span>, <span class="org-constant">:instance_method</span>, <span class="org-constant">:public_instance_method</span>, <span class="org-constant">:nil?</span>, <span class="org-constant">:=~</span>, <span class="org-constant">:!~</span>, <span class="org-constant">:eql?</span>, <span class="org-constant">:hash</span>, <span class="org-constant">:class</span>, <span class="org-constant">:singleton_class</span>, <span class="org-constant">:clone</span>, <span class="org-constant">:dup</span>, <span class="org-constant">:taint</span>, <span class="org-constant">:tainted?</span>, <span class="org-constant">:untaint</span>, <span class="org-constant">:untrust</span>, <span class="org-constant">:untrusted?</span>, <span class="org-constant">:trust</span>, <span class="org-constant">:frozen?</span>, <span class="org-constant">:methods</span>, <span class="org-constant">:singleton_methods</span>, <span class="org-constant">:protected_methods</span>, <span class="org-constant">:private_methods</span>, <span class="org-constant">:public_methods</span>, <span class="org-constant">:instance_variables</span>, <span class="org-constant">:instance_variable_get</span>, <span class="org-constant">:instance_variable_set</span>, <span class="org-constant">:instance_variable_defined?</span>, <span class="org-constant">:remove_instance_variable</span>, <span class="org-constant">:instance_of?</span>, <span class="org-constant">:kind_of?</span>, <span class="org-constant">:is_a?</span>, <span class="org-constant">:tap</span>, <span class="org-constant">:send</span>, <span class="org-constant">:public_send</span>, <span class="org-constant">:respond_to?</span>, <span class="org-constant">:extend</span>, <span class="org-constant">:display</span>, <span class="org-constant">:method</span>, <span class="org-constant">:public_method</span>, <span class="org-constant">:singleton_method</span>, <span class="org-constant">:define_singleton_method</span>, <span class="org-constant">:object_id</span>, <span class="org-constant">:to_enum</span>, <span class="org-constant">:enum_for</span>, <span class="org-constant">:equal?</span>, <span class="org-constant">:!</span>, <span class="org-constant">:!=</span>, <span class="org-constant">:instance_eval</span>, <span class="org-constant">:instance_exec</span>, <span class="org-constant">:__send__</span>, <span class="org-constant">:__id__</span>]
irb(main)<span class="org-constant">:005</span>:0&gt;
</pre>
</div>

<p>
Come vedete sono parecchi ed alcuni anche molto strani&#x2026; Cercate <i>to_s</i>.
</p>

<p>
Quello che ho chiamato per sapere questa lista è <i>methods</i>. Il metodo <i>methods</i> fa questo: restituisce una lista dei nomi dei metodi dell'oggetto su cui è invocato.
</p>

<p>
Nel gergo dei linguaggi orientati agli oggetti (puri) si dice: <i>mandare un messaggio ad un oggetto</i>.
Quindi in pratica ho <i>chiesto a Fixnum di dirmi tutti i nomi dei suoi metodi</i>. Come quando chiedete ad un amico di darvi il suo quaderno di matematica e lui ve lo da.
</p>
</div>
</div>
