test.org
*** Confrontare le cose e decidere cosa fare

Cominciamo a vedere le cose serie. Un programma non è un programma se non prendiamo decisioni.
Fino ad adesso abbiamo solo dato comandi ed è il momento di decidersi a /decidere/.

Per prima cosa guardiamo gli operatori /booleani/ (si chiamano booleani da George Bool un matematico inglese dell'800):

+ *>* maggiore di...
+ *<* minore di...
+ *>=* maggiore od uguale di...
+ *<=* minore od uguale di...
+ *==* uguale a...
+ *!=* non uguale a...

#+begin_src ruby

irb(main):001:0> 5 > 2
=> true
irb(main):002:0> 5 < 2
=> false
irb(main):003:0> 5 >= 5
=> true
irb(main):004:0> 5 <=5
=> true
irb(main):005:0> 5 == 5
=> true
irb(main):006:0> 5 != 5
=> false
irb(main):007:0> 

#+end_src

Con questi /operatori/ possiamo sapere quindi se un numero è maggiore, minore od uguale ad un altro.

Lo possiamo fare anche con le stringhe:

#+begin_src ruby

irb(main):001:0> 5 > 2
=> true
irb(main):002:0> 5 < 2
=> false
irb(main):003:0> 5 >= 5
=> true
irb(main):004:0> 5 <=5
=> true
irb(main):005:0> 5 == 5
=> true
irb(main):006:0> 5 != 5
=> false
irb(main):007:0> 

#+end_src

Questo non vi fa domandare cosa succede con le stringe? È interessante perché il confronto è fatto sul /valore lessicale/ delle stringhe.

Guardate:

#+begin_src ruby

irb(main):013:0> 'a' > 'b'
=> false
irb(main):014:0> 'b' > 'a'
=> true
irb(main):015:0> 

#+end_src

Capito? L'/ordine lessicale/ è praticamente quello come nel dizionario con però un problema:

#+begin_src ruby

irb(main):014:0> 'b' > 'a'
=> true
irb(main):015:0> 'B' > 'a'
=> false
irb(main):016:0> 

#+end_src

Come sarebbe? /b/ è maggiore di /a/ ma /B/ no?

I computer ordinano in maniera diversa da noi, sono ancora più stupidi di quello che avevamo fino ad ora pensato, loro ordinano prima le lettere maiuscole e poi le minuscole (per la verità prima ordinano i numeri, poi le maiuscole e dopo le minuscole). Questo è un problema.

Dobbiamo quindi stare attenti, ma fortunatamente Ruby ci aiuta con il metodo /downcase/ che mette la stringa tutta in minuscolo o /upcase/ che la rende tutta maiuscola.

#+begin_src ruby

irb(main):018:0> 'B'.downcase
=> "b"
irb(main):019:0> 'B'.downcase > 'a'.downcase
=> true
irb(main):020:0> 'B' > 'a'
=> false
irb(main):021:0> 'a'.upcase
=> "A"
irb(main):022:0> 

#+end_src

Ora abbiamo capito gli /operatori booleani/ e che ci facciamo? Li usiamo per /decidere cosa fare/.

Prendete l'editor che scriviamo un programma nuovo.

#+begin_src ruby :tangle source/test.rb :noweb yes

puts "Quanti anni hai?"

eta = gets

if eta == 9
  puts "fai la quarta elementare"
else
  puts "non fai la quarta elementare"
end

#+end_src

Salvate come avete imparato con il nome /test.rb/ e poi eseguitelo:

#+begin_src sh

➜  source  ruby test.rb 
Quanti anni hai?
8
non fai la quarta elementare

#+end_src

Ora però proviamo scrivendo nove quando lo chiede:

#+begin_src sh

➜  source  ruby test.rb 
Quanti anni hai?
9
non fai la quarta elementare

#+end_src

Qualcosa non va.

Intanto capiamo cosa è /gets/. Ricordate /puts/ e gli /input/ e /output/... La mamma che va a cena?
Bene. Il metodo /gets/ carica i dati dall'/input', cioè ci chiede di scrivere qualcosa e premere il tasto invio. I dati che prende li può caricare dentro una variabile.
Noi abbiamo messo l'età dentro la variabile /eta/ (non ha l'accento perché come vi ho già detto i linguaggi di programmazione sono in /inglese/ e l'inglese non ha accenti di questo tipo, quindi non tutti i caratteri possiamo usare per i nomi delle /variabili/ o dei /metodi/. Non si possono usare nemmeno i caratteri degli operatori e se ci fate caso neanche gli spazi... ), poi con un test abbiamo controllato il valore:

#+begin_src ruby

if eta == 9
  puts "fai la quarta elementare"
else
  puts "non fai la quarta elementare"
end

#+end_src

cioè: se (/if/) eta è uguale a 9 scrivi /fai la quarta elementare/ altrimenti (/else/) scrivi /non fai la quarta elementare/. Noi però abbiamo scritto 9, perché non ha funzionato?
Ora ve lo spiego: il metodo /gets/ legge i caratteri che scriviamo ma non sa che quelli sono numeri; per lui sono stringhe.

Ruby è un /linguaggio dinamico/ e permette di valutare e confrontare le /pere con le mele/. La maestra vi avrà sicuramente detto che non si confrontano /le mele con le pere/... La maestra ha ragione, ma i linguaggi di programmazione spesso non vanno proprio a braccetto con la matematica.


Scrivere così è perfettamente lecito:

#+begin_src ruby

irb(main):023:0> "pere" == 10
=> false
irb(main):024:0>
 
#+end_src

e giustamente restituisce il valore /falso/ (/false/). Come mai? \\

*Perché una stringa non è un numero*. \\

Ruby, se i tipi del confronto non sono uguali o riconducibili, non confronta i valori ma i tipi stessi.
Sono sicuro che vi cominci ad arrivare un po' di mal di testa, quindi vediamo.

La stringa /pere/ è di tipo String, il numero 10 è di tipo Fixnum (tutto questo lo abbiamo visto prima), Ruby lo sa che i tipi sono diversi e non può confrontare i valori, quindi ci dice che un tipo /String/ non è un tipo /Fixnum/.

Lo so che la storia dei tipi è un po' complicata, ma piano piano la capirete e vedrete che è /ganzissima/.

Ritornando al problema di prima, quello del 9. Per far funzionare il programma noi dobbiamo convertire /eta/ in un numero con il metodo /to_i/ (/to integer/):

#+begin_src ruby :tangle source/test1.rb :noweb yes

puts "Quanti anni hai?"

eta = gets.to_i

if eta == 9
  puts "fai la quarta elementare"
else
  puts "non fai la quarta elementare"
end

#+end_src

Però sarebbe meglio anche aggiungere un altro metodo: /chomp/; che rimuove il carattere di invio. Quando scrivete 9 e date invio, anche il carattere di invio viene mandato al programma. Ecco, /chomp/ rimuove il carattere di invio dalla stringa (il carattere invisibile /newline/ ovvero /nuova riga/).

#+begin_src ruby :tangle source/test2.rb :noweb yes

puts "Quanti anni hai?"

eta = gets.chomp.to_i

if eta == 9
  puts "fai la quarta elementare"
else
  puts "non fai la quarta elementare"
end

#+end_src

Qui vedete anche un'altra cosa interessante, i metodi possono essere /chained/ (/concatenati/); messi uno dopo l'altro e concatenati con il punto. Ogni metodo passerà a quello dopo il valore che ha elaborato: \\

*/gets/ legge '9' + /newline/, lo passa a /chomp/ che leva il /newline/ e passa '9' a /to_i/ che lo trasforma in un intero dal valore 9* \\

La condizione /if/ valuta sempre una espressione che restituisce un valore /booleano/: /true/ o /false/, vero o falso; quindi possiamo utilizzare una /qualunque/ espressione che restituisce vero a falso. Ricordatelo, servirà.
La condizione /if/ può essere semplice:

#+begin_src ruby

if a > 1
  puts 'a è maggiore di uno'
end

#+end_src

o come abbiamo visto prima una alternativa contrassegnata dalla /parola chiave/ (/keyword/) /else/ (/altrimenti/).
La cosa interessante è che dentro un blocco /if..end/ o /if..else..end/ possiamo mettere dentro, /annidare/, altre condizioni:

#+begin_src ruby

if a > 1
  puts 'a è maggiore di 1'
else
  if a == 0
    puts 'a è uguale zero'
  else
    puts 'a è minore di zero'
  end
end

#+end_src

Si potrebbe anche scrivere meglio, ma va bene per capire. Come vedete il test prima controlla se /a è maggiore di 1/, se non lo è ci chiediamo: /a è uguale a zero?/ se lo è lo scriviamo, altrimenti sarà per forza /minore di zero/. In questa maniera, /annidando/ delle condizioni abbiamo valutato i tre possibili stati di un numero:

+ è maggiore di zero
+ è zero
+ è minore di zero

Se modifichiamo il programma di prima e lo salviamo come /test2.rb/:

#+begin_src ruby :tangle source/test2.rb :noweb yes

puts "Quanti anni hai?"

eta = gets.to_i

if eta == 9
  puts "fai la quarta elementare"
else
  if eta < 9
    puts "sei ancora piccolo e fai la prima o la seconda o la terza"
  else
    puts "Sei già laureato?"
  end
end

#+end_src

Pensate a quanti /giochini/ potremmo fare con la possibilità di /annidare/ le condizioni. 
Questo in gergo si chiama: /ramo decisionale/.
Visto che parliamo di /ramo decisionale/ prima di guardare i /cicli/ (/loop/) vediamo un altro modo per prendere le decisioni.
È un modo molto potente ed utile, che ci permette di scrivere meglio il programma di prima.

Salvatelo come /test3.rb/ ed eseguite come avete imparato:

#+begin_src ruby :tangle source/test3.rb :noweb yes

puts "Quanti anni hai?"

eta = gets.to_i

case eta
when 6
  puts 'fai la prima elementare'
when 7
  puts 'fai la seconda elementare'
when 8
  puts 'fai la terza elementare'
when 9
  puts 'fai la quarta elementare'
when 10
  puts 'fai la quinta elementare'
else
  if eta > 10
  puts 'Vai alle medie?'
  else
    puts "Fai ancora l'asilo"
  end
end

#+end_src

Ho usato l'/espressione condizionale/ /case..when..end/. È nella sua /forma completa/: if..when..else..end.
Vediamo che succede in questo caso.
Questa espressione è come una cassettiera con i cassetti numerati, ci sono cinque cassetti numerati 6,7,8,9,10 e un ultimo dove si mette tutto quello che non va negli altri.
Qui ho usato anche una condizione /if..else..end/ per diramare ulteriormente il test. 

Eseguendolo potete vedere i risultati:

#+begin_src sh

➜  source  ruby test3.rb 
Quanti anni hai?
2
Fai ancora l'asilo
➜  source  ruby test3.rb
Quanti anni hai?
6
fai la prima elementare
➜  source  ruby test3.rb
Quanti anni hai?
11
Vai alle medie?
➜  source  ruby test3.rb
Quanti anni hai?
10
fai la quinta elementare
➜  source  

#+end_src

L'espressione /case..when..end/ è davvero molto utile, cose come queste ci sono i tutti i linguaggi di programmazione anche se a volte meno potenti. In Ruby potete valutare praticamente qualunque cosa.

Ecco una stringa:

#+begin_src ruby

case nome
  when 'pippo'
    puts 'ti chiami pippo'
  else
    puts 'non ti chiami pippo'
end

#+end_src

Simuliamo una condizione /if..else..end/:

#+begin_src ruby

test_booleano = true

case test_booleano
  when true
    puts 'vero'
  when false
    puts 'falso'
end

#+end_src

L'espressione /case..when..end/ è *utilissima* e spesso mantiene il /codice/ pulito e facilmente leggibile, provate e divertitevi.

Nelle /espressioni condizionali/ possiamo fare più test insieme. Come?
Con gli operatori logici: 

+ *or*  che si può scrivere spesso anche come *||*
+ *and* che si può scrivere spesso anche come *&&*
+ *not* che si può scrivere spesso anche come *!*

La differenza tra quello scritto e quello a simbolo (/and/ e /&&/) sta nel livello di precedenza di valutazione: la versione scritta ha una precedenza più bassa. Normalmente non ve ne curate, ma può causare a volte problemi subdoli. Nel dubbio è preferibile la versione simbolica.

#+begin_src ruby

if a >= 0 && a <= 9
  puts 'la variabile a è compresa tra 0 e 9'
end

#+end_src

Qui abbiamo detto a Ruby: /se la variabile a è maggiore od uguale 0 *e* la variabile a è minore od uguale a 9, scrivi.../

#+begin_src ruby

if nome == 'pippo' || nome == 'pluto'
  puts 'ti chiami pippo o pluto'
else
  puts 'il tuo nome è un altro'
end

#+end_src

Qui invece: /se la variabile nome contiene la stringa pippo *o* la variabile nome contiene la stringa pluto, scrivi.../

Si possono mettere più condizioni su uno stesso /if..else..end/, certo bisogna fare attenzione, molta attenzione. Se avete condizioni multiple, dato che hanno la stessa precedenza e vengono valutate da sinistra verso destra, a volte avrete bisogno delle parentesi per raggruppare le valutazioni.
L'operatore /not/ è di tipo /unario/ e quindi si applica solo ad un /operando/: /!true/ è uguale a /false/ come /non vero/ è uguale a /falso/. Gli altri invece si dicono /binari/ perché si applicano a due operandi.
Ne esiste anche uno /terziario/ che serve per esprimere una condizione su una sola riga:

#+begin_src ruby

#questa riga è equivalente al test if..else..end
condizione ? puts('vera') : puts('falsa')

if condizione
  puts 'vera'
else
  puts 'falsa'
end

#+end_src

I due test sono equivalenti.

Ruby ha anche un'altra sintassi per i test negativi: /unless..else..end/. In pratica: /se non è vero fai qualcosa altrimenti fai altro/.

#+begin_src ruby

if a != 1
  puts 'a è diverso da 1'
end

unless a == 1
  puts 'a è diverso da 1'
end

#+end_src

I due test sono equivalenti. Il test /unless/ vi assicuro che è davvero comodo, perché più spesso di quanto possiate credere è più chiaro e facilmente capibile il controllare che una cosa non sia vera.

