test.html

<div id="outline-container-sec-3-4-5" class="outline-4">
<h4 id="sec-3-4-5"><span class="section-number-4">3.4.5</span> Confrontare le cose e decidere cosa fare</h4>
<div class="outline-text-4" id="text-3-4-5">
<p>
Cominciamo a vedere le cose serie. Un programma non è un programma se non prendiamo decisioni.
Fino ad adesso abbiamo solo dato comandi ed è il momento di decidersi a <i>decidere</i>.
</p>

<p>
Per prima cosa guardiamo gli operatori <i>booleani</i> (si chiamano booleani da George Bool un matematico inglese dell'800):
</p>

<ul class="org-ul">
<li><b>&gt;</b> maggiore di&#x2026;
</li>
<li><b>&lt;</b> minore di&#x2026;
</li>
<li><b>&gt;=</b> maggiore od uguale di&#x2026;
</li>
<li><b>&lt;=</b> minore od uguale di&#x2026;
</li>
<li><b>==</b> uguale a&#x2026;
</li>
<li><b>!=</b> non uguale a&#x2026;
</li>
</ul>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:001</span>:0&gt; 5 &gt; 2
=&gt; <span class="org-variable-name">true</span>
irb(main)<span class="org-constant">:002</span>:0&gt; 5 &lt; 2
=&gt; <span class="org-variable-name">false</span>
irb(main)<span class="org-constant">:003</span>:0&gt; 5 &gt;= 5
=&gt; <span class="org-variable-name">true</span>
irb(main)<span class="org-constant">:004</span>:0&gt; 5 &lt;=5
=&gt; <span class="org-variable-name">true</span>
irb(main)<span class="org-constant">:005</span>:0&gt; 5 == 5
=&gt; <span class="org-variable-name">true</span>
irb(main)<span class="org-constant">:006</span>:0&gt; 5 != 5
=&gt; <span class="org-variable-name">false</span>
irb(main)<span class="org-constant">:007</span>:0&gt;
</pre>
</div>

<p>
Con questi <i>operatori</i> possiamo sapere quindi se un numero è maggiore, minore od uguale ad un altro.
</p>

<p>
Lo possiamo fare anche con le stringhe:
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:001</span>:0&gt; 5 &gt; 2
=&gt; <span class="org-variable-name">true</span>
irb(main)<span class="org-constant">:002</span>:0&gt; 5 &lt; 2
=&gt; <span class="org-variable-name">false</span>
irb(main)<span class="org-constant">:003</span>:0&gt; 5 &gt;= 5
=&gt; <span class="org-variable-name">true</span>
irb(main)<span class="org-constant">:004</span>:0&gt; 5 &lt;=5
=&gt; <span class="org-variable-name">true</span>
irb(main)<span class="org-constant">:005</span>:0&gt; 5 == 5
=&gt; <span class="org-variable-name">true</span>
irb(main)<span class="org-constant">:006</span>:0&gt; 5 != 5
=&gt; <span class="org-variable-name">false</span>
irb(main)<span class="org-constant">:007</span>:0&gt;
</pre>
</div>

<p>
Questo non vi fa domandare cosa succede con le stringe? È interessante perché il confronto è fatto sul <i>valore lessicale</i> delle stringhe.
</p>

<p>
Guardate:
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:013</span>:0&gt; <span class="org-string">'a'</span> &gt; <span class="org-string">'b'</span>
=&gt; <span class="org-variable-name">false</span>
irb(main)<span class="org-constant">:014</span>:0&gt; <span class="org-string">'b'</span> &gt; <span class="org-string">'a'</span>
=&gt; <span class="org-variable-name">true</span>
irb(main)<span class="org-constant">:015</span>:0&gt;
</pre>
</div>

<p>
Capito? L'<i>ordine lessicale</i> è praticamente quello come nel dizionario con però un problema:
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:014</span>:0&gt; <span class="org-string">'b'</span> &gt; <span class="org-string">'a'</span>
=&gt; <span class="org-variable-name">true</span>
irb(main)<span class="org-constant">:015</span>:0&gt; <span class="org-string">'B'</span> &gt; <span class="org-string">'a'</span>
=&gt; <span class="org-variable-name">false</span>
irb(main)<span class="org-constant">:016</span>:0&gt;
</pre>
</div>

<p>
Come sarebbe? <i>b</i> è maggiore di <i>a</i> ma <i>B</i> no?
</p>

<p>
I computer ordinano in maniera diversa da noi, sono ancora più stupidi di quello che avevamo fino ad ora pensato, loro ordinano prima le lettere maiuscole e poi le minuscole (per la verità prima ordinano i numeri, poi le maiuscole e dopo le minuscole). Questo è un problema.
</p>

<p>
Dobbiamo quindi stare attenti, ma fortunatamente Ruby ci aiuta con il metodo <i>downcase</i> che mette la stringa tutta in minuscolo o <i>upcase</i> che la rende tutta maiuscola.
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:018</span>:0&gt; <span class="org-string">'B'</span>.downcase
=&gt; <span class="org-string">"b"</span>
irb(main)<span class="org-constant">:019</span>:0&gt; <span class="org-string">'B'</span>.downcase &gt; <span class="org-string">'a'</span>.downcase
=&gt; <span class="org-variable-name">true</span>
irb(main)<span class="org-constant">:020</span>:0&gt; <span class="org-string">'B'</span> &gt; <span class="org-string">'a'</span>
=&gt; <span class="org-variable-name">false</span>
irb(main)<span class="org-constant">:021</span>:0&gt; <span class="org-string">'a'</span>.upcase
=&gt; <span class="org-string">"A"</span>
irb(main)<span class="org-constant">:022</span>:0&gt;
</pre>
</div>

<p>
Ora abbiamo capito gli <i>operatori booleani</i> e che ci facciamo? Li usiamo per <i>decidere cosa fare</i>.
</p>

<p>
Prendete l'editor che scriviamo un programma nuovo.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-builtin">puts</span> <span class="org-string">"Quanti anni hai?"</span>

eta = gets

<span class="org-keyword">if</span> eta == 9
  <span class="org-builtin">puts</span> <span class="org-string">"fai la quarta elementare"</span>
<span class="org-keyword">else</span>
  <span class="org-builtin">puts</span> <span class="org-string">"non fai la quarta elementare"</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Salvate come avete imparato con il nome <i>test.rb</i> e poi eseguitelo:
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  source  ruby test.rb 
Quanti anni hai?
8
non fai la quarta elementare
</pre>
</div>

<p>
Ora però proviamo scrivendo nove quando lo chiede:
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  source  ruby test.rb 
Quanti anni hai?
9
non fai la quarta elementare
</pre>
</div>

<p>
Qualcosa non va.
</p>

<p>
Intanto capiamo cosa è <i>gets</i>. Ricordate <i>puts</i> e gli <i>input</i> e <i>output</i>&#x2026; La mamma che va a cena?
Bene. Il metodo <i>gets</i> carica i dati dall'<i>input', cioè ci chiede di scrivere qualcosa e premere il tasto invio. I dati che prende li può caricare dentro una variabile.
Noi abbiamo messo l'età dentro la variabile /eta</i> (non ha l'accento perché come vi ho già detto i linguaggi di programmazione sono in <i>inglese</i> e l'inglese non ha accenti di questo tipo, quindi non tutti i caratteri possiamo usare per i nomi delle <i>variabili</i> o dei <i>metodi</i>. Non si possono usare nemmeno i caratteri degli operatori e se ci fate caso neanche gli spazi&#x2026; ), poi con un test abbiamo controllato il valore:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">if</span> eta == 9
  <span class="org-builtin">puts</span> <span class="org-string">"fai la quarta elementare"</span>
<span class="org-keyword">else</span>
  <span class="org-builtin">puts</span> <span class="org-string">"non fai la quarta elementare"</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
cioè: se (<i>if</i>) eta è uguale a 9 scrivi <i>fai la quarta elementare</i> altrimenti (<i>else</i>) scrivi <i>non fai la quarta elementare</i>. Noi però abbiamo scritto 9, perché non ha funzionato?
Ora ve lo spiego: il metodo <i>gets</i> legge i caratteri che scriviamo ma non sa che quelli sono numeri; per lui sono stringhe.
</p>

<p>
Ruby è un <i>linguaggio dinamico</i> e permette di valutare e confrontare le <i>pere con le mele</i>. La maestra vi avrà sicuramente detto che non si confrontano <i>le mele con le pere</i>&#x2026; La maestra ha ragione, ma i linguaggi di programmazione spesso non vanno proprio a braccetto con la matematica.
</p>


<p>
Scrivere così è perfettamente lecito:
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:023</span>:0&gt; <span class="org-string">"pere"</span> == 10
=&gt; <span class="org-variable-name">false</span>
irb(main)<span class="org-constant">:024</span>:0&gt;
</pre>
</div>

<p>
e giustamente restituisce il valore <i>falso</i> (<i>false</i>). Come mai? <br >
</p>

<p>
<b>Perché una stringa non è un numero</b>. <br >
</p>

<p>
Ruby, se i tipi del confronto non sono uguali o riconducibili, non confronta i valori ma i tipi stessi.
Sono sicuro che vi cominci ad arrivare un po' di mal di testa, quindi vediamo.
</p>

<p>
La stringa <i>pere</i> è di tipo String, il numero 10 è di tipo Fixnum (tutto questo lo abbiamo visto prima), Ruby lo sa che i tipi sono diversi e non può confrontare i valori, quindi ci dice che un tipo <i>String</i> non è un tipo <i>Fixnum</i>.
</p>

<p>
Lo so che la storia dei tipi è un po' complicata, ma piano piano la capirete e vedrete che è <i>ganzissima</i>.
</p>

<p>
Ritornando al problema di prima, quello del 9. Per far funzionare il programma noi dobbiamo convertire <i>eta</i> in un numero con il metodo <i>to_i</i> (<i>to integer</i>):
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-builtin">puts</span> <span class="org-string">"Quanti anni hai?"</span>

eta = gets.to_i

<span class="org-keyword">if</span> eta == 9
  <span class="org-builtin">puts</span> <span class="org-string">"fai la quarta elementare"</span>
<span class="org-keyword">else</span>
  <span class="org-builtin">puts</span> <span class="org-string">"non fai la quarta elementare"</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Però sarebbe meglio anche aggiungere un altro metodo: <i>chomp</i>; che rimuove il carattere di invio. Quando scrivete 9 e date invio, anche il carattere di invio viene mandato al programma. Ecco, <i>chomp</i> rimuove il carattere di invio dalla stringa (il carattere invisibile <i>newline</i> ovvero <i>nuova riga</i>).
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-builtin">puts</span> <span class="org-string">"Quanti anni hai?"</span>

eta = gets.chomp.to_i

<span class="org-keyword">if</span> eta == 9
  <span class="org-builtin">puts</span> <span class="org-string">"fai la quarta elementare"</span>
<span class="org-keyword">else</span>
  <span class="org-builtin">puts</span> <span class="org-string">"non fai la quarta elementare"</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Qui vedete anche un'altra cosa interessante, i metodi possono essere <i>chained</i> (<i>concatenati</i>); messi uno dopo l'altro e concatenati con il punto. Ogni metodo passerà a quello dopo il valore che ha elaborato: <br >
</p>

<p>
<b><i>gets</i> legge '9' + <i>newline</i>, lo passa a <i>chomp</i> che leva il <i>newline</i> e passa '9' a <i>to_i</i> che lo trasforma in un intero dal valore 9</b> <br >
</p>

<p>
La condizione <i>if</i> valuta sempre una espressione che restituisce un valore <i>booleano</i>: <i>true</i> o <i>false</i>, vero o falso; quindi possiamo utilizzare una <i>qualunque</i> espressione che restituisce vero a falso. Ricordatelo, servirà.
La condizione <i>if</i> può essere semplice:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">if</span> a &gt; 1
  <span class="org-builtin">puts</span> <span class="org-string">'a &#232; maggiore di uno'</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
o come abbiamo visto prima una alternativa contrassegnata dalla <i>parola chiave</i> (<i>keyword</i>) <i>else</i> (<i>altrimenti</i>).
La cosa interessante è che dentro un blocco <i>if..end</i> o <i>if..else..end</i> possiamo mettere dentro, <i>annidare</i>, altre condizioni:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">if</span> a &gt; 1
  <span class="org-builtin">puts</span> <span class="org-string">'a &#232; maggiore di 1'</span>
<span class="org-keyword">else</span>
  <span class="org-keyword">if</span> a == 0
    <span class="org-builtin">puts</span> <span class="org-string">'a &#232; uguale zero'</span>
  <span class="org-keyword">else</span>
    <span class="org-builtin">puts</span> <span class="org-string">'a &#232; minore di zero'</span>
  <span class="org-keyword">end</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Si potrebbe anche scrivere meglio, ma va bene per capire. Come vedete il test prima controlla se <i>a è maggiore di 1</i>, se non lo è ci chiediamo: <i>a è uguale a zero?</i> se lo è lo scriviamo, altrimenti sarà per forza <i>minore di zero</i>. In questa maniera, <i>annidando</i> delle condizioni abbiamo valutato i tre possibili stati di un numero:
</p>

<ul class="org-ul">
<li>è maggiore di zero
</li>
<li>è zero
</li>
<li>è minore di zero
</li>
</ul>

<p>
Se modifichiamo il programma di prima e lo salviamo come <i>test2.rb</i>:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-builtin">puts</span> <span class="org-string">"Quanti anni hai?"</span>

eta = gets.to_i

<span class="org-keyword">if</span> eta == 9
  <span class="org-builtin">puts</span> <span class="org-string">"fai la quarta elementare"</span>
<span class="org-keyword">else</span>
  <span class="org-keyword">if</span> eta &lt; 9
    <span class="org-builtin">puts</span> <span class="org-string">"sei ancora piccolo e fai la prima o la seconda o la terza"</span>
  <span class="org-keyword">else</span>
    <span class="org-builtin">puts</span> <span class="org-string">"Sei gi&#224; laureato?"</span>
  <span class="org-keyword">end</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Pensate a quanti <i>giochini</i> potremmo fare con la possibilità di <i>annidare</i> le condizioni. 
Questo in gergo si chiama: <i>ramo decisionale</i>.
Visto che parliamo di <i>ramo decisionale</i> prima di guardare i <i>cicli</i> (<i>loop</i>) vediamo un altro modo per prendere le decisioni.
È un modo molto potente ed utile, che ci permette di scrivere meglio il programma di prima.
</p>

<p>
Salvatelo come <i>test3.rb</i> ed eseguite come avete imparato:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-builtin">puts</span> <span class="org-string">"Quanti anni hai?"</span>

eta = gets.to_i

<span class="org-keyword">case</span> eta
<span class="org-keyword">when</span> 6
  <span class="org-builtin">puts</span> <span class="org-string">'fai la prima elementare'</span>
<span class="org-keyword">when</span> 7
  <span class="org-builtin">puts</span> <span class="org-string">'fai la seconda elementare'</span>
<span class="org-keyword">when</span> 8
  <span class="org-builtin">puts</span> <span class="org-string">'fai la terza elementare'</span>
<span class="org-keyword">when</span> 9
  <span class="org-builtin">puts</span> <span class="org-string">'fai la quarta elementare'</span>
<span class="org-keyword">when</span> 10
  <span class="org-builtin">puts</span> <span class="org-string">'fai la quinta elementare'</span>
<span class="org-keyword">else</span>
  <span class="org-keyword">if</span> eta &gt; 10
  <span class="org-builtin">puts</span> <span class="org-string">'Vai alle medie?'</span>
  <span class="org-keyword">else</span>
    <span class="org-builtin">puts</span> <span class="org-string">"Fai ancora l'asilo"</span>
  <span class="org-keyword">end</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Ho usato l'<i>espressione condizionale</i> <i>case..when..end</i>. È nella sua <i>forma completa</i>: if..when..else..end.
Vediamo che succede in questo caso.
Questa espressione è come una cassettiera con i cassetti numerati, ci sono cinque cassetti numerati 6,7,8,9,10 e un ultimo dove si mette tutto quello che non va negli altri.
Qui ho usato anche una condizione <i>if..else..end</i> per diramare ulteriormente il test. 
</p>

<p>
Eseguendolo potete vedere i risultati:
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  source  ruby test3.rb 
Quanti anni hai?
2
Fai ancora l<span class="org-string">'asilo</span>
<span class="org-string">&#10140;  source  ruby test3.rb</span>
<span class="org-string">Quanti anni hai?</span>
<span class="org-string">6</span>
<span class="org-string">fai la prima elementare</span>
<span class="org-string">&#10140;  source  ruby test3.rb</span>
<span class="org-string">Quanti anni hai?</span>
<span class="org-string">11</span>
<span class="org-string">Vai alle medie?</span>
<span class="org-string">&#10140;  source  ruby test3.rb</span>
<span class="org-string">Quanti anni hai?</span>
<span class="org-string">10</span>
<span class="org-string">fai la quinta elementare</span>
<span class="org-string">&#10140;  source</span>
</pre>
</div>

<p>
L'espressione <i>case..when..end</i> è davvero molto utile, cose come queste ci sono i tutti i linguaggi di programmazione anche se a volte meno potenti. In Ruby potete valutare praticamente qualunque cosa.
</p>

<p>
Ecco una stringa:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">case</span> nome
  <span class="org-keyword">when</span> <span class="org-string">'pippo'</span>
    <span class="org-builtin">puts</span> <span class="org-string">'ti chiami pippo'</span>
  <span class="org-keyword">else</span>
    <span class="org-builtin">puts</span> <span class="org-string">'non ti chiami pippo'</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Simuliamo una condizione <i>if..else..end</i>:
</p>

<div class="org-src-container">

<pre class="src src-ruby">test_booleano = <span class="org-variable-name">true</span>

<span class="org-keyword">case</span> test_booleano
  <span class="org-keyword">when</span> <span class="org-variable-name">true</span>
    <span class="org-builtin">puts</span> <span class="org-string">'vero'</span>
  <span class="org-keyword">when</span> <span class="org-variable-name">false</span>
    <span class="org-builtin">puts</span> <span class="org-string">'falso'</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
L'espressione <i>case..when..end</i> è <b>utilissima</b> e spesso mantiene il <i>codice</i> pulito e facilmente leggibile, provate e divertitevi.
</p>

<p>
Nelle <i>espressioni condizionali</i> possiamo fare più test insieme. Come?
Con gli operatori logici: 
</p>

<ul class="org-ul">
<li><b>or</b>, che si può scrivere spesso anche come <b>||</b>
</li>
<li><b>and</b> che si può scrivere spesso anche come <b>&amp;&amp;</b>
</li>
<li><b>not</b> che si può scrivere spesso anche come <b>!</b>
</li>
</ul>

<p>
La differenza tra quello scritto e quello a simbolo (<i>and</i> e <i>&amp;&amp;</i>) sta nel livello di precedenza di valutazione: la versione scritta ha una precedenza più bassa. Normalmente non ve ne curate, ma può causare a volte problemi subdoli. Nel dubbio è preferibile la versione simbolica.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">if</span> a &gt;= 0 &amp;&amp; a &lt;= 9
  <span class="org-builtin">puts</span> <span class="org-string">'la variabile a &#232; compresa tra 0 e 9'</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Qui abbiamo detto a Ruby: <i>se la variabile a è maggiore od uguale 0 <b>e</b> la variabile a è minore od uguale a 9, scrivi&#x2026;</i>
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">if</span> nome == <span class="org-string">'pippo'</span> || nome == <span class="org-string">'pluto'</span>
  <span class="org-builtin">puts</span> <span class="org-string">'ti chiami pippo o pluto'</span>
<span class="org-keyword">else</span>
  <span class="org-builtin">puts</span> <span class="org-string">'il tuo nome &#232; un altro'</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Qui invece: <i>se la variabile nome contiene la stringa pippo <b>o</b> la variabile nome contiene la stringa pluto, scrivi&#x2026;</i>
</p>

<p>
Si possono mettere più condizioni su uno stesso <i>if..else..end</i>, certo bisogna fare attenzione, molta attenzione. Se avete condizioni multiple, dato che hanno la stessa precedenza e vengono valutate da sinistra verso destra, a volte avrete bisogno delle parentesi per raggruppare le valutazioni.
L'operatore <i>not</i> è di tipo <i>unario</i> e quindi si applica solo ad un <i>operando</i>: <i>!true</i> è uguale a <i>false</i> come <i>non vero</i> è uguale a <i>falso</i>. Gli altri invece si dicono <i>binari</i> perché si applicano a due operandi.
Ne esiste anche uno <i>terziario</i> che serve per esprimere una condizione su una sola riga:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-comment-delimiter">#</span><span class="org-comment">questa riga &#232; equivalente al test if..else..end</span>
condizione ? <span class="org-builtin">puts</span>(<span class="org-string">'vera'</span>) : <span class="org-builtin">puts</span>(<span class="org-string">'falsa'</span>)

<span class="org-keyword">if</span> condizione
  <span class="org-builtin">puts</span> <span class="org-string">'vera'</span>
<span class="org-keyword">else</span>
  <span class="org-builtin">puts</span> <span class="org-string">'falsa'</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
I due test sono equivalenti.
</p>

<p>
Ruby ha anche un'altra sintassi per i test negativi: <i>unless..else..end</i>. In pratica: <i>se non è vero fai qualcosa altrimenti fai altro</i>.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">if</span> a != 1
  <span class="org-builtin">puts</span> <span class="org-string">'a &#232; diverso da 1'</span>
<span class="org-keyword">end</span>

<span class="org-keyword">unless</span> a == 1
  <span class="org-builtin">puts</span> <span class="org-string">'a &#232; diverso da 1'</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
I due test sono equivalenti. Il test <i>unless</i> vi assicuro che è davvero comodo, perché più spesso di quanto possiate credere è più chiaro e facilmente capibile il controllare che una cosa non sia vera.
</p>
</div>
</div>
