test.org
*** Cicli, ripetere le cose da fare molte volte

I /cicli/ ci permettono di ripete delle /istruzioni/ più volte. 
Ruby ha alcuni tipi di cicli come la maggior parte dei linguaggi di programmazione.

+ *while..end* finché la condizione è vera fai qualcosa
+ *until..end* finché la condizione è falsa fai qualcosa
+ *for..in..end* per ogni valore all'interno di un insieme di valori fai qualcosa

È un po' come /if/ e /unless/.

Ora vi dico una cosa, è abbastanza raro usare questi cicli in Ruby e lo vedrete più avanti.

Scrivete nel vostro editor il programma che segue, salvatelo come /loop.rb/ ed eseguitelo:

#+begin_src ruby :tangle source/loop.rb :noweb yes

puts 'Inserisci un numero'
numero = gets.chomp.to_i

while numero != 10
  puts 'il mumero è diverso dal numero segreto'
  puts 'Inserisci un numero'
  numero = gets.chomp.to_i
end 

puts 'hai trovato il numero segreto. Complimenti!'

#+end_src

Il ciclo eseguirà le istruzioni date dentro di lui finché il numero inserito non sarà 10.

Se adesso uso /until/ invece di /while/:

#+begin_src ruby :tangle source/loop1.rb :noweb yes

puts 'Inserisci un numero'
numero = gets.chomp.to_i

until numero != 10
  puts 'il mumero è diverso dal numero segreto'
  puts 'Inserisci un numero'
  numero = gets.chomp.to_i
end 

puts 'hai trovato il numero segreto. Complimenti!'

#+end_src

Visto che viene valutata la /falsità/ funzionerà al contrario.

Il ciclo /for/ invece prenderà un valore da un insieme di valori assegnandolo ad una /variabile/ fino ad esaurire tutti i valori.
Sembra complicato ma non lo è molto.

#+begin_src ruby :tangle source/loop2.rb :noweb yes

numeri = [0,1,2,3,4,5,6,7,8,9]

for numero in numeri
  puts numero
end

#+end_src

Se lo eseguite come sapete:

#+begin_src sh

➜  source  ruby loop2.rb
0
1
2
3
4
5
6
7
8
9
➜  source  

#+end_src

Il programma ha stampato tutti i numeri compresi nell'/array/ chiamato /numeri/.
Vediamo però subito cosa è un /array/ (tipo /Array/). È una collezione di /elementi/, in questo caso numeri. Non l'ho chiamato /insieme/ perché esiste nella /libreria/ Ruby un tipo /Set/ che serve apposta per gli /insiemi matematici/.
È più corretto chiamare questi tipi di dati /collezioni/ e noi vogliamo imparare il modo più corretto possibile di nominare le cose.

Agli elementi contenuti in una /collezione/ si può accedere direttamente se si vuole:

#+begin_src ruby

array = [1,2,3,4,5,6]

primo_elemento = array[0]
secondo_elemento = array[1]

#+end_src

Vi si accede tramite quello che si chiama /indice/ dell'array. Gli array sono *indicizzati a partire da zero*, questo lo dovete ricordare bene.
Ci sono anche i metodi /first/ e /last/ che come dicono i loro nomi accedono al primo e l'ultimo elemento. A volte ci interessa anche sapere quanti elemeti ci sono nell'array e quindi abbiamo /size/.

Qualcuno furbo ha capito l'/inghippo/ della indicizzazione da zero?

#+begin_src ruby

irb(main):003:0> array = [0,1,2,3,4,5,6,7,8,9]
=> [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
irb(main):004:0> array.first
=> 0
irb(main):005:0> array.last
=> 9
irb(main):006:0> array.size
=> 10
irb(main):007:0> array[0]
=> 0
irb(main):008:0> array[3]
=> 3
irb(main):009:0> array[array.size]
=> nil
irb(main):010:0> array[array.size - 1]
=> 9
irb(main):011:0> 

#+end_src

Capito? 

Una nota: il valore /nil/ è un valore particolare che ha un significato analogo al latino /nihil/ cioè /il nulla/. È il valore che si ha quando si leggono cose che non esistono: variabili, valori...

Insomma un /array/ è come una scatola con gli scompartimenti ed ogni scompartimento può contenere qualsiasi tipo di dato supportato da Ruby: numeri, stringhe, array...
Non solo, un /array/ in Ruby contrariamente ad altri linguaggi può mischiare i tipi.

#+begin_src ruby

array = [1, 2, "pippo", 3, "pluto", ['a','b','c']]

#+end_src

Immaginate adesso le /odiose/ tabelline, quelle che la maestra vi chiede continuamente... Bene, la tabella pitagorica è un array (in questo caso a due dimensioni). \\

Qualcuno furbo ha già capito come far fare una tabella pitagorica a Ruby?

#+begin_src ruby :tangle source/tabellina.rb :noweb yes

numeri = [1,2,3,4,5,6,7,8,9,10]

for numero in numeri
  riga = ''
  for moltiplicatore in numeri
    valore = numero * moltiplicatore
    if valore < 10
      separatore = '  '
    else
      separatore = ' '
    end
    riga = riga + valore.to_s + separatore
  end
  puts riga
end

#+end_src

Eseguitelo...

#+begin_src sh

➜  source  ruby tabellina.rb 
1  2  3  4  5  6  7  8  9  10 
2  4  6  8  10 12 14 16 18 20 
3  6  9  12 15 18 21 24 27 30 
4  8  12 16 20 24 28 32 36 40 
5  10 15 20 25 30 35 40 45 50 
6  12 18 24 30 36 42 48 54 60 
7  14 21 28 35 42 49 56 63 70 
8  16 24 32 40 48 56 64 72 80 
9  18 27 36 45 54 63 72 81 90 
10 20 30 40 50 60 70 80 90 100 
➜  source  

#+end_src

Che ne dite? Va bene? (Si potrebbe anche fare meglio, ma per ora va bene così).
Guardate bene il codice e cercate di capire, avete tutte le informazioni per farlo.

Come vi ho già detto, i cicli in Ruby non sono molto usati perché ha anche altri modi di fare la stessa cosa in maniera più compatta e leggibile.

#+begin_src ruby :tangle source/tabellina2.rb :noweb yes

numeri = [1,2,3,4,5,6,7,8,9,10]
 
tabella = numeri.map do |numero|
  riga = numeri.map do |moltiplicatore|
    valore = numero * moltiplicatore
    separatore = valore < 10 ? '  ' : ' '
    valore.to_s + separatore
  end
  riga.join
end
puts tabella.join("\n")

#+end_src

Questo ne è un esempio, anche se non pare adesso quando sarete più bravi vi sembrerà meglio di quello sopra:

#+begin_src ruby :tangle source/tabellina3.rb :noweb yes

numeri = [1,2,3,4,5,6,7,8,9,10]
 
puts (numeri.map { |numero|
        (numeri.map { |moltiplicatore|
          valore = numero * moltiplicatore
          separatore = valore < 10 ? '  ' : ' '
          valore.to_s + separatore
        }).join
      }).join("\n")

#+end_src

Per arrivare magari a questo:

#+begin_src ruby :tangle source/tabellina4.rb :noweb yes

numeri = [1,2,3,4,5,6,7,8,9,10]
puts (numeri.map { |numero|
        (numeri.map { |moltiplicatore| 
          (valore = numero * moltiplicatore).to_s + (valore < 10 ? '  ' : ' ') 
        }).join
      }).join("\n")

#+end_src

Forse troverete anche altri modi...
Negli ultimi due esempi, ci sono delle cose da notare che fanno di Ruby un linguaggio particolare (detto /funzionale/). Il concetto non è semplice.

Cercate di stare attenti, questa cosa che dirò adesso non è facile.
Le istruzioni, le variabili ed i metodi che usiamo in Ruby vivono dentro un /contesto/. Cosa è?
Pensate a casa vostra, quello è il vostro contesto. Pensate alla scuola, l'aula. L'aula è il vostro /contesto/ e cioè la zona /chiusa/ dove state e dove fate qualcosa.
In Ruby si possono fare queste /stanze/ in vari modi: con le parentesi per esempio ma anche con parole chiave (/keywords/) particolari come /do..end/.

Le /keywords/ /do..end/ corrispondono a /{..}/ e definiscono quello che viene chiamato /blocco/ ma anche /closure/ (/chiusura/).

#+begin_src ruby

#prima forma
do |parametro|
  ...
end

seconda forma
{ |parametro|
  ...
}

#+end_src 

Queste forme sono /closure/ con un valore in entrata.

Vediamo il metodo /each/ che è un metodo del tipo Array (ma anche altri tipi lo hanno):

#+begin_src ruby

[1,2,3,4,5,6,7,8,9,10].each {|numero|
  puts numero
}

for numero in [1,2,3,4,5,6,7,8,9,10]
  puts numero
end

#+end_src

Le due forme sono equivalenti, cioè portano allo stesso risultato e stamperanno in /output/ i valori contenuti nell'array.
La differenza è di tipo /paradigmatico/.
Vedo già le vostre facce sconvolte. - E che vuol dire? -.

Un /paradigma/ è un modo, un metodo per fare qualcosa. Delle regole. Un paradigma di calcolo è quello che usate per fare le divisioni o altri calcoli per esempio. Si potrebbero fare in molti modi e voi ne usate uno di questi. Nei linguaggi di programmazione ci sono molti modi di fare le cose, molti /paradigmi di programmazione/.

Se noi scriviamo con il /for..in..end/ usiamo quello che viene detto /paradigma imperativo/, se usiamo il metodo /each/ quello detto /paradigma funzionale/.
Ruby ci permette di farlo nei due modi e ci lascia liberi di usare quello che ci piace di più.
Vedrete poi che quello /funzionale/ è generalmente migliore, ma lo capirete da soli.

Insomma, /each/ è un metodo del tipo array che come parametro in /input/ prende una /closure/ o una /lambda/ o un oggetto Proc passando nel parametro di questi il valore di ogni elemento dell'array su cui è chiamato. \\

Bene, ora ci vuole un mese di vacanza per riposarci!

A parte le chiacchiere e le definizioni da secchioni, una volta usata è più semplice del previsto.
Se guardate il codice sopra, immaginate che dentro /numero/ ci vada finire dentro di volta in volta 1 poi 2 poi 3 poi 4 e così via fino a 10 che è l'ultimo elemento della collezione. Nel codice dentro la /closure/ potere usare poi /numero/ e fare quello che volete. Qui lo stampiamo in /output/.

Negli esempi io ho usato il metodo /map/, che è simile ad /each/, ma mentre /each/ invoca la /closure/ per ogni elemento della collezione senza fare altro, /map/ cosa fa... restituisce un'altra collezione coi dentro i risultati della elaborazione della /closure/.
Nell'esempio poi trasformo una collezione in una stringa usando il metodo /join/ (/unisci/), un metodo che prende tutti gli elementi della collezione e li concatena come una stringa.

Questo modo di /ciclare/ (brutta parola e si dice solo qui... è come le parolacce) si chiama più giustamente /iterazione/ e questi metodi si chiamano /iteratori/.
Un altro metodo /iteratore/ è per esempio /times/ che però è dei numeri e non degli array:

#+begin_src ruby

10.times do 
  puts "ciao!"
end

#+end_src

Verrà scritto in /output/ dieci volte ciao.
Usare gli /iteratori/ è molto importante e rende il /codice/ meglio organizzabile e leggibile.

Questa è la lista dei metodi disponibili per il tipo Array:

#+begin_src ruby

irb(main):001:0> Array.methods.sort
=> [:!, :!=, :!~, :<, :<=, :<=>, :==, :===, :=~, :>, :>=, :[], :__id__, :__send__, :allocate, :ancestors, :autoload, :autoload?, :class, :class_eval, :class_exec, :class_variable_defined?, :class_variable_get, :class_variable_set, :class_variables, :clone, :const_defined?, :const_get, :const_missing, :const_set, :constants, :define_singleton_method, :display, :dup, :enum_for, :eql?, :equal?, :extend, :freeze, :frozen?, :hash, :include, :include?, :included_modules, :inspect, :instance_eval, :instance_exec, :instance_method, :instance_methods, :instance_of?, :instance_variable_defined?, :instance_variable_get, :instance_variable_set, :instance_variables, :is_a?, :kind_of?, :method, :method_defined?, :methods, :module_eval, :module_exec, :name, :new, :nil?, :object_id, :prepend, :private_class_method, :private_constant, :private_instance_methods, :private_method_defined?, :private_methods, :protected_instance_methods, :protected_method_defined?, :protected_methods, :public_class_method, :public_constant, :public_instance_method, :public_instance_methods, :public_method, :public_method_defined?, :public_methods, :public_send, :remove_class_variable, :remove_instance_variable, :respond_to?, :send, :singleton_class, :singleton_class?, :singleton_method, :singleton_methods, :superclass, :taint, :tainted?, :tap, :to_enum, :to_s, :trust, :try_convert, :untaint, :untrust, :untrusted?]
irb(main):002:0> 

#+end_src

Ho fatto la stessa cosa fatta indietro con Fixnum, ricordate? Ho qui però usato un nuovo metodo: /sort/. Il metodo /sort/ mette in ordine un array.

