test.html

<div id="outline-container-sec-3-4-6" class="outline-4">
<h4 id="sec-3-4-6"><span class="section-number-4">3.4.6</span> Cicli, ripetere le cose da fare molte volte</h4>
<div class="outline-text-4" id="text-3-4-6">
<p>
I <i>cicli</i> ci permettono di ripete delle <i>istruzioni</i> più volte. 
Ruby ha alcuni tipi di cicli come la maggior parte dei linguaggi di programmazione.
</p>

<ul class="org-ul">
<li><b>while..end</b>, <b>finché</b> la condizione è vera fai qualcosa
</li>
<li><b>until..end</b>, finché la condizione è falsa fai qualcosa
</li>
<li><b>for..in..end</b>, per ogni valore all'interno di un insieme di valori fai qualcosa
</li>
</ul>

<p>
È un po' come <i>if</i> e <i>unless</i>.
</p>

<p>
Ora vi dico una cosa, è abbastanza raro usare questi cicli in Ruby e lo vedrete più avanti.
</p>

<p>
Scrivete nel vostro editor il programma che segue, salvatelo come <i>loop.rb</i> ed eseguitelo:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-builtin">puts</span> <span class="org-string">'Inserisci un numero'</span>
numero = gets.chomp.to_i

<span class="org-keyword">while</span> numero != 10
  <span class="org-builtin">puts</span> <span class="org-string">'il mumero &#232; diverso dal numero segreto'</span>
  <span class="org-builtin">puts</span> <span class="org-string">'Inserisci un numero'</span>
  numero = gets.chomp.to_i
<span class="org-keyword">end</span> 

<span class="org-builtin">puts</span> <span class="org-string">'hai trovato il numero segreto. Complimenti!'</span>
</pre>
</div>

<p>
Il ciclo eseguirà le istruzioni date dentro di lui finché il numero inserito non sarà 10.
</p>

<p>
Se adesso uso <i>until</i> invece di <i>while</i>:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-builtin">puts</span> <span class="org-string">'Inserisci un numero'</span>
numero = gets.chomp.to_i

<span class="org-keyword">until</span> numero != 10
  <span class="org-builtin">puts</span> <span class="org-string">'il mumero &#232; diverso dal numero segreto'</span>
  <span class="org-builtin">puts</span> <span class="org-string">'Inserisci un numero'</span>
  numero = gets.chomp.to_i
<span class="org-keyword">end</span> 

<span class="org-builtin">puts</span> <span class="org-string">'hai trovato il numero segreto. Complimenti!'</span>
</pre>
</div>

<p>
Visto che viene valutata la <i>falsità</i> funzionerà al contrario.
</p>

<p>
Il ciclo <i>for</i> invece prenderà un valore da un insieme di valori assegnandolo ad una <i>variabile</i> fino ad esaurire tutti i valori.
Sembra complicato ma non lo è molto.
</p>

<div class="org-src-container">

<pre class="src src-ruby">numeri = [0,1,2,3,4,5,6,7,8,9]

<span class="org-keyword">for</span> numero <span class="org-keyword">in</span> numeri
  <span class="org-builtin">puts</span> numero
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Se lo eseguite come sapete:
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  source  ruby loop2.rb
0
1
2
3
4
5
6
7
8
9
&#10140;  source
</pre>
</div>

<p>
Il programma ha stampato tutti i numeri compresi nell'<i>array</i> chiamato <i>numeri</i>.
Vediamo però subito cosa è un <i>array</i> (tipo <i>Array</i>). È una collezione di <i>elementi</i>, in questo caso numeri. Non l'ho chiamato <i>insieme</i> perché esiste nella <i>libreria</i> Ruby un tipo <i>Set</i> che serve apposta per gli <i>insiemi matematici</i>.
È più corretto chiamare questi tipi di dati <i>collezioni</i> e noi vogliamo imparare il modo più corretto possibile di nominare le cose.
</p>

<p>
Agli elementi contenuti in una <i>collezione</i> si può accedere direttamente se si vuole:
</p>

<div class="org-src-container">

<pre class="src src-ruby">array = [1,2,3,4,5,6]

primo_elemento = array[0]
secondo_elemento = array[1]
</pre>
</div>

<p>
Vi si accede tramite quello che si chiama <i>indice</i> dell'array. Gli array sono <b>indicizzati a partire da zero</b>, questo lo dovete ricordare bene.
Ci sono anche i metodi <i>first</i> e <i>last</i> che come dicono i loro nomi accedono al primo e l'ultimo elemento. A volte ci interessa anche sapere quanti elemeti ci sono nell'array e quindi abbiamo <i>size</i>.
</p>

<p>
Qualcuno furbo ha capito l'<i>inghippo</i> della indicizzazione da zero?
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:003</span>:0&gt; array = [0,1,2,3,4,5,6,7,8,9]
=&gt; [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
irb(main)<span class="org-constant">:004</span>:0&gt; array.first
=&gt; 0
irb(main)<span class="org-constant">:005</span>:0&gt; array.last
=&gt; 9
irb(main)<span class="org-constant">:006</span>:0&gt; array.size
=&gt; 10
irb(main)<span class="org-constant">:007</span>:0&gt; array[0]
=&gt; 0
irb(main)<span class="org-constant">:008</span>:0&gt; array[3]
=&gt; 3
irb(main)<span class="org-constant">:009</span>:0&gt; array[array.size]
=&gt; <span class="org-variable-name">nil</span>
irb(main)<span class="org-constant">:010</span>:0&gt; array[array.size - 1]
=&gt; 9
irb(main)<span class="org-constant">:011</span>:0&gt;
</pre>
</div>

<p>
Capito? 
</p>

<p>
Una nota: il valore <i>nil</i> è un valore particolare che ha un significato analogo al latino <i>nihil</i> cioè <i>il nulla</i>. È il valore che si ha quando si leggono cose che non esistono: variabili, valori&#x2026;
</p>

<p>
Insomma un <i>array</i> è come una scatola con gli scompartimenti ed ogni scompartimento può contenere qualsiasi tipo di dato supportato da Ruby: numeri, stringhe, array&#x2026;
Non solo, un <i>array</i> in Ruby contrariamente ad altri linguaggi può mischiare i tipi.
</p>

<div class="org-src-container">

<pre class="src src-ruby">array = [1, 2, <span class="org-string">"pippo"</span>, 3, <span class="org-string">"pluto"</span>, [<span class="org-string">'a'</span>,<span class="org-string">'b'</span>,<span class="org-string">'c'</span>]]
</pre>
</div>

<p>
Immaginate adesso le <i>odiose</i> tabelline, quelle che la maestra vi chiede continuamente&#x2026; Bene, la tabella pitagorica è un array (in questo caso a due dimensioni). <br >
</p>

<p>
Qualcuno furbo ha già capito come far fare una tabella pitagorica a Ruby?
</p>

<div class="org-src-container">

<pre class="src src-ruby">numeri = [1,2,3,4,5,6,7,8,9,10]

<span class="org-keyword">for</span> numero <span class="org-keyword">in</span> numeri
  riga = <span class="org-string">''</span>
  <span class="org-keyword">for</span> moltiplicatore <span class="org-keyword">in</span> numeri
    valore = numero * moltiplicatore
    <span class="org-keyword">if</span> valore &lt; 10
      separatore = <span class="org-string">'  '</span>
    <span class="org-keyword">else</span>
      separatore = <span class="org-string">' '</span>
    <span class="org-keyword">end</span>
    riga = riga + valore.to_s + separatore
  <span class="org-keyword">end</span>
  <span class="org-builtin">puts</span> riga
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Eseguitelo&#x2026;
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  source  ruby tabellina.rb 
1  2  3  4  5  6  7  8  9  10 
2  4  6  8  10 12 14 16 18 20 
3  6  9  12 15 18 21 24 27 30 
4  8  12 16 20 24 28 32 36 40 
5  10 15 20 25 30 35 40 45 50 
6  12 18 24 30 36 42 48 54 60 
7  14 21 28 35 42 49 56 63 70 
8  16 24 32 40 48 56 64 72 80 
9  18 27 36 45 54 63 72 81 90 
10 20 30 40 50 60 70 80 90 100 
&#10140;  source
</pre>
</div>

<p>
Che ne dite? Va bene? (Si potrebbe anche fare meglio, ma per ora va bene così).
Guardate bene il codice e cercate di capire, avete tutte le informazioni per farlo.
</p>

<p>
Come vi ho già detto, i cicli in Ruby non sono molto usati perché ha anche altri modi di fare la stessa cosa in maniera più compatta e leggibile.
</p>

<div class="org-src-container">

<pre class="src src-ruby">numeri = [1,2,3,4,5,6,7,8,9,10]

tabella = numeri.map <span class="org-keyword">do</span> |numero|
  riga = numeri.map <span class="org-keyword">do</span> |moltiplicatore|
    valore = numero * moltiplicatore
    separatore = valore &lt; 10 ? <span class="org-string">'  '</span> : <span class="org-string">' '</span>
    valore.to_s + separatore
  <span class="org-keyword">end</span>
  riga.join
<span class="org-keyword">end</span>
<span class="org-builtin">puts</span> tabella.join(<span class="org-string">"\n"</span>)
</pre>
</div>

<p>
Questo ne è un esempio, anche se non pare adesso quando sarete più bravi vi sembrerà meglio di quello sopra:
</p>

<div class="org-src-container">

<pre class="src src-ruby">numeri = [1,2,3,4,5,6,7,8,9,10]

<span class="org-builtin">puts</span> (numeri.map { |numero|
        (numeri.map { |moltiplicatore|
          valore = numero * moltiplicatore
          separatore = valore &lt; 10 ? <span class="org-string">'  '</span> : <span class="org-string">' '</span>
          valore.to_s + separatore
        }).join
      }).join(<span class="org-string">"\n"</span>)
</pre>
</div>

<p>
Per arrivare magari a questo:
</p>

<div class="org-src-container">

<pre class="src src-ruby">numeri = [1,2,3,4,5,6,7,8,9,10]
<span class="org-builtin">puts</span> (numeri.map { |numero|
        (numeri.map { |moltiplicatore| 
          (valore = numero * moltiplicatore).to_s + (valore &lt; 10 ? <span class="org-string">'  '</span> : <span class="org-string">' '</span>) 
        }).join
      }).join(<span class="org-string">"\n"</span>)
</pre>
</div>

<p>
Forse troverete anche altri modi&#x2026;
Negli ultimi due esempi, ci sono delle cose da notare che fanno di Ruby un linguaggio particolare (detto <i>funzionale</i>). Il concetto non è semplice.
</p>

<p>
Cercate di stare attenti, questa cosa che dirò adesso non è facile.
Le istruzioni, le variabili ed i metodi che usiamo in Ruby vivono dentro un <i>contesto</i>. Cosa è?
Pensate a casa vostra, quello è il vostro contesto. Pensate alla scuola, l'aula. L'aula è il vostro <i>contesto</i> e cioè la zona <i>chiusa</i> dove state e dove fate qualcosa.
In Ruby si possono fare queste <i>stanze</i> in vari modi: con le parentesi per esempio ma anche con parole chiave (<i>keywords</i>) particolari come <i>do..end</i>.
</p>

<p>
Le <i>keywords</i> <i>do..end</i> corrispondono a <i>{..}</i> e definiscono quello che viene chiamato <i>blocco</i> ma anche <i>closure</i> (<i>chiusura</i>).
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-comment-delimiter">#</span><span class="org-comment">prima forma</span>
<span class="org-keyword">do</span> |parametro|
  ...
<span class="org-keyword">end</span>

seconda forma
{ |parametro|
  ...
}
</pre>
</div>

<p>
Queste forme sono <i>closure</i> con un valore in entrata.
</p>

<p>
Vediamo il metodo <i>each</i> che è un metodo del tipo Array (ma anche altri tipi lo hanno):
</p>

<div class="org-src-container">

<pre class="src src-ruby">[1,2,3,4,5,6,7,8,9,10].each {|numero|
  <span class="org-builtin">puts</span> numero
}

<span class="org-keyword">for</span> numero <span class="org-keyword">in</span> [1,2,3,4,5,6,7,8,9,10]
  <span class="org-builtin">puts</span> numero
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Le due forme sono equivalenti, cioè portano allo stesso risultato e stamperanno in <i>output</i> i valori contenuti nell'array.
La differenza è di tipo <i>paradigmatico</i>.
Vedo già le vostre facce sconvolte. - E che vuol dire? -.
</p>

<p>
Un <i>paradigma</i> è un modo, un metodo per fare qualcosa. Delle regole. Un paradigma di calcolo è quello che usate per fare le divisioni o altri calcoli per esempio. Si potrebbero fare in molti modi e voi ne usate uno di questi. Nei linguaggi di programmazione ci sono molti modi di fare le cose, molti <i>paradigmi di programmazione</i>.
</p>

<p>
Se noi scriviamo con il <i>for..in..end</i> usiamo quello che viene detto <i>paradigma imperativo</i>, se usiamo il metodo <i>each</i> quello detto <i>paradigma funzionale</i>.
Ruby ci permette di farlo nei due modi e ci lascia liberi di usare quello che ci piace di più.
Vedrete poi che quello <i>funzionale</i> è generalmente migliore, ma lo capirete da soli.
</p>

<p>
Insomma, <i>each</i> è un metodo del tipo array che come parametro in <i>input</i> prende una <i>closure</i> o una <i>lambda</i> o un oggetto Proc passando nel parametro di questi il valore di ogni elemento dell'array su cui è chiamato. <br >
</p>

<p>
Bene, ora ci vuole un mese di vacanza per riposarci!
</p>

<p>
A parte le chiacchiere e le definizioni da secchioni, una volta usata è più semplice del previsto.
Se guardate il codice sopra, immaginate che dentro <i>numero</i> ci vada finire dentro di volta in volta 1 poi 2 poi 3 poi 4 e così via fino a 10 che è l'ultimo elemento della collezione. Nel codice dentro la <i>closure</i> potere usare poi <i>numero</i> e fare quello che volete. Qui lo stampiamo in <i>output</i>.
</p>

<p>
Negli esempi io ho usato il metodo <i>map</i>, che è simile ad <i>each</i>, ma mentre <i>each</i> invoca la <i>closure</i> per ogni elemento della collezione senza fare altro, <i>map</i> cosa fa&#x2026; restituisce un'altra collezione coi dentro i risultati della elaborazione della <i>closure</i>.
Nell'esempio poi trasformo una collezione in una stringa usando il metodo <i>join</i> (<i>unisci</i>), un metodo che prende tutti gli elementi della collezione e li concatena come una stringa.
</p>

<p>
Questo modo di <i>ciclare</i> (brutta parola e si dice solo qui&#x2026; è come le parolacce) si chiama più giustamente <i>iterazione</i> e questi metodi si chiamano <i>iteratori</i>.
Un altro metodo <i>iteratore</i> è per esempio <i>times</i> che però è dei numeri e non degli array:
</p>

<div class="org-src-container">

<pre class="src src-ruby">10.times <span class="org-keyword">do</span> 
  <span class="org-builtin">puts</span> <span class="org-string">"ciao!"</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Verrà scritto in <i>output</i> dieci volte ciao.
Usare gli <i>iteratori</i> è molto importante e rende il <i>codice</i> meglio organizzabile e leggibile.
</p>

<p>
Questa è la lista dei metodi disponibili per il tipo Array:
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:001</span>:0&gt; <span class="org-type">Array</span>.methods.sort
=&gt; [<span class="org-constant">:!</span>, <span class="org-constant">:!=</span>, <span class="org-constant">:!~</span>, <span class="org-constant">:&lt;</span>, <span class="org-constant">:&lt;=</span>, <span class="org-constant">:&lt;=&gt;</span>, <span class="org-constant">:==</span>, <span class="org-constant">:===</span>, <span class="org-constant">:=~</span>, <span class="org-constant">:&gt;</span>, <span class="org-constant">:&gt;=</span>, <span class="org-constant">:[]</span>, <span class="org-constant">:__id__</span>, <span class="org-constant">:__send__</span>, <span class="org-constant">:allocate</span>, <span class="org-constant">:ancestors</span>, <span class="org-constant">:autoload</span>, <span class="org-constant">:autoload?</span>, <span class="org-constant">:class</span>, <span class="org-constant">:class_eval</span>, <span class="org-constant">:class_exec</span>, <span class="org-constant">:class_variable_defined?</span>, <span class="org-constant">:class_variable_get</span>, <span class="org-constant">:class_variable_set</span>, <span class="org-constant">:class_variables</span>, <span class="org-constant">:clone</span>, <span class="org-constant">:const_defined?</span>, <span class="org-constant">:const_get</span>, <span class="org-constant">:const_missing</span>, <span class="org-constant">:const_set</span>, <span class="org-constant">:constants</span>, <span class="org-constant">:define_singleton_method</span>, <span class="org-constant">:display</span>, <span class="org-constant">:dup</span>, <span class="org-constant">:enum_for</span>, <span class="org-constant">:eql?</span>, <span class="org-constant">:equal?</span>, <span class="org-constant">:extend</span>, <span class="org-constant">:freeze</span>, <span class="org-constant">:frozen?</span>, <span class="org-constant">:hash</span>, <span class="org-constant">:include</span>, <span class="org-constant">:include?</span>, <span class="org-constant">:included_modules</span>, <span class="org-constant">:inspect</span>, <span class="org-constant">:instance_eval</span>, <span class="org-constant">:instance_exec</span>, <span class="org-constant">:instance_method</span>, <span class="org-constant">:instance_methods</span>, <span class="org-constant">:instance_of?</span>, <span class="org-constant">:instance_variable_defined?</span>, <span class="org-constant">:instance_variable_get</span>, <span class="org-constant">:instance_variable_set</span>, <span class="org-constant">:instance_variables</span>, <span class="org-constant">:is_a?</span>, <span class="org-constant">:kind_of?</span>, <span class="org-constant">:method</span>, <span class="org-constant">:method_defined?</span>, <span class="org-constant">:methods</span>, <span class="org-constant">:module_eval</span>, <span class="org-constant">:module_exec</span>, <span class="org-constant">:name</span>, <span class="org-constant">:new</span>, <span class="org-constant">:nil?</span>, <span class="org-constant">:object_id</span>, <span class="org-constant">:prepend</span>, <span class="org-constant">:private_class_method</span>, <span class="org-constant">:private_constant</span>, <span class="org-constant">:private_instance_methods</span>, <span class="org-constant">:private_method_defined?</span>, <span class="org-constant">:private_methods</span>, <span class="org-constant">:protected_instance_methods</span>, <span class="org-constant">:protected_method_defined?</span>, <span class="org-constant">:protected_methods</span>, <span class="org-constant">:public_class_method</span>, <span class="org-constant">:public_constant</span>, <span class="org-constant">:public_instance_method</span>, <span class="org-constant">:public_instance_methods</span>, <span class="org-constant">:public_method</span>, <span class="org-constant">:public_method_defined?</span>, <span class="org-constant">:public_methods</span>, <span class="org-constant">:public_send</span>, <span class="org-constant">:remove_class_variable</span>, <span class="org-constant">:remove_instance_variable</span>, <span class="org-constant">:respond_to?</span>, <span class="org-constant">:send</span>, <span class="org-constant">:singleton_class</span>, <span class="org-constant">:singleton_class?</span>, <span class="org-constant">:singleton_method</span>, <span class="org-constant">:singleton_methods</span>, <span class="org-constant">:superclass</span>, <span class="org-constant">:taint</span>, <span class="org-constant">:tainted?</span>, <span class="org-constant">:tap</span>, <span class="org-constant">:to_enum</span>, <span class="org-constant">:to_s</span>, <span class="org-constant">:trust</span>, <span class="org-constant">:try_convert</span>, <span class="org-constant">:untaint</span>, <span class="org-constant">:untrust</span>, <span class="org-constant">:untrusted?</span>]
irb(main)<span class="org-constant">:002</span>:0&gt;
</pre>
</div>

<p>
Ho fatto la stessa cosa fatta indietro con Fixnum, ricordate? Ho qui però usato un nuovo metodo: <i>sort</i>. Il metodo <i>sort</i> mette in ordine un array.
</p>
</div>
</div>
