test.org
*** Scriviamo i nostri metodi, altrimenti a che serve?

Fino ad adesso abbiamo visto a grandi linee cosa sono i metodi e ne abbiamo usati alcuni.
I metodi, si possono /definire/ come le /variabili/. Altrimenti potremmo anche andare a coltivale le cipolle (che sono buone e le adoro anche crude nell'insalata).

Come si fa a definire un metodo? Per prima cosa decidiamo un bel nome, un nome importante... Soprattutto un nome che dica cosa fa, per ricordarlo meglio.

#+begin_src ruby

def somma(x, y)
  x + y
end

#+end_src

Abbiamo definito un metodo che prende due valori in /input/, /x/ ed /y/, che si chiama /somma/.
Lo possiamo usare così:

#+begin_src ruby :tangle source/metodi.rb :noweb yes

def somma(x, y)
  x + y
end

risultato = somma(2, 3)

puts risultato

#+end_src

Fate nell'editor, salvate come /metodi.rb/ ed eseguite. Vedrete il risultato di /2 + 3/.
Invece di assegnare il valore di ritorno del metodo ad una variabile, in questo caso avreste anche potuto scrivere:

#+begin_src ruby

puts somma(2, 3)

#+end_src

Ricordate? /puts/ è un metodo, quindi vuol dire che noi possiamo passare un metodo ad un altro metodo come suo parametro in /input/.

#+begin_src ruby

puts somma(somma(2, 3), 5)

#+end_src

Che farà? Quanto farà? Chi lo sa? Al primo che risponde niente compiti.


I metodi, come abbiamo già visto, servono per scrivere delle istruzioni che poi possiamo riutilizzare. Pensate se ogni volta dovessimo riscrivere le stesse cose.
Programmare è spesso un lavoro ripetitivo e potenzialmente si scrivono le stesse cose centinaia se non migliaia di volte.
Senza i metodi (almeno quelli) saremmo perduti (anche se pensate esistono linguaggi che non li hanno).

I metodi sono raggruppati in /librerie/ generalmente, anche Ruby ha le sue /librerie/. Insomma i metodi sono come delle parole o meglio dei capitoli dentro dei libri, che sono sugli scaffali di una libreria. È importante ricordare questo perché vedremo in seguito che per chiamare un metodo dobbiamo trovarlo come un libro nello scaffale: /scaffale_destro::libro_primo.capitolo_secondo/.

Trasformiamo il codice per scrivere la tabella pitagorica come metodo:

#+begin_src ruby :tangle source/metodi2.rb :noweb yes

# prepara una tabella (array bidimensionale)
# con i valori
def tabella_pitagorica(numeri)
  numeri.map { |numero|
    numeri.map { |moltiplicatore| 
      numero * moltiplicatore
    }
  }
end

# stampa un array bidimensionale
def stampa_tabella(tabella)
  puts (tabella.map { |riga| 
    (riga.map {|numero| 
      numero.to_s + (numero < 10 ? '  ' : ' ')
    }).join
  }).join("\n")
end

stampa_tabella(tabella_pitagorica([1,2,3,4,5,6,7,8,9,10]))

#+end_src

Al solito salviamo, come /metodi1.rb/ ed eseguiamo.

#+begin_src sh

➜  source  ruby metodi2.rb
1  2  3  4  5  6  7  8  9  10 
2  4  6  8  10 12 14 16 18 20 
3  6  9  12 15 18 21 24 27 30 
4  8  12 16 20 24 28 32 36 40 
5  10 15 20 25 30 35 40 45 50 
6  12 18 24 30 36 42 48 54 60 
7  14 21 28 35 42 49 56 63 70 
8  16 24 32 40 48 56 64 72 80 
9  18 27 36 45 54 63 72 81 90 
10 20 30 40 50 60 70 80 90 100 
➜  source 

#+end_src

Come vedete il risultato è quello. Adesso abbiamo un metodo chiamato /tabella_pitagorica/ che prenderà in /input/ come /parametro/ un array di numeri e costruirà un array di array di numeri.

#+begin_src ruby

[[1,2,3,4,5,6,7,8,9],[2,4,6,8,10,12,14,16,18,20], [3,6,9,12,15,18,21,24,27,30], ...]

#+end_src

L'altro metodo, /stampa_tabella/, prende in entrata un /array bidimensionale/ (la tabella coi valori) e lo stampa in /output/.
La cosa interessante è che /stampa_tabella/ stampa in quel modo, qualunque /array bidimensionale/ e non solo la nostra tabella pitagorica.

#+begin_src ruby :tangle source/metodi3.rb :noweb yes

# stampa un array bidimensionale
def stampa_tabella(tabella)
  puts (tabella.map { |riga| 
    (riga.map {|numero| 
      numero.to_s + (numero < 10 ? '  ' : ' ')
    }).join
  }).join("\n")
end

stampa_tabella([[1,10,30,4,50,6,7,8,9,0,9,0],[2,4,6,81,17,12,14,1,1,2], [3,6,9,12,15,18,21,24,27,30]])

#+end_src

Salvate come /metodi3.rb/ ed eseguite:

#+begin_src sh

➜  source  ruby metodi3.rb
1  10 30 4  50 6  7  8  9  0  9  0  
2  4  6  81 17 12 14 1  1  2  
3  6  9  12 15 18 21 24 27 30 
➜  source  

#+end_src

I metodi possono avere più parametri ma come consiglio limitatevi al meno possibile.


** Le cose serie

Ora cominceremo ad affrontare alcune delle caratteristiche di Ruby che ne fanno un linguaggio agile moderno.

