test.html

<div id="outline-container-sec-3-4-7" class="outline-4">
<h4 id="sec-3-4-7"><span class="section-number-4">3.4.7</span> Scriviamo i nostri metodi, altrimenti a che serve?</h4>
<div class="outline-text-4" id="text-3-4-7">
<p>
Fino ad adesso abbiamo visto a grandi linee cosa sono i metodi e ne abbiamo usati alcuni.
I metodi, si possono <i>definire</i> come le <i>variabili</i>. Altrimenti potremmo anche andare a coltivale le cipolle (che sono buone e le adoro anche crude nell'insalata).
</p>

<p>
Come si fa a definire un metodo? Per prima cosa decidiamo un bel nome, un nome importante&#x2026; Soprattutto un nome che dica cosa fa, per ricordarlo meglio.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">def</span> <span class="org-function-name">somma</span>(x, y)
  x + y
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Abbiamo definito un metodo che prende due valori in <i>input</i>, <i>x</i> ed <i>y</i>, che si chiama <i>somma</i>.
Lo possiamo usare così:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">def</span> <span class="org-function-name">somma</span>(x, y)
  x + y
<span class="org-keyword">end</span>

risultato = somma(2, 3)

<span class="org-builtin">puts</span> risultato
</pre>
</div>

<p>
Fate nell'editor, salvate come <i>metodi.rb</i> ed eseguite. Vedrete il risultato di <i>2 + 3</i>.
Invece di assegnare il valore di ritorno del metodo ad una variabile, in questo caso avreste anche potuto scrivere:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-builtin">puts</span> somma(2, 3)
</pre>
</div>

<p>
Ricordate? <i>puts</i> è un metodo, quindi vuol dire che noi possiamo passare un metodo ad un altro metodo come suo parametro in <i>input</i>.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-builtin">puts</span> somma(somma(2, 3), 5)
</pre>
</div>

<p>
Che farà? Quanto farà? Chi lo sa? Al primo che risponde niente compiti.
</p>


<p>
I metodi, come abbiamo già visto, servono per scrivere delle istruzioni che poi possiamo riutilizzare. Pensate se ogni volta dovessimo riscrivere le stesse cose.
Programmare è spesso un lavoro ripetitivo e potenzialmente si scrivono le stesse cose centinaia se non migliaia di volte.
Senza i metodi (almeno quelli) saremmo perduti (anche se pensate esistono linguaggi che non li hanno).
</p>

<p>
I metodi sono raggruppati in <i>librerie</i> generalmente, anche Ruby ha le sue <i>librerie</i>. Insomma i metodi sono come delle parole o meglio dei capitoli dentro dei libri, che sono sugli scaffali di una libreria. È importante ricordare questo perché vedremo in seguito che per chiamare un metodo dobbiamo trovarlo come un libro nello scaffale: <i>scaffale_destro::libro_primo.capitolo_secondo</i>.
</p>

<p>
Trasformiamo il codice per scrivere la tabella pitagorica come metodo:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-comment-delimiter"># </span><span class="org-comment">prepara una tabella (array bidimensionale)</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">con i valori</span>
<span class="org-keyword">def</span> <span class="org-function-name">tabella_pitagorica</span>(numeri)
  numeri.map { |numero|
    numeri.map { |moltiplicatore| 
      numero * moltiplicatore
    }
  }
<span class="org-keyword">end</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">stampa un array bidimensionale</span>
<span class="org-keyword">def</span> <span class="org-function-name">stampa_tabella</span>(tabella)
  <span class="org-builtin">puts</span> (tabella.map { |riga| 
    (riga.map {|numero| 
      numero.to_s + (numero &lt; 10 ? <span class="org-string">'  '</span> : <span class="org-string">' '</span>)
    }).join
  }).join(<span class="org-string">"\n"</span>)
<span class="org-keyword">end</span>

stampa_tabella(tabella_pitagorica([1,2,3,4,5,6,7,8,9,10]))
</pre>
</div>

<p>
Al solito salviamo, come <i>metodi1.rb</i> ed eseguiamo.
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  source  ruby metodi2.rb
1  2  3  4  5  6  7  8  9  10 
2  4  6  8  10 12 14 16 18 20 
3  6  9  12 15 18 21 24 27 30 
4  8  12 16 20 24 28 32 36 40 
5  10 15 20 25 30 35 40 45 50 
6  12 18 24 30 36 42 48 54 60 
7  14 21 28 35 42 49 56 63 70 
8  16 24 32 40 48 56 64 72 80 
9  18 27 36 45 54 63 72 81 90 
10 20 30 40 50 60 70 80 90 100 
&#10140;  source
</pre>
</div>

<p>
Come vedete il risultato è quello. Adesso abbiamo un metodo chiamato <i>tabella_pitagorica</i> che prenderà in <i>input</i> come <i>parametro</i> un array di numeri e costruirà un array di array di numeri.
</p>

<div class="org-src-container">

<pre class="src src-ruby">[[1,2,3,4,5,6,7,8,9],[2,4,6,8,10,12,14,16,18,20], [3,6,9,12,15,18,21,24,27,30], ...]
</pre>
</div>

<p>
L'altro metodo, <i>stampa_tabella</i>, prende in entrata un <i>array bidimensionale</i> (la tabella coi valori) e lo stampa in <i>output</i>.
La cosa interessante è che <i>stampa_tabella</i> stampa in quel modo, qualunque <i>array bidimensionale</i> e non solo la nostra tabella pitagorica.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-comment-delimiter"># </span><span class="org-comment">stampa un array bidimensionale</span>
<span class="org-keyword">def</span> <span class="org-function-name">stampa_tabella</span>(tabella)
  <span class="org-builtin">puts</span> (tabella.map { |riga| 
    (riga.map {|numero| 
      numero.to_s + (numero &lt; 10 ? <span class="org-string">'  '</span> : <span class="org-string">' '</span>)
    }).join
  }).join(<span class="org-string">"\n"</span>)
<span class="org-keyword">end</span>

stampa_tabella([[1,10,30,4,50,6,7,8,9,0,9,0],[2,4,6,81,17,12,14,1,1,2], [3,6,9,12,15,18,21,24,27,30]])
</pre>
</div>

<p>
Salvate come <i>metodi3.rb</i> ed eseguite:
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  source  ruby metodi3.rb
1  10 30 4  50 6  7  8  9  0  9  0  
2  4  6  81 17 12 14 1  1  2  
3  6  9  12 15 18 21 24 27 30 
&#10140;  source
</pre>
</div>

<p>
I metodi possono avere più parametri ma come consiglio limitatevi al meno possibile.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Le cose serie</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Ora cominceremo ad affrontare alcune delle caratteristiche di Ruby che ne fanno un linguaggio agile moderno.
</p>
</div>
