test.org
*** Raggruppiamo i metodi in moduli

Ruby è un linguaggio estremamente /modularizzabile/ il che significa che ha numerosi modi di riutilizzare le cose già scritte. Questo ne fa un linguaggio molto adatto al lavoro in collaborazione, cioè tra più persone che lavorano a parti diverse del /codice/.

Uno dei meccanismi di /raggruppamento/ sono i /moduli/:

#+begin_src ruby

module Pippo

  def dice(cosa)
    puts cosa
  end

end

#+end_src

I /moduli/ sono dei /contesti/ dove i metodi (ed altre cose) vivono.
Prima però di usare i /metodi/ di un modulo, dobbiamo /includerlo/. Avete presente quando un amichetto viene a casa vostra e giocate insieme? Uguale.
Dovete prima /invitare/ il modulo nel vostro /contesto/. A casa vostra, insomma.


#+begin_src ruby :tangle source/moduli.rb :noweb yes

module Pippo

  def dice(cosa)
    puts "Pippo dice: " + cosa
  end

end

include Pippo

dice("ciao")

#+end_src

Salvate come /moduli.rb/ ed eseguite, vedrete che scriverà: /Pippo dice ciao/.
Avete invitato il modulo /Pippo/ nel vostro /contesto/ con la /parola chiave/ (/keyword/) /include/. Da lì in poi potete usare il metodo /dice/ semplicemente. Se non includete il modulo, Ruby si lamenterà dicendo che non trova il metodo /ciao/

#+begin_src sh

➜  source  ruby moduli.rb
moduli.rb:20:in `<main>': undefined method `dice' for main:Object (NoMethodError)
➜  source 

#+end_src

Includere un modulo significa /copiare i metodi del modulo nel contesto dove si include/, questo può sembrare difficile ma non lo è (non molto almeno) ed ha delle conseguenze.


#+begin_src ruby :tangle source/moduli2.rb :noweb yes

module Pippo

  def dice(cosa)
    puts "Pippo dice: " + cosa
  end

end

module Pluto

  def dice(cosa)
    puts "Pluto dice: " + cosa
  end

end

include Pippo
include Pluto

dice("ciao")

#+end_src

Salvate come /moduli2.rb/ ed eseguite:

#+begin_src sh

➜  source  ruby moduli2.rb
Pluto dice: ciao
➜  source  

#+end_src

Il problema è: quale metodo /dice/ viene chiamato? Come vedete è quello di /Pluto/ perché il modulo /Pluto/ è incluso dopo il modulo /Pippo/.
Ci sono varie implicazioni in questo comprese delle cose /strane/:

#+begin_src ruby :tangle source/moduli3.rb :noweb yes

module Pippo

  def dice(cosa)
    puts "Pippo dice: " + cosa
  end

end

module Pluto

  def dice(cosa)
    puts "Pluto dice: " + cosa
  end

end

include Pippo
include Pluto

Pippo.dice("ciao")
Pippo::dice("ciao")

#+end_src

Salvate come /moduli3.rb/ ed eseguite:

#+begin_src sh

➜  source  ruby moduli3.rb
Pluto dice: ciao
Pluto dice: ciao
➜  source  

#+end_src

Come si può vedere anche usando gli operatori di visibilità di Ruby /::/ o . non si riesce ad invocare il /dice/ racchiuso dentro /Pippo/. Questo è spiegabile ma non adesso.
Per ora ricordate che: *se includete un modulo i metodi di questo sono /copiati/ dove li avete inclusi e che i metodi con lo stesso nome e lista di prametri si /sovrascrivono/*.

Adesso vediamo come rendere un modulo una libreria.

Scrivete e salvate questi due file, il primo chiamatelo /pippo.rb/ ed il secondo /moduli4.rb/.

#+begin_src ruby :tangle source/pippo.rb :noweb yes

module Pippo

  def dice(cosa)
    puts "Pippo dice: " + cosa
  end

end

#+end_src

#+begin_src ruby :tangle source/moduli4.rb :noweb yes

require './pippo'

include Pippo

dice("ciao")

#+end_src

Eseguite /moduli4.rb/:

#+begin_src sh

➜  source  ruby moduli4.rb
Pippo dice: ciao
➜  source 

#+end_src

Abbiamo trasformato il modulo /Pippo/ in una libreria. Potete mettere quello che volete dentro il file della libreria e chiamarlo come volete.
Lo dovete prima /richiedere/ con la /keyword/ */require/* ed il percorso nel /file system/ del file. La sintassi del percorso segue lo standard /Unix/ quindi non avete come su Microsoft Windows^{tm} le barre rovesciate =\= ma invece avete le barre normali =/=.

In questo caso, require './pippo', significa: /richiedi il file pippo.rb che si trova nella cartella corrente/. Una volta richiesto, il file potrà essere usato come se il suo codice fosse scritto direttamente.

Il dividere un programma in più file, consente di riutilizzare il /codice/ scritto in precedenza da noi o da altri e di averne anche una organizzazione /spaziale/ (e non parlo di astronavi). 

