test.html

<div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> Raggruppiamo i metodi in moduli</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
Ruby è un linguaggio estremamente <i>modularizzabile</i> il che significa che ha numerosi modi di riutilizzare le cose già scritte. Questo ne fa un linguaggio molto adatto al lavoro in collaborazione, cioè tra più persone che lavorano a parti diverse del <i>codice</i>.
</p>

<p>
Uno dei meccanismi di <i>raggruppamento</i> sono i <i>moduli</i>:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">module</span> <span class="org-type">Pippo</span>

  <span class="org-keyword">def</span> <span class="org-function-name">dice</span>(cosa)
    <span class="org-builtin">puts</span> cosa
  <span class="org-keyword">end</span>

<span class="org-keyword">end</span>
</pre>
</div>

<p>
I <i>moduli</i> sono dei <i>contesti</i> dove i metodi (ed altre cose) vivono.
Prima però di usare i <i>metodi</i> di un modulo, dobbiamo <i>includerlo</i>. Avete presente quando un amichetto viene a casa vostra e giocate insieme? Uguale.
Dovete prima <i>invitare</i> il modulo nel vostro <i>contesto</i>. A casa vostra, insomma.
</p>


<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">module</span> <span class="org-type">Pippo</span>

  <span class="org-keyword">def</span> <span class="org-function-name">dice</span>(cosa)
    <span class="org-builtin">puts</span> <span class="org-string">"Pippo dice: "</span> + cosa
  <span class="org-keyword">end</span>

<span class="org-keyword">end</span>

<span class="org-builtin">include</span> <span class="org-type">Pippo</span>

dice(<span class="org-string">"ciao"</span>)
</pre>
</div>

<p>
Salvate come <i>moduli.rb</i> ed eseguite, vedrete che scriverà: <i>Pippo dice ciao</i>.
Avete invitato il modulo <i>Pippo</i> nel vostro <i>contesto</i> con la <i>parola chiave</i> (<i>keyword</i>) <i>include</i>. Da lì in poi potete usare il metodo <i>dice</i> semplicemente. Se non includete il modulo, Ruby si lamenterà dicendo che non trova il metodo <i>ciao</i>
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  source  ruby moduli.rb
moduli.rb:20:in <span class="org-sh-quoted-exec">`&lt;main&gt;': undefined method `</span>dice<span class="org-string">' for main:Object (NoMethodError)</span>
<span class="org-string">&#10140;  source</span>
</pre>
</div>

<p>
Includere un modulo significa <i>copiare i metodi del modulo nel contesto dove si include</i>, questo può sembrare difficile ma non lo è (non molto almeno) ed ha delle conseguenze.
</p>


<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">module</span> <span class="org-type">Pippo</span>

  <span class="org-keyword">def</span> <span class="org-function-name">dice</span>(cosa)
    <span class="org-builtin">puts</span> <span class="org-string">"Pippo dice: "</span> + cosa
  <span class="org-keyword">end</span>

<span class="org-keyword">end</span>

<span class="org-keyword">module</span> <span class="org-type">Pluto</span>

  <span class="org-keyword">def</span> <span class="org-function-name">dice</span>(cosa)
    <span class="org-builtin">puts</span> <span class="org-string">"Pluto dice: "</span> + cosa
  <span class="org-keyword">end</span>

<span class="org-keyword">end</span>

<span class="org-builtin">include</span> <span class="org-type">Pippo</span>
<span class="org-builtin">include</span> <span class="org-type">Pluto</span>

dice(<span class="org-string">"ciao"</span>)
</pre>
</div>

<p>
Salvate come <i>moduli2.rb</i> ed eseguite:
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  source  ruby moduli2.rb
Pluto dice: ciao
&#10140;  source
</pre>
</div>

<p>
Il problema è: quale metodo <i>dice</i> viene chiamato? Come vedete è quello di <i>Pluto</i> perché il modulo <i>Pluto</i> è incluso dopo il modulo <i>Pippo</i>.
Ci sono varie implicazioni in questo comprese delle cose <i>strane</i>:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">module</span> <span class="org-type">Pippo</span>

  <span class="org-keyword">def</span> <span class="org-function-name">dice</span>(cosa)
    <span class="org-builtin">puts</span> <span class="org-string">"Pippo dice: "</span> + cosa
  <span class="org-keyword">end</span>

<span class="org-keyword">end</span>

<span class="org-keyword">module</span> <span class="org-type">Pluto</span>

  <span class="org-keyword">def</span> <span class="org-function-name">dice</span>(cosa)
    <span class="org-builtin">puts</span> <span class="org-string">"Pluto dice: "</span> + cosa
  <span class="org-keyword">end</span>

<span class="org-keyword">end</span>

<span class="org-builtin">include</span> <span class="org-type">Pippo</span>
<span class="org-builtin">include</span> <span class="org-type">Pluto</span>

<span class="org-type">Pippo</span>.dice(<span class="org-string">"ciao"</span>)
<span class="org-type">Pippo</span>::dice(<span class="org-string">"ciao"</span>)
</pre>
</div>

<p>
Salvate come <i>moduli3.rb</i> ed eseguite:
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  source  ruby moduli3.rb
Pluto dice: ciao
Pluto dice: ciao
&#10140;  source
</pre>
</div>

<p>
Come si può vedere anche usando gli operatori di visibilità di Ruby <i>::</i> o . non si riesce ad invocare il <i>dice</i> racchiuso dentro <i>Pippo</i>. Questo è spiegabile ma non adesso.
Per ora ricordate che: <b>se includete un modulo i metodi di questo sono <i>copiati</i> dove li avete inclusi e che i metodi con lo stesso nome e lista di prametri si <i>sovrascrivono</i></b>.
</p>

<p>
Adesso vediamo come rendere un modulo una libreria.
</p>

<p>
Scrivete e salvate questi due file, il primo chiamatelo <i>pippo.rb</i> ed il secondo <i>moduli4.rb</i>.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">module</span> <span class="org-type">Pippo</span>

  <span class="org-keyword">def</span> <span class="org-function-name">dice</span>(cosa)
    <span class="org-builtin">puts</span> <span class="org-string">"Pippo dice: "</span> + cosa
  <span class="org-keyword">end</span>

<span class="org-keyword">end</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-builtin">require</span> <span class="org-string">'./pippo'</span>

<span class="org-builtin">include</span> <span class="org-type">Pippo</span>

dice(<span class="org-string">"ciao"</span>)
</pre>
</div>

<p>
Eseguite <i>moduli4.rb</i>:
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  source  ruby moduli4.rb
Pippo dice: ciao
&#10140;  source
</pre>
</div>

<p>
Abbiamo trasformato il modulo <i>Pippo</i> in una libreria. Potete mettere quello che volete dentro il file della libreria e chiamarlo come volete.
Lo dovete prima <i>richiedere</i> con la <i>keyword</i> <b><i>require</i></b> ed il percorso nel <i>file system</i> del file. La sintassi del percorso segue lo standard <i>Unix</i> quindi non avete come su Microsoft Windows<sup>tm</sup> le barre rovesciate <code>\</code> ma invece avete le barre normali <code>/</code>.
</p>

<p>
In questo caso, require './pippo', significa: <i>richiedi il file pippo.rb che si trova nella cartella corrente</i>. Una volta richiesto, il file potrà essere usato come se il suo codice fosse scritto direttamente.
</p>

<p>
Il dividere un programma in più file, consente di riutilizzare il <i>codice</i> scritto in precedenza da noi o da altri e di averne anche una organizzazione <i>spaziale</i> (e non parlo di astronavi). 
</p>
</div>
</div>
