test.org
*** Le classi (non quelle della scuola, o forse si?)

Cominciamo a vedere le /classi/, questi /oggetti/ misteriosi. Non ha caso ho detto /classi/ e /oggetti/.

Ruby è un /linguaggio di programmazione Object Oriented/, l'ho già detto prima. Ricordate?

Vuol dire: /linguaggio di programmazione orientato agli oggetti/. 
Che vuol dire: /un linguaggio di programmazione in cui gli oggetti sono la cosa più importante/.
Che vuol dire: /un linguaggio di programmazione dove si usano delle descrizioni degli oggetti, chiamate classi, per modellare il dominio del problema/.
Continuo? - Sempre più difficile, Signore e Signori! - \\

Facciamola semplice e partiamo da qualche esempio.

Intorno a noi ci sono tante cose, pensateci bene. Imparare a programmare i computer /fa bene/ anche perché insegna a ragionare e ad affrontare i problemi in maniera /analitica/.
Insomma, intorno a noi abbiamo tante cose: viviamo dentro delle /case/, guardiamo il /televisore/, ascoltiamo la musica col /giradischi/ (che voi forse non sapete nemmeno cosa sia, ma io sono vecchio e lo so), camminiamo con le scarpe, ci mettiamo i /pantaloni/ e ci sediamo sulla /sedia/, leggiamo /libri/... Potrei continuare all'infinito.

Intorno a noi ci sono oggetti. Questi oggetti servono a qualcosa, fanno qualcosa o subiscono qualcosa.
Gli oggetti possono essere formati da altri oggetti, ricordate quando prima ho detto dei mattoncini Lego^{(tm)}?
Il Meccano^{(tm)}, quando ero piccolo c'era questo, oggetti in metallo, viti e bulloni, motori elettrici...
Ci ho costruito tante cose.
Chi di voi è uno /smontatore/ professionista? Io da piccolo smontavo praticamente tutto: volevo vedere come funzionasse dentro.

Con i linguaggi di programmazione avete gli /strumenti per scatenare la curiosità/, se volete.
Ritorniamo ai nostri oggetti ed alla definizione di un /linguaggio di programmazione orientato agli oggetti/ (come è Ruby, che però non è solo questo): \\

+ *è un linguaggio che permette di descrivere il /dominio del problema/ definendo gli oggetti che lo compongono e le loro interazioni* \\

Il /dominio del problema/ significa solo /quello che volete fare/, perché usare delle parole difficili? Primo è perché vogliamo imparare le /parole giuste/, secondo perché, in realtà, c'è di più di /quello che volete fare/.
Per adesso però, va bene così.

Per /fare quello che volete fare/ dovete analizzare tutti i piccoli pezzi che compongono o servono per /fare quello che volete fare/. Tra un po' comincio con gli scioglilingua... \\

Ma cosa /volete fare?/. \\

Pensate alla macchina, che poi si dice /automobile/... Anche se è una /macchina/. Elenchiamo i pezzi che la compongono: sedili, sportelli, volante, ruote, vetri, ingranaggi, motore, viti, bulloni e /chi più ne ha ne metta/...

Ho puntualizzato che l'/automobile/ è una /macchina/ e vedrete che questa affermazione banale, così semplice, ha una sua ragione di esistere.

Cominciamo a descrivere meglio una automobile e facciamolo in Ruby.

#+begin_src ruby

class Automobile

end

#+end_src

Abbiamo definito una /classe/ e cioè una /classe di oggetti/. La /classe/ (/class/) è la descrizione dell'oggetto con le sue /proprietà/ o /attributi/ (gli oggetti che la compongono) ed i /metodi/ che sono il come interagisce col mondo esterno, cosa fa o cosa subisce.

L'automobile ha le ruote prima di tutto:

#+begin_src ruby

class Automobile

  @ruote = 4

end

#+end_src

/@ruote/ si chiama /variabile di istanza/. È una /variabile/ come le abbiamo già viste, ma vive dentro un /oggetto/ che sarebbe una /istanza di una classe/. \\
Le /variabili di istanza/ cominciano per /@/.

Ricapitoliamo:

+ la /classe/ descrive l'/oggetto/ nella sua forma e funzione
+ l'/istanza/ rende /viva/ la /classe/ come /oggetto/

Una /variabile di istanza/ non è ancora un /attributo/, anche se ancora non sappiamo cosa significhi un /attributo/.
Per farla semplice, diciamo che una /classe/ ha delle parti nascoste e delle parti visibili, l'/automobile/ ha di visibile la carrozzeria ma non il motore. Per vedere quello dovete aprire il cofano, guardare dentro.
È la stessa cosa, una classe in Ruby ha delle parti nascoste e delle parti visibili: /@ruote/ è ancora nascosta.
Direi anche di lasciarla nascosta, mica vogliamo che mentre siamo in corsa a duecento chilometri all'ora verso una curva ci cambino il numero delle ruote? Se di punto in bianco diventano tre? O due? o Niente?

Lasciamola nascosta /che è meglio/ (citazione dai Puffi).
Però, il numero delle persone potrebbe cambiare no?

Aggungiamo le persone, le auto portano le persone:

#+begin_src ruby

class Automobile
  
  @ruote = 4
  attr_accessor :persone
  
end

#+end_src

Ora noi abbiamo che /persone/ è /accessibile/ e si vede dall'esterno dell'oggetto.

#+begin_src ruby

irb(main):001:0> class Automobile
irb(main):002:1> @ruote = 4
irb(main):003:1> attr_accessor :persone
irb(main):004:1> end
=> nil
irb(main):005:0> Auto = Automobile.new
=> #<Automobile:0x007f8995f94a90>
irb(main):006:0> Auto.persone = 4
=> 4
irb(main):007:0> Auto.persone
=> 4
irb(main):008:0> 

#+end_src

Ho rifatto il codice dentro /irb/ per farvi vedere? Capito?
L'/attributo/ /persone/ è visibile dal'esterno dell'oggetto. Analizziamo il codice meglio.

Dopo aver definito la classe /Automobile/ ho costruito l'oggetto /Automobile/ con il metodo /new/ (/nuovo/). Si dice che /ho istanziato la classe/.
L'/oggetto/ appena creato l'ho immagazzinato dentro una variabile che ho chiamato /Auto/.

Cominciamo a capire cosa è la /classe/? La /classe/ è come il /progetto/ di un oggetto, che poi va costruito. Infatti nel gergo dei linguaggi di programmazione orientati agli oggetti, metodi come /new/ sono chiamati /costruttori/ (anche se con Ruby è impreciso e sarebbe meglio chiamarlo /metodo istanziatore/).

#+begin_src ruby

irb(main):005:0> Auto = Automobile.new
=> #<Automobile:0x007f8995f94a90>

#+end_src

Quello che vedete sotto ad /Auto = Automobile.new/ è il nome dell'istanza della classe /Automobile/ che ho appena creato. Il nome vero, ma noi ci riferiremo a questa con /Auto/.

Adesso cerco di cambiare il numero delle persone e quello delle ruote:

#+begin_src ruby

irb(main):009:0> Auto.persone
=> 4
irb(main):010:0> Auto.persone = 5
=> 5
irb(main):011:0> Auto.ruote = 2
NoMethodError: undefined method `ruote=' for #<Automobile:0x007f8995f94a90 @persone=5>
	from (irb):11
	from /home/nissl/bin/ruby-2.1/bin/irb:11:in `<main>'
irb(main):012:0> 

#+end_src

Sono riuscito a farlo per le /persone/ ma non per le /ruote/. L'/attributo/ /persone/ è visibile all'esterno e si può cambiare: è /accessibile in lettura e scrittura/; /ruote/ no.

Ruby però, in certe cose è davvero strano ed è nella sua natura esserlo. In Ruby /tutto è un oggetto/.

Non vorrei complicarvi la vita troppo, e la faccio breve con un esempio:

#+begin_src ruby

irb(main):017:0> Auto.instance_variables
=> [:@persone]
irb(main):018:0> Automobile.instance_variables
=> [:@ruote, :@persone]
irb(main):019:0> 

#+end_src

Ho invocato il metodo /instance_variables/ (che mi elenca dentro un array le variabili di istanza di un oggetto) sull'oggetto /Auto/ e sulla classe /Automobile/ e... /Auto/ ha *una* variabile di istanza mentre Automobile ne ha due.
Automobile ha due variabili di istanza? Finora vi ho detto che Automobile non era una /istanza/ ma una /classe/! Vi ho perso in giro? No, non l'ho fatto ma non sono stato preciso.
In Ruby, tutto è un oggetto, anche le /classi/. Questo porta ad interessanti implicazioni e possibilità del linguaggio che però vanno oltre lo scopo di questo piccolo corso.

Sappiate questo: se vogliamo utilizzare una variabile di istanza dentro una istanza dobbiamo scriverla in un altro modo.

#+begin_src ruby

class Automobile  
  
  attr_reader :ruote
  attr_accessor :persone

  def initialize
    @ruote = 4
  end
 
end

#+end_src

Ho aggiunto /attr_reader/ ed un metodo importantissimo: /initialize/.
Il metodo /inizialize/ viene invocato automaticamente da Ruby quando usiamo il metodo /costruttore/ /new/. Il nome stesso spiega cosa fa: /inizializza l'istanza/; cioè fa qualcosa mentre l'oggetto è preparato per essere usato.
Le variabili di istanza di un oggetto devono essere definite e dichiarate qui dentro se le vogliamo avere disponibili alla creazione.
La dichiarazione /attr_reader :ruote/ dice che la variabile di istanza /@ruote/ sarà solo disponibile in lettura.

Questi i dichiaratori di accesso delle variabili di istanza:

+ *attr_reader*   accesso in sola lettura
+ *attr_writer*   accesso in sola scrittura
+ *attr_accessor* accesso in lettura e scrittura

Questi dichiaratori, sono dei metodi di /convenienza/ se non usassi /attr_accessor/ dovrei scrivere così:

#+begin_src ruby

class Automobile  
  
  def initialize
    @ruote = 4
  end

  def persone
    @persone
  end

  def persone=(numero)
    @persone = numero
  end

  def ruote
    @ruote
  end
 
end

#+end_src

Come vedete ho scritto di più di prima ed il codice è meno leggibile e più complicato.
Ruby ha molti /metodi di convenienza/ (detti /helpers/) quindi usateli.

Cerchiamo di migliorare la nostra Automobile. In fondo, scusate cosa è una Automobile? È un veicolo a motore... Invece un veicolo a motore non è un generico veicolo?
Un'altra cosa interessante dei linguaggi di programmazione orientati agli oggetti è che supportano l'/ereditarietà/.
Avete presente voi ed i vostri genitori? A chi assomigliate? Da chi avete /ereditato/ il naso o gli occhi?

Partendo da un generico /Veicolo/ andiamo verso un /Veicolo a motore/ e poi ad una /Automobile/. \\

+ *Veicolo -> VeicoloAMotore -> Automobile* \\

Scrivete e salvate questo file come /automobile.rb/.

#+begin_src ruby :tangle source/automobile.rb :noweb yes

class Veicolo
end

class VeicoloAMotore < Veicolo

  attr_reader :motore

  def initialize
    @motore = true
  end
  
end

class VeicoloARuoteConMotore < VeicoloAMotore

  attr_reader :ruote
  
  def initialize(numero_ruote = 4)
    super()
    @ruote = numero_ruote
  end

end

class Automobile < VeicoloARuoteConMotore

  attr_accessor :persone
  
  def initialize
    super(4)
    @persone = 0
  end

end

Auto = Automobile.new

Auto.persone = 5

puts "Auto ha il motore: " + (Auto.motore ? "si" : "no")
puts "Ospita quante persone? " + Auto.persone.to_s
puts "Quante ruote? " + Auto.ruote.to_s
puts
puts "Variabili di istanza sono:"
puts Auto.instance_variables

#+end_src

Se lo fate girare:

#+begin_src sh

➜  source  ruby automobile.rb
Auto ha il motore: si
Ospita quante persone? 5
Quante ruote? 4

Variabili di istanza sono:
@motore
@ruote
@persone
➜  source  

#+end_src

Abbiamo creato la nostra prima gerarchia di /classi/. \\

Come vedete: *Veicolo -> VeicoloAMotore -> VeicoloARuoteConMotore -> Automobile*. \\

Ogni classe ha un /initialize/ che noi dovremmo richiamare nella /classe derivata/ per essere sicuri che il /genitore/ sia /inizializzato/ a dovere. Questo si fa con /super/.
Il metodo /super/ si assicura di richiamare il metodo /inizialize/ del padre, infatti noi dobbiamo scriverlo e passargli eventuali parametri.
Il suo funzionamento è /abbastanza magico/ nel senso che i parametri dell'/initialize/ del figlio vengo passati automaticamente a /super/. Per questo motivo nella classe /VeicoloARuoteConMotore/ è scritto /super()/, per evitare che a /inizialize/ del genitore venga passato un parametro che non è richiesto.
Questo sarebbe stato l'errore:

#+begin_src sh

➜  source  ruby automobile.rb
automobile.rb:8:in `initialize': wrong number of arguments (1 for 0) (ArgumentError)
	from automobile.rb:19:in `initialize'
	from automobile.rb:30:in `initialize'
	from automobile.rb:36:in `new'
	from automobile.rb:36:in `<main>'
➜  source 

#+end_src 

Dimenticavo, come forse avete notato il metodo /initialize/ della classe /VeicoloARuoteConMotore/ è così: /def initialize(numero_ruote = 4)/. In Ruby i parametri possono avere dei valori già impostati (di /default/) e ciò permette di ometterli quando si invoca un metodo. Non abusate di questa /facilitazione/ può essere molto pericolosa.

So di essere stato /contorto/ ma non è semplice da spiegare. Dovete riflettere bene su questo e cercare di capire.
Ruby ha, come già detto altre volte, delle cose che sembrano a prima vista /strane/, ma vedrete che invece sono la sua /forza/.


Cambiamo le classi però, che così non vanno tanto bene:

#+begin_src ruby :tangle source/automobile2.rb :noweb yes

class Veicolo
end

class VeicoloAMotore < Veicolo

  @@motore = true

  def motore
    @@motore
  end
  
end

class VeicoloARuoteConMotore < VeicoloAMotore

  def initialize(numero_ruote = 4)
    @@ruote = numero_ruote
  end

  def ruote
    @@ruote
  end

end

class Automobile < VeicoloARuoteConMotore

  attr_accessor :persone
  
  def initialize
    super(4)
    @persone = 0
  end

end

Auto = Automobile.new

Auto.persone = 5

puts "Auto ha il motore: " + (Auto.motore ? "si" : "no")
puts "Ospita quante persone? " + Auto.persone.to_s
puts "Quante ruote? " + Auto.ruote.to_s
puts
puts "Variabili di istanza sono:"
puts Auto.instance_variables

#+end_src

Ho scritto delle variabili con due /@/ (/@@/).
Queste sono /variabili di classe/ e si propagano per tutta la gerarchia degli oggetti. La differenza tra le /class variables/ e le /instance variables/ è che le seconde nelle istanze figlie sono delle copie, la prime le stesse.

Esempio: due bambini comprano due cacciaviti sonici del Doctor Who, oppure ne comprano uno solo e se lo passano.
Nel primo caso, se uno si rompe, è solo quel bambino a piangere. Nel secondo piangono tutti e due.

Chiaro?

Classi ne abbiamo molte in Ruby, già di suo. /Array/ è una classe, /Fixnum/ un'altra, /String/. Abbiamo poi una classe /Time/ per gestire il tempo o /Hash/ che è importantissima.
Ce ne sono davvero tante:

+ La documentazione base: http://www.ruby-doc.org/core-2.1.3/
+ La documentazione della libreria: http://www.ruby-doc.org/stdlib-2.1.3/

Ruby ha una libreria molto estesa per fare davvero molte cose.
Oltre alla sua, ha un sistema di gestione delle librerie che si chiama: /RubyGems/, https://rubygems.org/; dove sono reperibili migliaia di ulteriori librerie.
Oltre a questo ne scriverete anche di vostre, no?

