test.html

<div id="outline-container-sec-3-5-2" class="outline-4">
<h4 id="sec-3-5-2"><span class="section-number-4">3.5.2</span> Le classi (non quelle della scuola, o forse si?)</h4>
<div class="outline-text-4" id="text-3-5-2">
<p>
Cominciamo a vedere le <i>classi</i>, questi <i>oggetti</i> misteriosi. Non ha caso ho detto <i>classi</i> e <i>oggetti</i>.
</p>

<p>
Ruby è un <i>linguaggio di programmazione Object Oriented</i>, l'ho già detto prima. Ricordate?
</p>

<p>
Vuol dire: <i>linguaggio di programmazione orientato agli oggetti</i>. 
Che vuol dire: <i>un linguaggio di programmazione in cui gli oggetti sono la cosa più importante</i>.
Che vuol dire: <i>un linguaggio di programmazione dove si usano delle descrizioni degli oggetti, chiamate classi, per modellare il dominio del problema</i>.
Continuo? - Sempre più difficile, Signore e Signori! - <br >
</p>

<p>
Facciamola semplice e partiamo da qualche esempio.
</p>

<p>
Intorno a noi ci sono tante cose, pensateci bene. Imparare a programmare i computer <i>fa bene</i> anche perché insegna a ragionare e ad affrontare i problemi in maniera <i>analitica</i>.
Insomma, intorno a noi abbiamo tante cose: viviamo dentro delle <i>case</i>, guardiamo il <i>televisore</i>, ascoltiamo la musica col <i>giradischi</i> (che voi forse non sapete nemmeno cosa sia, ma io sono vecchio e lo so), camminiamo con le scarpe, ci mettiamo i <i>pantaloni</i> e ci sediamo sulla <i>sedia</i>, leggiamo <i>libri</i>&#x2026; Potrei continuare all'infinito.
</p>

<p>
Intorno a noi ci sono oggetti. Questi oggetti servono a qualcosa, fanno qualcosa o subiscono qualcosa.
Gli oggetti possono essere formati da altri oggetti, ricordate quando prima ho detto dei mattoncini Lego<sup>(tm)</sup>?
Il Meccano<sup>(tm)</sup>, quando ero piccolo c'era questo, oggetti in metallo, viti e bulloni, motori elettrici&#x2026;
Ci ho costruito tante cose.
Chi di voi è uno <i>smontatore</i> professionista? Io da piccolo smontavo praticamente tutto: volevo vedere come funzionasse dentro.
</p>

<p>
Con i linguaggi di programmazione avete gli <i>strumenti per scatenare la curiosità</i>, se volete.
Ritorniamo ai nostri oggetti ed alla definizione di un <i>linguaggio di programmazione orientato agli oggetti</i> (come è Ruby, che però non è solo questo): <br >
</p>

<p>
<b>è un linguaggio che permette di descrivere il <i>dominio del problema</i> definendo gli oggetti che lo compongono e le loro interazioni</b> <br >
</p>

<p>
Il <i>dominio del problema</i> significa solo <i>quello che volete fare</i>, perché usare delle parole difficili? Primo è perché vogliamo imparare le <i>parole giuste</i>, secondo perché, in realtà, c'è di più di <i>quello che volete fare</i>.
Per adesso però, va bene così.
</p>

<p>
Per <i>fare quello che volete fare</i> dovete analizzare tutti i piccoli pezzi che compongono o servono per <i>fare quello che volete fare</i>. Tra un po' comincio con gli scioglilingua&#x2026; <br >
</p>

<p>
Ma cosa <i>volete fare?</i>. <br >
</p>

<p>
Pensate alla macchina, che poi si dice <i>automobile</i>&#x2026; Anche se è una <i>macchina</i>. Elenchiamo i pezzi che la compongono: sedili, sportelli, volante, ruote, vetri, ingranaggi, motore, viti, bulloni e <i>chi più ne ha ne metta</i>&#x2026;
</p>

<p>
Ho puntualizzato che l'<i>automobile</i> è una <i>macchina</i> e vedrete che questa affermazione banale, così semplice, ha una sua ragione di esistere.
</p>

<p>
Cominciamo a descrivere meglio una automobile e facciamolo in Ruby.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">class</span> <span class="org-type">Automobile</span>

<span class="org-keyword">end</span>
</pre>
</div>

<p>
Abbiamo definito una <i>classe</i> e cioè una <i>classe di oggetti</i>. La <i>classe</i> (<i>class</i>) è la descrizione dell'oggetto con le sue <i>proprietà</i> o <i>attributi</i> (gli oggetti che la compongono) ed i <i>metodi</i> che sono il come interagisce col mondo esterno, cosa fa o cosa subisce.
</p>

<p>
L'automobile ha le ruote prima di tutto:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">class</span> <span class="org-type">Automobile</span>

  <span class="org-variable-name">@ruote</span> = 4

<span class="org-keyword">end</span>
</pre>
</div>

<p>
<i>@ruote</i> si chiama <i>variabile di istanza</i>. È una <i>variabile</i> come le abbiamo già viste, ma vive dentro un <i>oggetto</i> che sarebbe una <i>istanza di una classe</i>. <br >
Le <i>variabili di istanza</i> cominciano per <i>@</i>.
</p>

<p>
Ricapitoliamo:
</p>

<ul class="org-ul">
<li>la <i>classe</i> descrive l'<i>oggetto</i> nella sua forma e funzione
</li>
<li>l'<i>istanza</i> rende <i>viva</i> la <i>classe</i> come <i>oggetto</i>
</li>
</ul>

<p>
Una <i>variabile di istanza</i> non è ancora un <i>attributo</i>, anche se ancora non sappiamo cosa significhi un <i>attributo</i>.
Per farla semplice, diciamo che una <i>classe</i> ha delle parti nascoste e delle parti visibili, l'<i>automobile</i> ha di visibile la carrozzeria ma non il motore. Per vedere quello dovete aprire il cofano, guardare dentro.
È la stessa cosa, una classe in Ruby ha delle parti nascoste e delle parti visibili: <i>@ruote</i> è ancora nascosta.
Direi anche di lasciarla nascosta, mica vogliamo che mentre siamo in corsa a duecento chilometri all'ora verso una curva ci cambino il numero delle ruote? Se di punto in bianco diventano tre? O due? o Niente?
</p>

<p>
Lasciamola nascosta <i>che è meglio</i> (citazione dai Puffi).
Però, il numero delle persone potrebbe cambiare no?
</p>

<p>
Aggungiamo le persone, le auto portano le persone:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">class</span> <span class="org-type">Automobile</span>

  <span class="org-variable-name">@ruote</span> = 4
  <span class="org-builtin">attr_accessor</span> <span class="org-constant">:persone</span>

<span class="org-keyword">end</span>
</pre>
</div>

<p>
Ora noi abbiamo che <i>persone</i> è <i>accessibile</i> e si vede dall'esterno dell'oggetto.
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:001</span>:0&gt; <span class="org-keyword">class</span> <span class="org-type">Automobile</span>
irb(main)<span class="org-constant">:002</span>:1&gt; <span class="org-variable-name">@ruote</span> = 4
irb(main)<span class="org-constant">:003</span>:1&gt; <span class="org-builtin">attr_accessor</span> <span class="org-constant">:persone</span>
irb(main)<span class="org-constant">:004</span>:1&gt; <span class="org-keyword">end</span>
=&gt; <span class="org-variable-name">nil</span>
irb(main)<span class="org-constant">:005</span>:0&gt; <span class="org-type">Auto</span> = <span class="org-type">Automobile</span>.new
=&gt; <span class="org-comment-delimiter">#</span><span class="org-comment">&lt;Automobile:0x007f8995f94a90&gt;</span>
irb(main)<span class="org-constant">:006</span>:0&gt; <span class="org-type">Auto</span>.persone = 4
=&gt; 4
irb(main)<span class="org-constant">:007</span>:0&gt; <span class="org-type">Auto</span>.persone
=&gt; 4
irb(main)<span class="org-constant">:008</span>:0&gt;
</pre>
</div>

<p>
Ho rifatto il codice dentro <i>irb</i> per farvi vedere? Capito?
L'<i>attributo</i> <i>persone</i> è visibile dal'esterno dell'oggetto. Analizziamo il codice meglio.
</p>

<p>
Dopo aver definito la classe <i>Automobile</i> ho costruito l'oggetto <i>Automobile</i> con il metodo <i>new</i> (<i>nuovo</i>). Si dice che <i>ho istanziato la classe</i>.
L'<i>oggetto</i> appena creato l'ho immagazzinato dentro una variabile che ho chiamato <i>Auto</i>.
</p>

<p>
Cominciamo a capire cosa è la <i>classe</i>? La <i>classe</i> è come il <i>progetto</i> di un oggetto, che poi va costruito. Infatti nel gergo dei linguaggi di programmazione orientati agli oggetti, metodi come <i>new</i> sono chiamati <i>costruttori</i> (anche se con Ruby è impreciso e sarebbe meglio chiamarlo <i>metodo istanziatore</i>).
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:005</span>:0&gt; <span class="org-type">Auto</span> = <span class="org-type">Automobile</span>.new
=&gt; <span class="org-comment-delimiter">#</span><span class="org-comment">&lt;Automobile:0x007f8995f94a90&gt;</span>
</pre>
</div>

<p>
Quello che vedete sotto ad <i>Auto = Automobile.new</i> è il nome dell'istanza della classe <i>Automobile</i> che ho appena creato. Il nome vero, ma noi ci riferiremo a questa con <i>Auto</i>.
</p>

<p>
Adesso cerco di cambiare il numero delle persone e quello delle ruote:
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:009</span>:0&gt; <span class="org-type">Auto</span>.persone
=&gt; 4
irb(main)<span class="org-constant">:010</span>:0&gt; <span class="org-type">Auto</span>.persone = 5
=&gt; 5
irb(main)<span class="org-constant">:011</span>:0&gt; <span class="org-type">Auto</span>.ruote = 2
<span class="org-type">NoMethodError</span>: undefined method <span class="org-string">`ruote=' for #&lt;Automobile:0x007f8995f94a90 @persone=5&gt;</span>
<span class="org-string">        from (irb):11</span>
<span class="org-string">        from /home/nissl/bin/ruby-2.1/bin/irb:11:in `</span>&lt;main&gt;<span class="org-string">'</span>
<span class="org-string">irb(main):012:0&gt;</span>
</pre>
</div>

<p>
Sono riuscito a farlo per le <i>persone</i> ma non per le <i>ruote</i>. L'<i>attributo</i> <i>persone</i> è visibile all'esterno e si può cambiare: è <i>accessibile in lettura e scrittura</i>; <i>ruote</i> no.
</p>

<p>
Ruby però, in certe cose è davvero strano ed è nella sua natura esserlo. In Ruby <i>tutto è un oggetto</i>.
</p>

<p>
Non vorrei complicarvi la vita troppo, e la faccio breve con un esempio:
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:017</span>:0&gt; <span class="org-type">Auto</span>.instance_variables
=&gt; [<span class="org-constant">:@persone</span>]
irb(main)<span class="org-constant">:018</span>:0&gt; <span class="org-type">Automobile</span>.instance_variables
=&gt; [<span class="org-constant">:@ruote</span>, <span class="org-constant">:@persone</span>]
irb(main)<span class="org-constant">:019</span>:0&gt;
</pre>
</div>

<p>
Ho invocato il metodo <i>instance_variables</i> (che mi elenca dentro un array le variabili di istanza di un oggetto) sull'oggetto <i>Auto</i> e sulla classe <i>Automobile</i> e&#x2026; <i>Auto</i> ha <b>una</b> variabile di istanza mentre Automobile ne ha due.
Automobile ha due variabili di istanza? Finora vi ho detto che Automobile non era una <i>istanza</i> ma una <i>classe</i>! Vi ho perso in giro? No, non l'ho fatto ma non sono stato preciso.
In Ruby, tutto è un oggetto, anche le <i>classi</i>. Questo porta ad interessanti implicazioni e possibilità del linguaggio che però vanno oltre lo scopo di questo piccolo corso.
</p>

<p>
Sappiate questo: se vogliamo utilizzare una variabile di istanza dentro una istanza dobbiamo scriverla in un altro modo.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">class</span> <span class="org-type">Automobile</span>  

  <span class="org-builtin">attr_reader</span> <span class="org-constant">:ruote</span>
  <span class="org-builtin">attr_accessor</span> <span class="org-constant">:persone</span>

  <span class="org-keyword">def</span> <span class="org-function-name">initialize</span>
    <span class="org-variable-name">@ruote</span> = 4
  <span class="org-keyword">end</span>

<span class="org-keyword">end</span>
</pre>
</div>

<p>
Ho aggiunto <i>attr_reader</i> ed un metodo importantissimo: <i>initialize</i>.
Il metodo <i>inizialize</i> viene invocato automaticamente da Ruby quando usiamo il metodo <i>costruttore</i> <i>new</i>. Il nome stesso spiega cosa fa: <i>inizializza l'istanza</i>; cioè fa qualcosa mentre l'oggetto è preparato per essere usato.
Le variabili di istanza di un oggetto devono essere definite e dichiarate qui dentro se le vogliamo avere disponibili alla creazione.
La dichiarazione <i>attr_reader :ruote</i> dice che la variabile di istanza <i>@ruote</i> sarà solo disponibile in lettura.
</p>

<p>
Questi i dichiaratori di accesso delle variabili di istanza:
</p>

<ul class="org-ul">
<li><b>attr_reader</b>, accesso in sola lettura
</li>
<li><b>attr_writer</b>, accesso in sola scrittura
</li>
<li><b>attr_accessor</b>, accesso in lettura e scrittura
</li>
</ul>

<p>
Questi dichiaratori, sono dei metodi di <i>convenienza</i> se non usassi <i>attr_accessor</i> dovrei scrivere così:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">class</span> <span class="org-type">Automobile</span>  

  <span class="org-keyword">def</span> <span class="org-function-name">initialize</span>
    <span class="org-variable-name">@ruote</span> = 4
  <span class="org-keyword">end</span>

  <span class="org-keyword">def</span> <span class="org-function-name">persone</span>
    <span class="org-variable-name">@persone</span>
  <span class="org-keyword">end</span>

  <span class="org-keyword">def</span> <span class="org-function-name">persone=</span>(numero)
    <span class="org-variable-name">@persone</span> = numero
  <span class="org-keyword">end</span>

  <span class="org-keyword">def</span> <span class="org-function-name">ruote</span>
    <span class="org-variable-name">@ruote</span>
  <span class="org-keyword">end</span>

<span class="org-keyword">end</span>
</pre>
</div>

<p>
Come vedete ho scritto di più di prima ed il codice è meno leggibile e più complicato.
Ruby ha molti <i>metodi di convenienza</i> (detti <i>helpers</i>) quindi usateli.
</p>

<p>
Cerchiamo di migliorare la nostra Automobile. In fondo, scusate cosa è una Automobile? È un veicolo a motore&#x2026; Invece un veicolo a motore non è un generico veicolo?
Un'altra cosa interessante dei linguaggi di programmazione orientati agli oggetti è che supportano l'<i>ereditarietà</i>.
Avete presente voi ed i vostri genitori? A chi assomigliate? Da chi avete <i>ereditato</i> il naso o gli occhi?
</p>

<p>
Partendo da un generico <i>Veicolo</i> andiamo verso un <i>Veicolo a motore</i> e poi ad una <i>Automobile</i>. <br >
</p>

<p>
<b>Veicolo -&gt; VeicoloAMotore -&gt; Automobile</b> <br >
</p>

<p>
Scrivete e salvate questo file come <i>automobile.rb</i>.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">class</span> <span class="org-type">Veicolo</span>
<span class="org-keyword">end</span>

<span class="org-keyword">class</span> <span class="org-type">VeicoloAMotore</span> &lt; <span class="org-type">Veicolo</span>

  <span class="org-builtin">attr_reader</span> <span class="org-constant">:motore</span>

  <span class="org-keyword">def</span> <span class="org-function-name">initialize</span>
    <span class="org-variable-name">@motore</span> = <span class="org-variable-name">true</span>
  <span class="org-keyword">end</span>

<span class="org-keyword">end</span>

<span class="org-keyword">class</span> <span class="org-type">VeicoloARuoteConMotore</span> &lt; <span class="org-type">VeicoloAMotore</span>

  <span class="org-builtin">attr_reader</span> <span class="org-constant">:ruote</span>

  <span class="org-keyword">def</span> <span class="org-function-name">initialize</span>(numero_ruote = 4)
    <span class="org-keyword">super</span>()
    <span class="org-variable-name">@ruote</span> = numero_ruote
  <span class="org-keyword">end</span>

<span class="org-keyword">end</span>

<span class="org-keyword">class</span> <span class="org-type">Automobile</span> &lt; <span class="org-type">VeicoloARuoteConMotore</span>

  <span class="org-builtin">attr_accessor</span> <span class="org-constant">:persone</span>

  <span class="org-keyword">def</span> <span class="org-function-name">initialize</span>
    <span class="org-keyword">super</span>(4)
    <span class="org-variable-name">@persone</span> = 0
  <span class="org-keyword">end</span>

<span class="org-keyword">end</span>

<span class="org-type">Auto</span> = <span class="org-type">Automobile</span>.new

<span class="org-type">Auto</span>.persone = 5

<span class="org-builtin">puts</span> <span class="org-string">"Auto ha il motore: "</span> + (<span class="org-type">Auto</span>.motore ? <span class="org-string">"si"</span> : <span class="org-string">"no"</span>)
<span class="org-builtin">puts</span> <span class="org-string">"Ospita quante persone? "</span> + <span class="org-type">Auto</span>.persone.to_s
<span class="org-builtin">puts</span> <span class="org-string">"Quante ruote? "</span> + <span class="org-type">Auto</span>.ruote.to_s
puts
<span class="org-builtin">puts</span> <span class="org-string">"Variabili di istanza sono:"</span>
<span class="org-builtin">puts</span> <span class="org-type">Auto</span>.instance_variables
</pre>
</div>

<p>
Se lo fate girare:
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  source  ruby automobile.rb
Auto ha il motore: si
Ospita quante persone? 5
Quante ruote? 4

Variabili di istanza sono:
@motore
@ruote
@persone
&#10140;  source
</pre>
</div>

<p>
Abbiamo creato la nostra prima gerarchia di <i>classi</i>. <br >
</p>

<p>
Come vedete: <b>Veicolo -&gt; VeicoloAMotore -&gt; VeicoloARuoteConMotore -&gt; Automobile</b>. <br >
</p>

<p>
Ogni classe ha un <i>initialize</i> che noi dovremmo richiamare nella <i>classe derivata</i> per essere sicuri che il <i>genitore</i> sia <i>inizializzato</i> a dovere. Questo si fa con <i>super</i>.
Il metodo <i>super</i> si assicura di richiamare il metodo <i>inizialize</i> del padre, infatti noi dobbiamo scriverlo e passargli eventuali parametri.
Il suo funzionamento è <i>abbastanza magico</i> nel senso che i parametri dell'<i>initialize</i> del figlio vengo passati automaticamente a <i>super</i>. Per questo motivo nella classe <i>VeicoloARuoteConMotore</i> è scritto <i>super()</i>, per evitare che a <i>inizialize</i> del genitore venga passato un parametro che non è richiesto.
Questo sarebbe stato l'errore:
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  source  ruby automobile.rb
automobile.rb:8:in <span class="org-sh-quoted-exec">`initialize': wrong number of arguments (1 for 0) (ArgumentError)</span>
<span class="org-sh-quoted-exec">        from automobile.rb:19:in `</span>initialize<span class="org-string">'</span>
<span class="org-string">        from automobile.rb:30:in `initialize'</span>
        from automobile.rb:36:in <span class="org-sh-quoted-exec">`new'</span>
<span class="org-sh-quoted-exec">        from automobile.rb:36:in `</span>&lt;main&gt;<span class="org-string">'</span>
<span class="org-string">&#10140;  source</span>
</pre>
</div>

<p>
Dimenticavo, come forse avete notato il metodo <i>initialize</i> della classe <i>VeicoloARuoteConMotore</i> è così: <i>def initialize(numero_ruote = 4)</i>. In Ruby i parametri possono avere dei valori già impostati (di <i>default</i>) e ciò permette di ometterli quando si invoca un metodo. Non abusate di questa <i>facilitazione</i> può essere molto pericolosa.
</p>

<p>
So di essere stato <i>contorto</i> ma non è semplice da spiegare. Dovete riflettere bene su questo e cercare di capire.
Ruby ha, come già detto altre volte, delle cose che sembrano a prima vista <i>strane</i>, ma vedrete che invece sono la sua <i>forza</i>.
</p>


<p>
Cambiamo le classi però, che così non vanno tanto bene:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">class</span> <span class="org-type">Veicolo</span>
<span class="org-keyword">end</span>

<span class="org-keyword">class</span> <span class="org-type">VeicoloAMotore</span> &lt; <span class="org-type">Veicolo</span>

  <span class="org-variable-name">@@motore</span> = <span class="org-variable-name">true</span>

  <span class="org-keyword">def</span> <span class="org-function-name">motore</span>
    <span class="org-variable-name">@@motore</span>
  <span class="org-keyword">end</span>

<span class="org-keyword">end</span>

<span class="org-keyword">class</span> <span class="org-type">VeicoloARuoteConMotore</span> &lt; <span class="org-type">VeicoloAMotore</span>

  <span class="org-keyword">def</span> <span class="org-function-name">initialize</span>(numero_ruote = 4)
    <span class="org-variable-name">@@ruote</span> = numero_ruote
  <span class="org-keyword">end</span>

  <span class="org-keyword">def</span> <span class="org-function-name">ruote</span>
    <span class="org-variable-name">@@ruote</span>
  <span class="org-keyword">end</span>

<span class="org-keyword">end</span>

<span class="org-keyword">class</span> <span class="org-type">Automobile</span> &lt; <span class="org-type">VeicoloARuoteConMotore</span>

  <span class="org-builtin">attr_accessor</span> <span class="org-constant">:persone</span>

  <span class="org-keyword">def</span> <span class="org-function-name">initialize</span>
    <span class="org-keyword">super</span>(4)
    <span class="org-variable-name">@persone</span> = 0
  <span class="org-keyword">end</span>

<span class="org-keyword">end</span>

<span class="org-type">Auto</span> = <span class="org-type">Automobile</span>.new

<span class="org-type">Auto</span>.persone = 5

<span class="org-builtin">puts</span> <span class="org-string">"Auto ha il motore: "</span> + (<span class="org-type">Auto</span>.motore ? <span class="org-string">"si"</span> : <span class="org-string">"no"</span>)
<span class="org-builtin">puts</span> <span class="org-string">"Ospita quante persone? "</span> + <span class="org-type">Auto</span>.persone.to_s
<span class="org-builtin">puts</span> <span class="org-string">"Quante ruote? "</span> + <span class="org-type">Auto</span>.ruote.to_s
puts
<span class="org-builtin">puts</span> <span class="org-string">"Variabili di istanza sono:"</span>
<span class="org-builtin">puts</span> <span class="org-type">Auto</span>.instance_variables
</pre>
</div>

<p>
Ho scritto delle variabili con due <i>@</i> (<i>@@</i>).
Queste sono <i>variabili di classe</i> e si propagano per tutta la gerarchia degli oggetti. La differenza tra le <i>class variables</i> e le <i>instance variables</i> è che le seconde nelle istanze figlie sono delle copie, la prime le stesse.
</p>

<p>
Esempio: due bambini comprano due cacciaviti sonici del Doctor Who, oppure ne comprano uno solo e se lo passano.
Nel primo caso, se uno si rompe, è solo quel bambino a piangere. Nel secondo piangono tutti e due.
</p>

<p>
Chiaro?
</p>

<p>
Classi ne abbiamo molte in Ruby, già di suo. <i>Array</i> è una classe, <i>Fixnum</i> un'altra, <i>String</i>. Abbiamo poi una classe <i>Time</i> per gestire il tempo o <i>Hash</i> che è importantissima.
Ce ne sono davvero tante:
</p>

<ul class="org-ul">
<li>La documentazione base: <a href="http://www.ruby-doc.org/core-2.1.3/">http://www.ruby-doc.org/core-2.1.3/</a>
</li>
<li>La documentazione della libreria: <a href="http://www.ruby-doc.org/stdlib-2.1.3/">http://www.ruby-doc.org/stdlib-2.1.3/</a>
</li>
</ul>

<p>
Ruby ha una libreria molto estesa per fare davvero molte cose.
Oltre alla sua, ha un sistema di gestione delle librerie che si chiama: <i>RubyGems</i>, <a href="https://rubygems.org/">https://rubygems.org/</a>; dove sono reperibili migliaia di ulteriori librerie.
Oltre a questo ne scriverete anche di vostre, no?
</p>
</div>
</div>
