test.org
*** Blocks e Procs, che non è il Rock'n'Roll ma ci si avvicina.

Ruby ha delle fantastiche caratteristiche, questa è una di quelle.
Li abbiamo già visti, nei metodi /each/ o /map/ che abbiamo usato nei cicli. Possiamo scrivere metodi come quelli.
/Blocks/, /Procs/, /Closure/ e /lambda/, sono sostanzialmente simili e scritti in maniera simile. Le differenze a volte sono solo /di fino/ come si dice.

Vediamo come si scrive una /Proc/:

#+begin_src ruby

ciao = Proc.new do
  puts "ciao"
end 

ciao.call
ciao.call
ciao.call

#+end_src

Questo scriverà tre volte /ciao/.

#+begin_src sh

ciao
ciao
ciao

#+end_src

Una Proc può prendere parametri:

#+begin_src ruby

ciao = Proc.new do |a_chi|
  puts "ciao"
end 

ciao.call('Mondo')
ciao.call('Carlo')
ciao.call('Camilla')

#+end_src

Il suo /output/ sarà:

#+begin_src sh

ciao Mondo
ciao Carlo
ciao Camilla

#+end_src

La cosa fantastica delle /Proc/ è che possiamo passarle come valori dei parametri e restituirle come valori dai metodi. Questo è un concetto complesso che a prima vista sembra non portare benefici ma non è così. È una caratteristi importante che fa di Ruby anche un /linguaggio funzionale/ oltre che /orientato agli oggetti/, pur con alcune limitazioni.

Questo frammento definisce un metodo che prende come parametro una /Proc/:

#+begin_src ruby

ciao = Proc.new do
  "ciao!"
end

buongiorno = Proc.new do
  "buongiorno!"
end

def saluta_con_un(proc)
  puts "Ti saluto con un #{proc.call}"
end

saluta_con_un(ciao)
saluta_con_un(buongiorno)

#+end_src

In questo esempio ho usato un nuovo modo per concatenare le stringhe detto /interpolazione/. Funziona con le stringhe tra doppi apici (quelle in apici singoli non vanno bene) e praticamente il codice compreso tra /#{...}/ viene valutato ed il risultato sostituito in quel punto. Ci permette di costruire stringhe con elementi da valutare lì per lì.

Il suo /output/ sarà:

#+begin_src sh

Ti saluto con un ciao!
Ti saluto con un buongiorno!

#+end_src

La /Proc/ è stata passata come parametro ed invocata, questo perché la /Proc/ è un valore, è un oggetto a tutti gli effetti. Un oggetto che contiene del codice.

#+begin_src ruby

ciao = lambda do
  "ciao!"
end

buongiorno = Proc.new do
  "buongiorno!"
end

def saluta_con_un(proc)
  puts "Ti saluto con un #{proc.call}"
end

saluta_con_un(ciao)
saluta_con_un(buongiorno)

#+end_src

Qui ho usato una /lambda/, /Proc/ e /lambda/ sono molto simili, la sintassi è praticamente identica. Ci sono differenze molto sottili di funzionamento che però vanno oltre lo scopo di questo minicorso.

Per finire un esempio di un metodo che prende come parametro un /Block/:

#+begin_src ruby

def saluta(persone, &saluto)
  persone.each { |nome|
    salut = yield saluto
    puts "#{ nome } #{ salut }"
  }
end

saluta(['Marco', 'Giovanni', 'Benedetta']) {
  "ciao"
}

#+end_src

Scriverà:

#+begin_src sh

Marco ciao
Giovanni ciao
Benedetta ciao

#+end_src

Queste possibilità di Ruby sono solo state scalfite. Sono molto potenti.

