test.html

<div id="outline-container-sec-3-5-3" class="outline-4">
<h4 id="sec-3-5-3"><span class="section-number-4">3.5.3</span> Blocks e Procs, che non è il Rock'n'Roll ma ci si avvicina.</h4>
<div class="outline-text-4" id="text-3-5-3">
<p>
Ruby ha delle fantastiche caratteristiche, questa è una di quelle.
Li abbiamo già visti, nei metodi <i>each</i> o <i>map</i> che abbiamo usato nei cicli. Possiamo scrivere metodi come quelli.
<i>Blocks</i>, <i>Procs</i>, <i>Closure</i> e <i>lambda</i>, sono sostanzialmente simili e scritti in maniera simile. Le differenze a volte sono solo <i>di fino</i> come si dice.
</p>

<p>
Vediamo come si scrive una <i>Proc</i>:
</p>

<div class="org-src-container">

<pre class="src src-ruby">ciao = <span class="org-type">Proc</span>.new <span class="org-keyword">do</span>
  <span class="org-builtin">puts</span> <span class="org-string">"ciao"</span>
<span class="org-keyword">end</span> 

ciao.call
ciao.call
ciao.call
</pre>
</div>

<p>
Questo scriverà tre volte <i>ciao</i>.
</p>

<div class="org-src-container">

<pre class="src src-sh">ciao
ciao
ciao
</pre>
</div>

<p>
Una Proc può prendere parametri:
</p>

<div class="org-src-container">

<pre class="src src-ruby">ciao = <span class="org-type">Proc</span>.new <span class="org-keyword">do</span> |a_chi|
  <span class="org-builtin">puts</span> <span class="org-string">"ciao"</span>
<span class="org-keyword">end</span> 

ciao.call(<span class="org-string">'Mondo'</span>)
ciao.call(<span class="org-string">'Carlo'</span>)
ciao.call(<span class="org-string">'Camilla'</span>)
</pre>
</div>

<p>
Il suo <i>output</i> sarà:
</p>

<div class="org-src-container">

<pre class="src src-sh">ciao Mondo
ciao Carlo
ciao Camilla
</pre>
</div>

<p>
La cosa fantastica delle <i>Proc</i> è che possiamo passarle come valori dei parametri e restituirle come valori dai metodi. Questo è un concetto complesso che a prima vista sembra non portare benefici ma non è così. È una caratteristi importante che fa di Ruby anche un <i>linguaggio funzionale</i> oltre che <i>orientato agli oggetti</i>, pur con alcune limitazioni.
</p>

<p>
Questo frammento definisce un metodo che prende come parametro una <i>Proc</i>:
</p>

<div class="org-src-container">

<pre class="src src-ruby">ciao = <span class="org-type">Proc</span>.new <span class="org-keyword">do</span>
  <span class="org-string">"ciao!"</span>
<span class="org-keyword">end</span>

buongiorno = <span class="org-type">Proc</span>.new <span class="org-keyword">do</span>
  <span class="org-string">"buongiorno!"</span>
<span class="org-keyword">end</span>

<span class="org-keyword">def</span> <span class="org-function-name">saluta_con_un</span>(proc)
  <span class="org-builtin">puts</span> <span class="org-string">"Ti saluto con un </span><span class="org-variable-name">#{proc.call}</span><span class="org-string">"</span>
<span class="org-keyword">end</span>

saluta_con_un(ciao)
saluta_con_un(buongiorno)
</pre>
</div>

<p>
In questo esempio ho usato un nuovo modo per concatenare le stringhe detto <i>interpolazione</i>. Funziona con le stringhe tra doppi apici (quelle in apici singoli non vanno bene) e praticamente il codice compreso tra <i>#{&#x2026;}</i> viene valutato ed il risultato sostituito in quel punto. Ci permette di costruire stringhe con elementi da valutare lì per lì.
</p>

<p>
Il suo <i>output</i> sarà:
</p>

<div class="org-src-container">

<pre class="src src-sh">Ti saluto con un ciao!
Ti saluto con un buongiorno!
</pre>
</div>

<p>
La <i>Proc</i> è stata passata come parametro ed invocata, questo perché la <i>Proc</i> è un valore, è un oggetto a tutti gli effetti. Un oggetto che contiene del codice.
</p>

<div class="org-src-container">

<pre class="src src-ruby">ciao = <span class="org-builtin">lambda</span> <span class="org-keyword">do</span>
  <span class="org-string">"ciao!"</span>
<span class="org-keyword">end</span>

buongiorno = <span class="org-type">Proc</span>.new <span class="org-keyword">do</span>
  <span class="org-string">"buongiorno!"</span>
<span class="org-keyword">end</span>

<span class="org-keyword">def</span> <span class="org-function-name">saluta_con_un</span>(proc)
  <span class="org-builtin">puts</span> <span class="org-string">"Ti saluto con un </span><span class="org-variable-name">#{proc.call}</span><span class="org-string">"</span>
<span class="org-keyword">end</span>

saluta_con_un(ciao)
saluta_con_un(buongiorno)
</pre>
</div>

<p>
Qui ho usato una <i>lambda</i>, <i>Proc</i> e <i>lambda</i> sono molto simili, la sintassi è praticamente identica. Ci sono differenze molto sottili di funzionamento che però vanno oltre lo scopo di questo minicorso.
</p>

<p>
Per finire un esempio di un metodo che prende come parametro un <i>Block</i>:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-keyword">def</span> <span class="org-function-name">saluta</span>(persone, &amp;saluto)
  persone.each { |nome|
    salut = <span class="org-keyword">yield</span> saluto
    <span class="org-builtin">puts</span> <span class="org-string">"</span><span class="org-variable-name">#{ nome }</span><span class="org-string"> </span><span class="org-variable-name">#{ salut }</span><span class="org-string">"</span>
  }
<span class="org-keyword">end</span>

saluta([<span class="org-string">'Marco'</span>, <span class="org-string">'Giovanni'</span>, <span class="org-string">'Benedetta'</span>]) {
  <span class="org-string">"ciao"</span>
}
</pre>
</div>

<p>
Scriverà:
</p>

<div class="org-src-container">

<pre class="src src-sh">Marco ciao
Giovanni ciao
Benedetta ciao
</pre>
</div>

<p>
Queste possibilità di Ruby sono solo state scalfite. Sono molto potenti.
</p>
</div>
</div>
