test.org
*** Il mondo esterno

Fino ad adesso non abbiamo fatto altro che stare comodamente in casa, ma ogni tanto bisognerà uscire e parlare con la gente di fuori e magari non dimenticarsi quello che si è fatto.
Uno dei vari modi per uscire all'aperto è leggere e scrivere /file/. 

Lo avete fatto anche voi con il vostro /editor/, avete creato dei /file/ sul disco del vostro computer e li avete letti, eseguiti con Ruby.

Ruby, come molti linguaggi ha la possibilità di /aprire/ file, /scrivere o leggere/ nei o dai file, /chiudere/ i file. Non è un caso che abbia scritto: /aprire/, /leggere o scrivere/, /chiudere/; sono queste le fasi che servono per gestire i /file/.

Per fare questo abbiamo una /classe/ che, ovviamente, si chiama /File/. /File/ non fa solo quello, ha anche altri metodi che servono per esempio per avere informazioni sui /file/ ma anche per gestirne i /percorsi/.

Un /percorso/ serve per ritrovare un file nel disco del computer. Ci sono diverse /nomenclature/ in base al sistema operativo che si sta usando e questo potrebbe rendere un po' complicato il gestirle.

Un /percorso/ è formato da una serie di nomi di /cartelle/ divisi da un separatore (qui è la differenza dei vari sistemi operativi) ed un nome di /file/.

#+begin_src sh

/home/nissl/Documenti/Ruby/il_mio_file.txt

#+end_src
Questo percorso è di tipo /Unix/.

#+begin_src sh

c:\Documenti\Ruby\il_mio_file.txt

#+end_src

Questo si usa con Microsoft Windows^{tm}.

Senza entrare nelle differenze complicate, ne vediamo subito una e cioè la differenza di /separatore/ (/slash/ e /backslash/).
Fortunatamente Ruby, che è nato sui sistemi di tipo /Unix/, considera la forma con la barra normale (/slash/) */* la forma corretta e quindi ragiona in questo modo facendolo fa anche su Windows^{tm}. \\

Quindi:

#+begin_src sh

c:/Documenti/Ruby/il_mio_file.txt

#+end_src

Per Ruby questo è corretto e lui troverà il file. Per il sistema operativo no però e questo potrebbe avere delle conseguenze in certi casi.

Vediamo come si apre un /file/:

#+begin_src ruby

file = File.open('miofile.txt', 'r')

#+end_src

In questo modo, ho aperto un file in /sola lettura/, vuol dire che potrò leggerne il contenuto ma non lo potrò scrivere.

Ci sono vari /parametri di permesso/ per i file e come si può vedere si indicano nel secondo valore dato al metodo mentre il primo è il nome del file.

+ *r* il file è aperto in /sola lettura/ dal suo inizio.
+ *r+* il file è aperto in /lettura e scrittura/ dal suo inizio.
+ *w* il file è aperto in /sola scrittura/ e tronca il file a zero, cioè elimina il contenuto del file o ne crea uno se questo non esiste.
+ *w+* il file è aperto in /lettura e scrittura/ e tronca il file a zero, cioè elimina il contenuto del file o ne crea uno se questo non esiste.
+ *a* il file è aperto in /sola scrittura/ e aggiunge alla fine del file, /appende/.
+ *a+* Il file è aperto in /lettura e scrittura/ e aggiunge alla fine del file, /appende/.

Queste sono le possibilità e l'uso dipende da quello che vogliamo fare con il file. Per esempio, se vogliamo solo leggere un file dobbiamo aprirlo in /sola lettura/ per non rischiare di scriverci qualcosa inavvertitamente.

Esistono altre impostazioni da passare al metodo /open/ o /new/ oltre a queste, ma si rimanda alla documentazione ufficiale.

Ricordate sempre: *i /file/ sono preziosi* e vanno gestiti in maniera adeguata.

Come ho accennato i file devono essere: aperti, letti o scritti, chiusi.

#+begin_src ruby

#apro il file
file = File.open('miofile.txt', 'r')

#leggo tutto il contenuto e lo metto nella variabile contenuto.
# contenuto avrà dentro tutto il testo come stringa (se il file è di testo)
contenuto = file.read

#ho finito di leggerlo e lo chiudo: mai lasciare aperti i file.
file.close

#+end_src

Qui sopra ci sono le fasi. Una cosa molto importante è: *chiudere i file il prima possibile dopo averci lavorato*. \\

Chiudere i file è importante per vari motivi, due di questi:

+ è pericoloso tenere aperto un file, si potrebbe distruggere o alterare
+ i /file/ sono una risorsa onerosa per il sistema operativo.

Il sistema operativo, può tenere aperti solo un certo numero di file alla volta e per tutto il sistema. Questo è un limite che può essere impostato, ma sappiate che comunque ha un impatto sulla /velocità/ con cui viene poi gestito il computer: l'hardware del computer. Ogni volta che aprite un file, si occuperà una parte di memoria da un oggetto del sistema operativo chiamato /descrittore/. Questo succede perché il vostro programma non gestisce direttamente il file, ma parla col sistema operativo.
Quando aprite un file chiedete al sistema operativo di aprirvelo e quando ci scrivete o leggete chiedete al sistema di leggerlo o scriverlo, poi dite al sistema di chiuderlo. \\

Lui vi risponderà: - Era ora! -. \\

#+begin_src ruby

#apro il file
file = File.open('miofile.txt', 'r')

#leggo tutto il contenuto e lo metto nella variabile contenuto.
# contenuto sarà un Array di stringhe, un elemento per riga (se il file è di testo)
contenuto = file.readlines

#ho finito di leggerlo e lo chiudo: mai lasciare aperti i file.
file.close

#+end_src

Adesso ho letto il contenuto con il metodo /readlines/ che mi restituisce un /Array di String/. Come vedete ci sono vari modi di leggere il contenuto di un file.

Questi sono modi adatti per file di piccole dimensioni, altrimenti si dovranno adottare diverse strategie sempre per non caricare troppo il sistema operativo.

I file, per esempio, si potrebbero leggere a /pezzi/ più o meno grandi...

Il nostro file lo abbiamo /letto/, ma per scriverlo?

#+begin_src ruby

#apro il file
file = File.open('miofile.txt', 'w')

#scrivo dentro il file (se il file è di testo)
file.write('Ciao Mondo')

#ho finito di scrivere e lo chiudo: mai lasciare aperti i file.
file.close

#+end_src

Ho scritto la stringa /Ciao Mondo/ nel file. Adesso sul disco avremo un file dal nome /miofile.txt/ con dentro la frase: /Ciao Mondo/.

Visto che aprire e chiudere i file è così importante, Ruby ci mette a disposizione una versione del metodo /open/ molto interessante:

#+begin_src ruby

contenuto = ''
#apro il file
File.open('miofile.txt', 'r') do |file|

#leggo tutto il contenuto e lo metto nella variabile contenuto.
# contenuto avrà dentro tutto il testo come stringa (se il file è di testo)
contenuto = file.read

end

#+end_src

Come si può vedere, al metodo è associata una /closure/. Questa versione sostanzialmente si prende cura di chiudere il file all' uscita del blocco della /closure/. 

/Insomma se scriviamo così non ci dobbiamo preoccupare di chiudere il file perché sarà automatico. Non è un vantaggio?/

La classe /File/, come vi ho già detto, ha molti metodi per la gestione dei file. Alcuni interessanti sono questi:

+ *File.exist?('miofile.txt')* controlla se il file esiste.
+ *File.file?('miofile.txt')* controlla se un file è un file.
+ *File.directory?('miadirectory')* controlla se un file è una cartella (directory).
+ *File.ftype('miofile.txt')* controlla che tipo di file è, per esempio se è un file o una directory.
+ *File.size('miofile.txt')* controlla quando è grande, quanto spazio occupa sul disco.
+ *File.join('cartella1', 'cartella2', 'miofile.txt')* costruisce un percorso di file concatenando due o più stringhe.
+ *File.basename('/cartella1/cartella2/miofile.txt')* ritornerà solo il nome del file /miofile.txt/.
+ *File.dirname('/cartella1/cartella2/miofile.txt')* ritornerà solo il percorso delle directory senza il nome del file.
+ *File.extname('miofile.txt')* ritornerà l'estensione del nome del file, cioè il testo dopo il punto ma col punto compreso (/.txt/).

Ce ne sono altri di metodi e ci sono, inoltre, anche altre classi per la gestione dei file. I file non si creano, leggono o scrivono soltanto; ma si rinominano, spostano, cancellano e così via.

Quello che abbiamo visto qui serve per i /file di testo/, cioè quelli che contengono caratteri e che quando si leggono vi si accede come fossero delle stringhe. I file oltre che di /testo/ possono essere anche /binari/ e quindi codificati direttamente in /byte/. Vi si accede praticamente nello stesso modo, ma bisogna usare con i metodi che vi ho detto altri parametri. Non è particolarmente semplice, quindi per adesso va bene così.

