test.html

<div id="outline-container-sec-3-5-4" class="outline-4">
<h4 id="sec-3-5-4"><span class="section-number-4">3.5.4</span> Il mondo esterno</h4>
<div class="outline-text-4" id="text-3-5-4">
<p>
Fino ad adesso non abbiamo fatto altro che stare comodamente in casa, ma ogni tanto bisognerà uscire e parlare con la gente di fuori e magari non dimenticarsi quello che si è fatto.
Uno dei vari modi per uscire all'aperto è leggere e scrivere <i>file</i>. 
</p>

<p>
Lo avete fatto anche voi con il vostro <i>editor</i>, avete creato dei <i>file</i> sul disco del vostro computer e li avete letti, eseguiti con Ruby.
</p>

<p>
Ruby, come molti linguaggi ha la possibilità di <i>aprire</i> file, <i>scrivere o leggere</i> nei o dai file, <i>chiudere</i> i file. Non è un caso che abbia scritto: <i>aprire</i>, <i>leggere o scrivere</i>, <i>chiudere</i>; sono queste le fasi che servono per gestire i <i>file</i>.
</p>

<p>
Per fare questo abbiamo una <i>classe</i> che, ovviamente, si chiama <i>File</i>. <i>File</i> non fa solo quello, ha anche altri metodi che servono per esempio per avere informazioni sui <i>file</i> ma anche per gestirne i <i>percorsi</i>.
</p>

<p>
Un <i>percorso</i> serve per ritrovare un file nel disco del computer. Ci sono diverse <i>nomenclature</i> in base al sistema operativo che si sta usando e questo potrebbe rendere un po' complicato il gestirle.
</p>

<p>
Un <i>percorso</i> è formato da una serie di nomi di <i>cartelle</i> divisi da un separatore (qui è la differenza dei vari sistemi operativi) ed un nome di <i>file</i>.
</p>

<div class="org-src-container">

<pre class="src src-sh">/home/nissl/Documenti/Ruby/il_mio_file.txt
</pre>
</div>
<p>
Questo percorso è di tipo <i>Unix</i>.
</p>

<div class="org-src-container">

<pre class="src src-sh">c:\Documenti\Ruby\il_mio_file.txt
</pre>
</div>

<p>
Questo si usa con Microsoft Windows<sup>tm</sup>.
</p>

<p>
Senza entrare nelle differenze complicate, ne vediamo subito una e cioè la differenza di <i>separatore</i> (<i>slash</i> e <i>backslash</i>).
Fortunatamente Ruby, che è nato sui sistemi di tipo <i>Unix</i>, considera la forma con la barra normale (<i>slash</i>) <b>/</b> la forma corretta e quindi ragiona in questo modo facendolo fa anche su Windows<sup>tm</sup>. <br >
</p>

<p>
Quindi:
</p>

<div class="org-src-container">

<pre class="src src-sh">c:/Documenti/Ruby/il_mio_file.txt
</pre>
</div>

<p>
Per Ruby questo è corretto e lui troverà il file. Per il sistema operativo no però e questo potrebbe avere delle conseguenze in certi casi.
</p>

<p>
Vediamo come si apre un <i>file</i>:
</p>

<div class="org-src-container">

<pre class="src src-ruby">file = <span class="org-type">File</span>.open(<span class="org-string">'miofile.txt'</span>, <span class="org-string">'r'</span>)
</pre>
</div>

<p>
In questo modo, ho aperto un file in <i>sola lettura</i>, vuol dire che potrò leggerne il contenuto ma non lo potrò scrivere.
</p>

<p>
Ci sono vari <i>parametri di permesso</i> per i file e come si può vedere si indicano nel secondo valore dato al metodo mentre il primo è il nome del file.
</p>

<ul class="org-ul">
<li><b>r</b>: il file è aperto in <i>sola lettura</i> dal suo inizio.
</li>
<li><b>r+</b>: il file è aperto in <i>lettura e scrittura</i> dal suo inizio.
</li>
<li><b>w</b>: il file è aperto in <i>sola scrittura</i> e tronca il file a zero, cioè elimina il contenuto del file o ne crea uno se questo non esiste.
</li>
<li><b>w+</b>: il file è aperto in <i>lettura e scrittura</i> e tronca il file a zero, cioè elimina il contenuto del file o ne crea uno se questo non esiste.
</li>
<li><b>a</b>: il file è aperto in <i>sola scrittura</i> e aggiunge alla fine del file, <i>appende</i>.
</li>
<li><b>a+</b>: Il file è aperto in <i>lettura e scrittura</i> e aggiunge alla fine del file, <i>appende</i>.
</li>
</ul>

<p>
Queste sono le possibilità e l'uso dipende da quello che vogliamo fare con il file. Per esempio, se vogliamo solo leggere un file dobbiamo aprirlo in <i>sola lettura</i> per non rischiare di scriverci qualcosa inavvertitamente.
</p>

<p>
Esistono altre impostazioni da passare al metodo <i>open</i> o <i>new</i> oltre a queste, ma si rimanda alla documentazione ufficiale.
</p>

<p>
Ricordate sempre: <b>i <i>file</i> sono preziosi</b> e vanno gestiti in maniera adeguata.
</p>

<p>
Come ho accennato i file devono essere: aperti, letti o scritti, chiusi.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-comment-delimiter">#</span><span class="org-comment">apro il file</span>
file = <span class="org-type">File</span>.open(<span class="org-string">'miofile.txt'</span>, <span class="org-string">'r'</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">leggo tutto il contenuto e lo metto nella variabile contenuto.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">contenuto avr&#224; dentro tutto il testo come stringa (se il file &#232; di testo)</span>
contenuto = file.read

<span class="org-comment-delimiter">#</span><span class="org-comment">ho finito di leggerlo e lo chiudo: mai lasciare aperti i file.</span>
file.close
</pre>
</div>

<p>
Qui sopra ci sono le fasi. Una cosa molto importante è: <b>chiudere i file il prima possibile dopo averci lavorato</b>. <br >
</p>

<p>
Chiudere i file è importante per vari motivi, due di questi:
</p>

<ul class="org-ul">
<li>è pericoloso tenere aperto un file, si potrebbe distruggere o alterare
</li>
<li>i <i>file</i> sono una risorsa onerosa per il sistema operativo.
</li>
</ul>

<p>
Il sistema operativo, può tenere aperti solo un certo numero di file alla volta e per tutto il sistema. Questo è un limite che può essere impostato, ma sappiate che comunque ha un impatto sulla <i>velocità</i> con cui viene poi gestito il computer: l'hardware del computer. Ogni volta che aprite un file, si occuperà una parte di memoria da un oggetto del sistema operativo chiamato <i>descrittore</i>. Questo succede perché il vostro programma non gestisce direttamente il file, ma parla col sistema operativo.
Quando aprite un file chiedete al sistema operativo di aprirvelo e quando ci scrivete o leggete chiedete al sistema di leggerlo o scriverlo, poi dite al sistema di chiuderlo. <br >
</p>

<p>
Lui vi risponderà: - Era ora! -. <br >
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-comment-delimiter">#</span><span class="org-comment">apro il file</span>
file = <span class="org-type">File</span>.open(<span class="org-string">'miofile.txt'</span>, <span class="org-string">'r'</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">leggo tutto il contenuto e lo metto nella variabile contenuto.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">contenuto sar&#224; un Array di stringhe, un elemento per riga (se il file &#232; di testo)</span>
contenuto = file.readlines

<span class="org-comment-delimiter">#</span><span class="org-comment">ho finito di leggerlo e lo chiudo: mai lasciare aperti i file.</span>
file.close
</pre>
</div>

<p>
Adesso ho letto il contenuto con il metodo <i>readlines</i> che mi restituisce un <i>Array di String</i>. Come vedete ci sono vari modi di leggere il contenuto di un file.
</p>

<p>
Questi sono modi adatti per file di piccole dimensioni, altrimenti si dovranno adottare diverse strategie sempre per non caricare troppo il sistema operativo.
</p>

<p>
I file, per esempio, si potrebbero leggere a <i>pezzi</i> più o meno grandi&#x2026;
</p>

<p>
Il nostro file lo abbiamo <i>letto</i>, ma per scriverlo?
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-comment-delimiter">#</span><span class="org-comment">apro il file</span>
file = <span class="org-type">File</span>.open(<span class="org-string">'miofile.txt'</span>, <span class="org-string">'w'</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">scrivo dentro il file (se il file &#232; di testo)</span>
file.write(<span class="org-string">'Ciao Mondo'</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">ho finito di scrivere e lo chiudo: mai lasciare aperti i file.</span>
file.close
</pre>
</div>

<p>
Ho scritto la stringa <i>Ciao Mondo</i> nel file. Adesso sul disco avremo un file dal nome <i>miofile.txt</i> con dentro la frase: <i>Ciao Mondo</i>.
</p>

<p>
Visto che aprire e chiudere i file è così importante, Ruby ci mette a disposizione una versione del metodo <i>open</i> molto interessante:
</p>

<div class="org-src-container">

<pre class="src src-ruby">contenuto = <span class="org-string">''</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">apro il file</span>
<span class="org-type">File</span>.open(<span class="org-string">'miofile.txt'</span>, <span class="org-string">'r'</span>) <span class="org-keyword">do</span> |file|

<span class="org-comment-delimiter">#</span><span class="org-comment">leggo tutto il contenuto e lo metto nella variabile contenuto.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">contenuto avr&#224; dentro tutto il testo come stringa (se il file &#232; di testo)</span>
contenuto = file.read

<span class="org-keyword">end</span>
</pre>
</div>

<p>
Come si può vedere, al metodo è associata una <i>closure</i>. Questa versione sostanzialmente si prende cura di chiudere il file all' uscita del blocco della <i>closure</i>. 
</p>

<p>
<i>Insomma se scriviamo così non ci dobbiamo preoccupare di chiudere il file perché sarà automatico. Non è un vantaggio?</i>
</p>

<p>
La classe <i>File</i>, come vi ho già detto, ha molti metodi per la gestione dei file. Alcuni interessanti sono questi:
</p>

<ul class="org-ul">
<li><b>File.exist?('miofile.txt')</b>: controlla se il file esiste.
</li>
<li><b>File.file?('miofile.txt')</b>: controlla se un file è un file.
</li>
<li><b>File.directory?('miadirectory')</b>: controlla se un file è una cartella (directory).
</li>
<li><b>File.ftype('miofile.txt')</b>: controlla che tipo di file è, per esempio se è un file o una directory.
</li>
<li><b>File.size('miofile.txt')</b>: controlla quando è grande, quanto spazio occupa sul disco.
</li>
<li><b>File.join('cartella1', 'cartella2', 'miofile.txt')</b>: costruisce un percorso di file concatenando due o più stringhe.
</li>
<li><b>File.basename('/cartella1/cartella2/miofile.txt')</b>: ritornerà solo il nome del file <i>miofile.txt</i>.
</li>
<li><b>File.diname('/cartella1/cartella2/miofile.txt')</b>: ritornerà solo il percorso delle directory senza il nome del file.
</li>
<li><b>File.extname('miofile.txt')</b>: ritornerà l'estensione del nome del file, cioè il testo dopo il punto ma col punto compreso (<i>.txt</i>).
</li>
</ul>

<p>
Ce ne sono altri di metodi e ci sono, inoltre, anche altre classi per la gestione dei file. I file non si creano, leggono o scrivono soltanto; ma si rinominano, spostano, cancellano e così via.
</p>

<p>
Quello che abbiamo visto qui serve per i <i>file di testo</i>, cioè quelli che contengono caratteri e che quando si leggono vi si accede come fossero delle stringhe. I file oltre che di <i>testo</i> possono essere anche <i>binari</i> e quindi codificati direttamente in <i>byte</i>. Vi si accede praticamente nello stesso modo, ma bisogna usare con i metodi che vi ho detto altri parametri. Non è particolarmente semplice, quindi per adesso va bene così.
</p>
</div>
</div>
