test.org
*** I dizionari

Conoscerete il dizionario, quel librone grosso con tante parole in fila... I significati delle parole. Quello che va da /abaco/ a /zuzzurellone/ (per la verità, se controllate comincia con la /a/, però è così che corre voce).

Sappiate che Ruby ha i /dizionari/, la classe si chiama /Hash/ (il motivo c'è ma è complicato). In altri linguaggi di programmazione si chiamano /Map/ (mappa) ma il concetto è lo stesso.

Un dizionario o mappa o Hash è un tipo di dato estremamente utile.

#+begin_src ruby

dizionario = { 'nome' => 'massimo', 'cognome' => 'ghisalberti'}

#+end_src

Questo è come si dichiara velocemente. La variabile /dizionario/ contiene un /hash/ con due /chiavi/: nome e cognome.
Se volessi accedere al valore indicato dalla chiave /nome/:

#+begin_src ruby

il_mio_nome = dizionario['nome']

#+end_src

La variabile /il_mio_nome/ a questo punto conterrà /massimo/.

#+begin_src ruby

irb(main):001:0> dizionario = { 'nome' => 'massimo', 'cognome' => 'ghisalberti'}
=> {"nome"=>"massimo", "cognome"=>"ghisalberti"}
irb(main):002:0> dizionario['nome']
=> "massimo"
irb(main):003:0>

#+end_src

Vi assicuro che degli /Hash/ non potrete farne a meno, sono utilissimi.
In qualche maniera sono simili agli Array, nel senso che hanno metodi simili. Anche gli /Hash/ sono collezioni:

#+begin_src ruby :tangle source/dizionario.rb :noweb yes

dizionario = { 'nome' => 'massimo', 'cognome' => 'ghisalberti'}
dizionario.each do |chiave,valore|
  puts "chiave: " + chiave
  puts "valore: " + valore
end

#+end_src

Salvate come /dizionario.rb/ ed eseguite:

#+begin_src sh

➜  ruby dizionario.rb 
chiave: nome
valore: massimo
chiave: cognome
valore: ghisalberti
➜ 

#+end_src

come vedete, potete accedere in questo modo alle coppie /chiave -> valore/.
I /dizionari/ di Ruby sono estremamente flessibili, la chiave può essere di qualunque tipo supportato da Ruby e così i valori. Potete mischiare le cose...

#+begin_src ruby

dizionario = { 1 => 'massimo', 'cognome' => 'ghisalberti'}
dizionario.each do |chiave,valore|
  puts chiave
  puts valore
end

#+end_src

Eseguendolo, produrrà questo:

#+begin_src sh

➜  ruby dizionario.rb 
chiave: 1
valore: massimo
chiave: cognome
valore: ghisalberti
➜ 

#+end_src

Adesso una chiave è un /Fixnum/, un numero, mentre l'altra una stringa. \\

Adesso mi direte: - Perché i parli adesso degli Hash se sono così utili? - \\

La risposta è che, perché vi ho parlato di come si salva un file. Questa è la risposta corta.
Quella lunga invece è che un /hash/ (ma anche un Array) può essere facilmente /serializzato/. Che vuol dire?

#+begin_src ruby :tangle source/dizionario2.rb :noweb yes

require 'yaml'

rubrica = [

  {:nome => 'Massimo', :cognome => 'Ghisalberti', :telefono => '1234567890'},
  {:nome => 'Mario', :cognome => 'Rossi', :telefono => '1234567890'}

]

puts "La rubrica come array"
p rubrica
puts

puts "la rubrica serializzata come YAML"
p rubrica.to_yaml
puts

puts "Salvo la rubrica su un file"
puts
File.open('rubrica.yml', 'w') do |file|
  file.write(rubrica.to_yaml)
end


puts "Leggo la rubrica su un file"
puts
dati = []
File.open('rubrica.yml', 'r') do |file|
  yaml = YAML.load(file.read)
  dati = yaml.to_a
end

puts "La rubrica ricaricata dal file"
p dati

#+end_src

Salvate come /dizionario2.rb/ ed eseguite.

#+begin_src sh

➜  ruby dizionario2.rb
La rubrica come array
[{:nome=>"Massimo", :cognome=>"Ghisalberti", :telefono=>"1234567890"}, {:nome=>"Mario", :cognome=>"Rossi", :telefono=>"1234567890"}]

la rubrica serializzata come YAML
"---\n- :nome: Massimo\n  :cognome: Ghisalberti\n  :telefono: '1234567890'\n- :nome: Mario\n  :cognome: Rossi\n  :telefono: '1234567890'\n"

Salvo la rubrica su un file

Leggo la rubrica su un file

La rubrica ricaricata dal file
[{:nome=>"Massimo", :cognome=>"Ghisalberti", :telefono=>"1234567890"}, {:nome=>"Mario", :cognome=>"Rossi", :telefono=>"1234567890"}]
➜  

#+end_src

È un piccolo programma che salva un /array di hash/ e cioè una /collezione di dizionari/ su un file e la ricarica. Ho utilizzato un /formato di dati/ molto comune nel mondo Ruby, lo YAML (http://yaml.org/).
È un formato di struttura dati abbastanza semplice e versatile e soprattutto /testuale/. Se aprite il file /rubrica.yml/ vedrete che è così:

#+begin_src yaml

---
- :nome: Massimo
  :cognome: Ghisalberti
  :telefono: '1234567890'
- :nome: Mario
  :cognome: Rossi
  :telefono: '1234567890'

#+end_src

Se volete potete aggiungere direttamente qui:

#+begin_src yaml

---
- :nome: Massimo
  :cognome: Ghisalberti
  :telefono: '1234567890'
- :nome: Mario
  :cognome: Rossi
  :telefono: '1234567890'
- :nome: Pico
  :cognome: De paperis
  :telefono: '0234567890'

#+end_src

Quando lo rileggerete nel modo indicato avrete un dizionario in più nel vostro array.
Utilizzando il metodo /to_yaml/ ho convertito, in questo caso l'array ma anche tutti i tipi di dati in esso contenuti, in una struttura dati /Yaml/ che ho salvato sul disco.
Dopo ho ricaricato i dati dal file aperto come struttura dati Yaml attraverso /YAML.load/ e convertito di nuovo in dati Ruby con /to_a/ (/to array/).
Sembra contorto ed un po' lo è, ma questa /"cosa"/ vi permette di avere facilmente il modo di poter salvare velocemente dati sul disco e di recuperarli in seguito.

Pensate anche che lo Yaml non lo gestisce solo Ruby, ma si può aprire e leggere da molti altri linguaggi di programmazione.

Per /amor di cronaca/ esiste anche un altro sistema di strutture dati testuali che oggi va per la maggiore ed è il JSON (http://json.org/). Ruby ha un /serializzatore/ e /deserializzatore/ anche per il JSON.

#+begin_src ruby :tangle source/dizionario3.rb :noweb yes

require 'json'

rubrica = [

  {:nome => 'Massimo', :cognome => 'Ghisalberti', :telefono => '1234567890'},
  {:nome => 'Mario', :cognome => 'Rossi', :telefono => '1234567890'}

]

puts "La rubrica come array"
p rubrica
puts

puts "la rubrica serializzata come YAML"
p rubrica.to_json
puts

puts "Salvo la rubrica su un file"
puts
File.open('database.json', 'w') do |file|
  file.write(rubrica.to_json)
end


puts "Leggo la rubrica su un file"
puts
dati = []
File.open('database.json', 'r') do |file|
  json = JSON.load(file.read)
  dati = json.to_a
end

puts "La rubrica ricaricata dal file"
p dati

#+end_src

Come vedete i metodi sono molto simili.

Sia per il /JSON/ che lo /Yaml/ dovete, prima di usarli, richiederli con la /require/.

Come ultima cosa sugli /Hash/ voglio farvi notare una cosa: ho usato per le chiavi il tipo /Symbol/. Il simbolo è un tipo particolare simile ad una stringa, ma non è /mutabile/, non si possono cioè manipolare i caratteri che lo compongono. Ha una sua importanza in molti casi, ma soprattutto come chiavi dentro i dizionari dove si suppone che la chiave non cambi mai, ma cambi solo il valore. Ruby fa della /magia sua interna/ con i simboli ma spiegarla va oltre lo scopo di questo piccolo corso.

