test.html

<div id="outline-container-sec-3-5-5" class="outline-4">
<h4 id="sec-3-5-5"><span class="section-number-4">3.5.5</span> I dizionari</h4>
<div class="outline-text-4" id="text-3-5-5">
<p>
Conoscerete il dizionario, quel librone grosso con tante parole in fila&#x2026; I significati delle parole. Quello che va da <i>abaco</i> a <i>zuzzurellone</i> (per la verità, se controllate comincia con la <i>a</i>, però è così che corre voce).
</p>

<p>
Sappiate che Ruby ha i <i>dizionari</i>, la classe si chiama <i>Hash</i> (il motivo c'è ma è complicato). In altri linguaggi di programmazione si chiamano <i>Map</i> (mappa) ma il concetto è lo stesso.
</p>

<p>
Un dizionario o mappa o Hash è un tipo di dato estremamente utile.
</p>

<div class="org-src-container">

<pre class="src src-ruby">dizionario = { <span class="org-string">'nome'</span> =&gt; <span class="org-string">'massimo'</span>, <span class="org-string">'cognome'</span> =&gt; <span class="org-string">'ghisalberti'</span>}
</pre>
</div>

<p>
Questo è come si dichiara velocemente. La variabile <i>dizionario</i> contiene un <i>hash</i> con due <i>chiavi</i>: nome e cognome.
Se volessi accedere al valore indicato dalla chiave <i>nome</i>:
</p>

<div class="org-src-container">

<pre class="src src-ruby">il_mio_nome = dizionario[<span class="org-string">'nome'</span>]
</pre>
</div>

<p>
La variabile <i>il_mio_nome</i> a questo punto conterrà <i>massimo</i>.
</p>

<div class="org-src-container">

<pre class="src src-ruby">irb(main)<span class="org-constant">:001</span>:0&gt; dizionario = { <span class="org-string">'nome'</span> =&gt; <span class="org-string">'massimo'</span>, <span class="org-string">'cognome'</span> =&gt; <span class="org-string">'ghisalberti'</span>}
=&gt; {<span class="org-string">"nome"</span>=&gt;<span class="org-string">"massimo"</span>, <span class="org-string">"cognome"</span>=&gt;<span class="org-string">"ghisalberti"</span>}
irb(main)<span class="org-constant">:002</span>:0&gt; dizionario[<span class="org-string">'nome'</span>]
=&gt; <span class="org-string">"massimo"</span>
irb(main)<span class="org-constant">:003</span>:0&gt;
</pre>
</div>

<p>
Vi assicuro che degli <i>Hash</i> non potrete farne a meno, sono utilissimi.
In qualche maniera sono simili agli Array, nel senso che hanno metodi simili. Anche gli <i>Hash</i> sono collezioni:
</p>

<div class="org-src-container">

<pre class="src src-ruby">dizionario = { <span class="org-string">'nome'</span> =&gt; <span class="org-string">'massimo'</span>, <span class="org-string">'cognome'</span> =&gt; <span class="org-string">'ghisalberti'</span>}
dizionario.each <span class="org-keyword">do</span> |chiave,valore|
  <span class="org-builtin">puts</span> <span class="org-string">"chiave: "</span> + chiave
  <span class="org-builtin">puts</span> <span class="org-string">"valore: "</span> + valore
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Salvate come <i>dizionario.rb</i> ed eseguite:
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  ruby dizionario.rb 
chiave: nome
valore: massimo
chiave: cognome
valore: ghisalberti
&#10140;
</pre>
</div>

<p>
come vedete, potete accedere in questo modo alle coppie <i>chiave -&gt; valore</i>.
I <i>dizionari</i> di Ruby sono estremamente flessibili, la chiave può essere di qualunque tipo supportato da Ruby e così i valori. Potete mischiare le cose&#x2026;
</p>

<div class="org-src-container">

<pre class="src src-ruby">dizionario = { 1 =&gt; <span class="org-string">'massimo'</span>, <span class="org-string">'cognome'</span> =&gt; <span class="org-string">'ghisalberti'</span>}
dizionario.each <span class="org-keyword">do</span> |chiave,valore|
  <span class="org-builtin">puts</span> chiave
  <span class="org-builtin">puts</span> valore
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Eseguendolo, produrrà questo:
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  ruby dizionario.rb 
chiave: 1
valore: massimo
chiave: cognome
valore: ghisalberti
&#10140;
</pre>
</div>

<p>
Adesso una chiave è un <i>Fixnum</i>, un numero, mentre l'altra una stringa. <br >
</p>

<p>
Adesso mi direte: - Perché i parli adesso degli Hash se sono così utili? - <br >
</p>

<p>
La risposta è che, perché vi ho parlato di come si salva un file. Questa è la risposta corta.
Quella lunga invece è che un <i>hash</i> (ma anche un Array) può essere facilmente <i>serializzato</i>. Che vuol dire?
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-builtin">require</span> <span class="org-string">'yaml'</span>

rubrica = [

  {<span class="org-constant">:nome</span> =&gt; <span class="org-string">'Massimo'</span>, <span class="org-constant">:cognome</span> =&gt; <span class="org-string">'Ghisalberti'</span>, <span class="org-constant">:telefono</span> =&gt; <span class="org-string">'1234567890'</span>},
  {<span class="org-constant">:nome</span> =&gt; <span class="org-string">'Mario'</span>, <span class="org-constant">:cognome</span> =&gt; <span class="org-string">'Rossi'</span>, <span class="org-constant">:telefono</span> =&gt; <span class="org-string">'1234567890'</span>}

]

<span class="org-builtin">puts</span> <span class="org-string">"La rubrica come array"</span>
<span class="org-builtin">p</span> rubrica
puts

<span class="org-builtin">puts</span> <span class="org-string">"la rubrica serializzata come YAML"</span>
<span class="org-builtin">p</span> rubrica.to_yaml
puts

<span class="org-builtin">puts</span> <span class="org-string">"Salvo la rubrica su un file"</span>
puts
<span class="org-type">File</span>.open(<span class="org-string">'rubrica.yml'</span>, <span class="org-string">'w'</span>) <span class="org-keyword">do</span> |file|
  file.write(rubrica.to_yaml)
<span class="org-keyword">end</span>


<span class="org-builtin">puts</span> <span class="org-string">"Leggo la rubrica su un file"</span>
puts
dati = []
<span class="org-type">File</span>.open(<span class="org-string">'rubrica.yml'</span>, <span class="org-string">'r'</span>) <span class="org-keyword">do</span> |file|
  yaml = <span class="org-type">YAML</span>.load(file.read)
  dati = yaml.to_a
<span class="org-keyword">end</span>

<span class="org-builtin">puts</span> <span class="org-string">"La rubrica ricaricata dal file"</span>
<span class="org-builtin">p</span> dati
</pre>
</div>

<p>
Salvate come <i>dizionario2.rb</i> ed eseguite.
</p>

<div class="org-src-container">

<pre class="src src-sh">&#10140;  ruby dizionario2.rb
La rubrica come array
[{:<span class="org-variable-name">nome</span>=&gt;<span class="org-string">"Massimo"</span>, :<span class="org-variable-name">cognome</span>=&gt;<span class="org-string">"Ghisalberti"</span>, :<span class="org-variable-name">telefono</span>=&gt;<span class="org-string">"1234567890"</span>}, {:<span class="org-variable-name">nome</span>=&gt;<span class="org-string">"Mario"</span>, :<span class="org-variable-name">cognome</span>=&gt;<span class="org-string">"Rossi"</span>, :<span class="org-variable-name">telefono</span>=&gt;<span class="org-string">"1234567890"</span>}]

la rubrica serializzata come YAML
<span class="org-string">"---\n- :nome: Massimo\n  :cognome: Ghisalberti\n  :telefono: '1234567890'\n- :nome: Mario\n  :cognome: Rossi\n  :telefono: '1234567890'\n"</span>

Salvo la rubrica su un file

Leggo la rubrica su un file

La rubrica ricaricata dal file
[{:<span class="org-variable-name">nome</span>=&gt;<span class="org-string">"Massimo"</span>, :<span class="org-variable-name">cognome</span>=&gt;<span class="org-string">"Ghisalberti"</span>, :<span class="org-variable-name">telefono</span>=&gt;<span class="org-string">"1234567890"</span>}, {:<span class="org-variable-name">nome</span>=&gt;<span class="org-string">"Mario"</span>, :<span class="org-variable-name">cognome</span>=&gt;<span class="org-string">"Rossi"</span>, :<span class="org-variable-name">telefono</span>=&gt;<span class="org-string">"1234567890"</span>}]
&#10140;
</pre>
</div>

<p>
È un piccolo programma che salva un <i>array di hash</i> e cioè una <i>collezione di dizionari</i> su un file e la ricarica. Ho utilizzato un <i>formato di dati</i> molto comune nel mondo Ruby, lo YAML (<a href="http://yaml.org/">http://yaml.org/</a>).
È un formato di struttura dati abbastanza semplice e versatile e soprattutto <i>testuale</i>. Se aprite il file <i>rubrica.yml</i> vedrete che è così:
</p>

<div class="org-src-container">

<pre class="src src-yaml"><span class="org-comment">---</span>
- <span class="org-variable-name">:nome</span>: Massimo
  <span class="org-variable-name">:cognome</span>: Ghisalberti
  <span class="org-variable-name">:telefono</span>: <span class="org-string">'1234567890'</span>
- <span class="org-variable-name">:nome</span>: Mario
  <span class="org-variable-name">:cognome</span>: Rossi
  <span class="org-variable-name">:telefono</span>: <span class="org-string">'1234567890'</span>
</pre>
</div>

<p>
Se volete potete aggiungere direttamente qui:
</p>

<div class="org-src-container">

<pre class="src src-yaml"><span class="org-comment">---</span>
- <span class="org-variable-name">:nome</span>: Massimo
  <span class="org-variable-name">:cognome</span>: Ghisalberti
  <span class="org-variable-name">:telefono</span>: <span class="org-string">'1234567890'</span>
- <span class="org-variable-name">:nome</span>: Mario
  <span class="org-variable-name">:cognome</span>: Rossi
  <span class="org-variable-name">:telefono</span>: <span class="org-string">'1234567890'</span>
- <span class="org-variable-name">:nome</span>: Pico
  <span class="org-variable-name">:cognome</span>: De paperis
  <span class="org-variable-name">:telefono</span>: <span class="org-string">'0234567890'</span>
</pre>
</div>

<p>
Quando lo rileggerete nel modo indicato avrete un dizionario in più nel vostro array.
Utilizzando il metodo <i>to_yaml</i> ho convertito, in questo caso l'array ma anche tutti i tipi di dati in esso contenuti, in una struttura dati <i>Yaml</i> che ho salvato sul disco.
Dopo ho ricaricato i dati dal file aperto come struttura dati Yaml attraverso <i>YAML.load</i> e convertito di nuovo in dati Ruby con <i>to_a</i> (<i>to array</i>).
Sembra contorto ed un po' lo è, ma questa /"cosa"/ vi permette di avere facilmente il modo di poter salvare velocemente dati sul disco e di recuperarli in seguito.
</p>

<p>
Pensate anche che lo Yaml non lo gestisce solo Ruby, ma si può aprire e leggere da molti altri linguaggi di programmazione.
</p>

<p>
Per <i>amor di cronaca</i> esiste anche un altro sistema di strutture dati testuali che oggi va per la maggiore ed è il JSON (<a href="http://json.org/">http://json.org/</a>). Ruby ha un <i>serializzatore</i> e <i>deserializzatore</i> anche per il JSON.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-builtin">require</span> <span class="org-string">'json'</span>

rubrica = [

  {<span class="org-constant">:nome</span> =&gt; <span class="org-string">'Massimo'</span>, <span class="org-constant">:cognome</span> =&gt; <span class="org-string">'Ghisalberti'</span>, <span class="org-constant">:telefono</span> =&gt; <span class="org-string">'1234567890'</span>},
  {<span class="org-constant">:nome</span> =&gt; <span class="org-string">'Mario'</span>, <span class="org-constant">:cognome</span> =&gt; <span class="org-string">'Rossi'</span>, <span class="org-constant">:telefono</span> =&gt; <span class="org-string">'1234567890'</span>}

]

<span class="org-builtin">puts</span> <span class="org-string">"La rubrica come array"</span>
<span class="org-builtin">p</span> rubrica
puts

<span class="org-builtin">puts</span> <span class="org-string">"la rubrica serializzata come YAML"</span>
<span class="org-builtin">p</span> rubrica.to_json
puts

<span class="org-builtin">puts</span> <span class="org-string">"Salvo la rubrica su un file"</span>
puts
<span class="org-type">File</span>.open(<span class="org-string">'database.json'</span>, <span class="org-string">'w'</span>) <span class="org-keyword">do</span> |file|
  file.write(rubrica.to_json)
<span class="org-keyword">end</span>


<span class="org-builtin">puts</span> <span class="org-string">"Leggo la rubrica su un file"</span>
puts
dati = []
<span class="org-type">File</span>.open(<span class="org-string">'database.json'</span>, <span class="org-string">'r'</span>) <span class="org-keyword">do</span> |file|
  json = <span class="org-type">JSON</span>.load(file.read)
  dati = json.to_a
<span class="org-keyword">end</span>

<span class="org-builtin">puts</span> <span class="org-string">"La rubrica ricaricata dal file"</span>
<span class="org-builtin">p</span> dati
</pre>
</div>

<p>
Come vedete i metodi sono molto simili.
</p>

<p>
Sia per il <i>JSON</i> che lo <i>Yaml</i> dovete, prima di usarli, richiederli con la <i>require</i>.
</p>

<p>
Come ultima cosa sugli <i>Hash</i> voglio farvi notare una cosa: ho usato per le chiavi il tipo <i>Symbol</i>. Il simbolo è un tipo particolare simile ad una stringa, ma non è <i>mutabile</i>, non si possono cioè manipolare i caratteri che lo compongono. Ha una sua importanza in molti casi, ma soprattutto come chiavi dentro i dizionari dove si suppone che la chiave non cambi mai, ma cambi solo il valore. Ruby fa della <i>magia sua interna</i> con i simboli ma spiegarla va oltre lo scopo di questo piccolo corso.
</p>
</div>
</div>
