test.org
*** Le finestre che si aprono o si chiudono se fa freddo.

Apriamo le finestre, oggi si arieggia.

**** Divagazioni sul tema
#+begin_latex
\hfill\break
#+end_latex


Una delle parti più complicate e noiose del /programmare/ sono le interfacce grafiche.
Tutti voi avete dei sistemi operativi grafici, più o meno basati sul /paradigma della finestra/ o sul /padadigma della vista/.

Sappiate che contrariamente a quello che sapete o avete sentito più spesso dire, /Apple/ o /Microsoft/ in questo non si sono inventati niente. Insomma /Jobs/ e /Gates/ hanno solo rubacchiato qua e là.

Orrore! Qualcuno si sentirà male, qualcuno mi vorrà picchiare per aver /insultato/ i suoi idoli (specialmente quelli a cui piacciono le mele).

Ragazzi, tenetevi forte... \\
 
Tutto quello che conoscete è stato inventato dalla /Xerox/ in certi laboratori, il /PARC/, che aveva negli anni '70. 
A /Palo Alto/ in California, i ricercatori geniali della /Xerox/ hanno inventato l'informatica moderna.

+ Il /mouse/ (questo lo conoscete tutti)
+ la stampa laser (anche questa dovrebbe essere chiara)
+ l'/ethernet/ (ogni computer oggi ha una scheda ethernet per collegarsi a Internet)
+ la /grafica bitmap/ (le fotografie le fate?)
+ le /interfacce grafiche/ (Le finestre di Microsoft Windows^{tm} o di Apple MacOSX^{tm}?)
+ gli editor /WYSIWYG/, What You See Is What You Get (i word processor, avete presente Microsoft Word^{tm}?)
+ /Interpress/ (poi evoluto da Adobe nel postscript e finito nel PDF)
+ la programmazione orientata agli oggetti (con Smalltalk)
+ l'architettura /MVC/, /Model View Controller/ (che oggi è usatissima)
+ gli /LCD/ (gli schermi a cristalli liquidi)
+ i dischi ottici di memorizzazione (Philips poi fece il CD su queste ricerche nell'80)
+ ubiquitous computing (il calcolo distribuito)
+ la programmazione ad aspetti (Aspect Oriented Programming)
+ IPv6 (il nuovo protocollo per la comunicazione tra computer che ancora non abbiamo, Internet per adesso è ancora basato sull IPv5)

Tutto questo è stato /studiato/ e, o, /inventato/ tra la fine degli anni '60 ed i primi anni '80.

/Alan Key/, uno di questi pionieri ed inventore Smalltalk (implementato da /Dan Ingalls/), propose nel 1972 il /Dynabook/.
/Dynabook/ sarebbe dovuto essere un computer portatile a batteria (simile ad un tablet odierno, quindi Apple non ha inventato il tablet), con una batteria virtualmente eterna, collegato in rete wireless, con un sistema operativo grafico.

Durante questa ricerca, /Key/, inventò /Smalltalk/ ed i sistemi operativi grafici. Stimò allora (1972) per la costruzione del /Dynabook/ un costo di 6000 dollari. 

/Alan Key/ è fortemente impegnato nell'insegnamento della programmazione ai bambini e nella divulgazione dell'informatica a tutti i livelli, per esempio nel progetto: /One Laptop Per Child/ (http://en.wikipedia.org/wiki/One_Laptop_per_Child) che si prefiggeva la costruzione e distribuzione a basso costo di computer adatti all'insegnamento e per zone disagiate (XO-1 è uscito intorno al 2008).

**** Facciamole queste finestre, che ci siamo annoiati!
#+begin_latex
\hfill\break
#+end_latex

Dopo questa divagazione sul tema lunga e noiosa veniamo al dunque.

Programmare l'interfaccia grafica di un programma è un lavoro lungo e spesso noioso, non è difficile ma ripetitivo e dispersivo. Se prima lanciare a /linea di comando/ vi era sembrato /brutto/ e /noioso/ dopo questo lo amerete! \\

***** il problema
#+begin_latex
\hfill\break
#+end_latex

Esistono molte librerie per la /definizione/ delle interfacce grafiche, il sistema operativo grafico ne ha una sua che è spesso abbastanza complicata. Microsoft Windows^{tm} ha la sua, il MacOSX la sua, i vari /desktop/ Linux (KDE, Gnome per citarne solo due) la loro, Android la sua, IOS la sua. È un vero caos (ricordate che /casino/ è una parolaccia e non si può dire).

Pensate poi al problema di un programma fatto per funzionare su tutti questi sistemi.
Non è più un /caos/, è un vero /incubo/... Altro che i mostri sotto il letto o dentro l'armadio.

Per cercare di facilitarsi la vita, molti programmatori hanno scritto delle librerie che però hanno le loro regole.
Insomma /caos/ aggiunto al /caos/.

La scelta di una buona libreria è importante per la durata e la /mantenibilità/ (un software va mantenuto, curato e ci vanno aggiunte funzionalità o tolte) di un programma per computer.

Ci sono linguaggi di programmazione migliori di altri in questo, alcuni sono stati appositamente progettati per la definizione delle interfacce e quindi alcune cose sono facilitate.

Sfortunatamente Ruby non è uno di questi, ma ha una cosa molto importante: è /Ruby/. Poi, forse, questa affermazione sarà più chiara.

Per descrivere una interfaccia grafica abbiamo bisogno di usare una libreria apposta.


