test.html

<div id="outline-container-sec-3-5-6" class="outline-4">
<h4 id="sec-3-5-6"><span class="section-number-4">3.5.6</span> Le finestre che si aprono o si chiudono se fa freddo.</h4>
<div class="outline-text-4" id="text-3-5-6">
<p>
Apriamo le finestre, oggi si arieggia.
</p>
</div>

<div id="outline-container-sec-3-5-6-1" class="outline-5">
<h5 id="sec-3-5-6-1"><span class="section-number-5">3.5.6.1</span> Divagazioni sul tema</h5>
<div class="outline-text-5" id="text-3-5-6-1">
<p>
Una delle parti più complicate e noiose del <i>programmare</i> sono le interfacce grafiche.
Tutti voi avete dei sistemi operativi grafici, più o meno basati sul <i>paradigma della finestra</i> o sul <i>padadigma della vista</i>.
</p>

<p>
Sappiate che contrariamente a quello che sapete o avete sentito più spesso dire, <i>Apple</i> o <i>Microsoft</i> in questo non si sono inventati niente. Insomma <i>Jobs</i> e <i>Gates</i> hanno solo rubacchiato qua e là.
</p>

<p>
Orrore! Qualcuno si sentirà male, qualcuno mi vorrà picchiare per aver <i>insultato</i> i suoi idoli (specialmente quelli a cui piacciono le mele).
</p>

<p>
Ragazzi, tenetevi forte&#x2026; <br >
</p>

<p>
Tutto quello che conoscete è stato inventato dalla <i>Xerox</i> in certi laboratori, il <i>PARC</i>, che aveva negli anni '70. 
A <i>Palo Alto</i> in California, i ricercatori geniali della <i>Xerox</i> hanno inventato l'informatica moderna.
</p>

<ul class="org-ul">
<li>Il <i>mouse</i> (questo lo conoscete tutti)
</li>
<li>la stampa laser (anche questa dovrebbe essere chiara)
</li>
<li>l'<i>ethernet</i> (ogni computer oggi ha una scheda ethernet per collegarsi a Internet)
</li>
<li>la <i>grafica bitmap</i> (le fotografie le fate?)
</li>
<li>le <i>interfacce grafiche</i> (Le finestre di Microsoft Windows<sup>tm</sup> o di Apple MacOSX<sup>tm</sup>?)
</li>
<li>gli editor <i>WYSIWYG</i>, What You See Is What You Get (i word processor, avete presente Microsoft Word<sup>tm</sup>?)
</li>
<li><i>Interpress</i> (poi evoluto da Adobe nel postscript e finito nel PDF)
</li>
<li>la programmazione orientata agli oggetti (con Smalltalk)
</li>
<li>l'architettura <i>MVC</i>, <i>Model View Controller</i> (che oggi è usatissima)
</li>
<li>gli <i>LCD</i> (gli schermi a cristalli liquidi)
</li>
<li>i dischi ottici di memorizzazione (Philips poi fece il CD su queste ricerche nell'80)
</li>
<li>ubiquitous computing (il calcolo distribuito)
</li>
<li>la programmazione ad aspetti (Aspect Oriented Programming)
</li>
<li>IPv6 (il nuovo protocollo per la comunicazione tra computer che ancora non abbiamo, Internet per adesso è ancora basato sull IPv5)
</li>
</ul>

<p>
Tutto questo è stato <i>studiato</i> e, o, <i>inventato</i> tra la fine degli anni '60 ed i primi anni '80.
</p>

<p>
<i>Alan Key</i>, uno di questi pionieri ed inventore Smalltalk (implementato da <i>Dan Ingalls</i>), propose nel 1972 il <i>Dynabook</i>.
<i>Dynabook</i> sarebbe dovuto essere un computer portatile a batteria (simile ad un tablet odierno, quindi Apple non ha inventato il tablet), con una batteria virtualmente eterna, collegato in rete wireless, con un sistema operativo grafico.
</p>

<p>
Durante questa ricerca, <i>Key</i>, inventò <i>Smalltalk</i> ed i sistemi operativi grafici. Stimò allora (1972) per la costruzione del <i>Dynabook</i> un costo di 6000 dollari. 
</p>

<p>
<i>Alan Key</i> è fortemente impegnato nell'insegnamento della programmazione ai bambini e nella divulgazione dell'informatica a tutti i livelli, per esempio nel progetto: <i>One Laptop Per Child</i> (<a href="http://en.wikipedia.org/wiki/One_Laptop_per_Child">http://en.wikipedia.org/wiki/One_Laptop_per_Child</a>) che si prefiggeva la costruzione e distribuzione a basso costo di computer adatti all'insegnamento e per zone disagiate (XO-1 è uscito intorno al 2008).
</p>
</div>
</div>

<div id="outline-container-sec-3-5-6-2" class="outline-5">
<h5 id="sec-3-5-6-2"><span class="section-number-5">3.5.6.2</span> Facciamole queste finestre, che ci siamo annoiati!</h5>
<div class="outline-text-5" id="text-3-5-6-2">
<p>
Dopo questa divagazione sul tema lunga e noiosa veniamo al dunque.
</p>

<p>
Programmare l'interfaccia grafica di un programma è un lavoro lungo e spesso noioso, non è difficile ma ripetitivo e dispersivo. Se prima lanciare a <i>linea di comando</i> vi era sembrato <i>brutto</i> e <i>noioso</i> dopo questo lo amerete! <br >
</p>
</div>

<div id="outline-container-sec-3-5-6-2-1" class="outline-6">
<h6 id="sec-3-5-6-2-1"><span class="section-number-6">3.5.6.2.1</span> il problema</h6>
<div class="outline-text-6" id="text-3-5-6-2-1">
<p>
Esistono molte librerie per la <i>definizione</i> delle interfacce grafiche, il sistema operativo grafico ne ha una sua che è spesso abbastanza complicata. Microsoft Windows<sup>tm</sup> ha la sua, il MacOSX la sua, i vari <i>desktop</i> Linux (KDE, Gnome per citarne solo due) la loro, Android la sua, IOS la sua. È un vero caos (ricordate che <i>casino</i> è una parolaccia e non si può dire).
</p>

<p>
Pensate poi al problema di un programma fatto per funzionare su tutti questi sistemi.
Non è più un <i>caos</i>, è un vero <i>incubo</i>&#x2026; Altro che i mostri sotto il letto o dentro l'armadio.
</p>

<p>
Per cercare di facilitarsi la vita, molti programmatori hanno scritto delle librerie che però hanno le loro regole.
Insomma <i>caos</i> aggiunto al <i>caos</i>.
</p>

<p>
La scelta di una buona libreria è importante per la durata e la <i>mantenibilità</i> (un software va mantenuto, curato e ci vanno aggiunte funzionalità o tolte) di un programma per computer.
</p>

<p>
Ci sono linguaggi di programmazione migliori di altri in questo, alcuni sono stati appositamente progettati per la definizione delle interfacce e quindi alcune cose sono facilitate.
</p>

<p>
Sfortunatamente Ruby non è uno di questi, ma ha una cosa molto importante: è <i>Ruby</i>. Poi, forse, questa affermazione sarà più chiara.
</p>

<p>
Per descrivere una interfaccia grafica abbiamo bisogno di usare una libreria apposta.
</p>
</div>
</div>
