test.org
***** Le scarpette rosse
#+begin_latex
\hfill\break
#+end_latex

In questo mini corso vedremo come usare /Shoes/ (http://shoesrb.com/). \\

Dovete scaricare una distribuzione di /Shoes/ per il vostro sistema http://shoesrb.com/downloads/). Una volta installata avrete un eseguibile che si chiama /shoes/ con cui potete lanciare i vostri programmi. 
Se volte potete lanciare anche i vecchi programmi che avete fatto fino ad adesso, /Shoes/ è una libreria per Ruby che fornisce un comando per convenienza. Ruby c'è ancora e funziona.

#+begin_src sh

shoes tabellina.rb

#+end_src

L'unica cosa è che il programma non termina da solo ma dovete fermarlo con la combinazione di tasti: /CRTL+c/ (CTRL è il tasto Control, cercatelo sulla tastiera e premete prima quello e tenendolo premuto battete il tasto c, poi lasciateli tutti e due). \\

Vi ho fatto scaricare una distribuzione di Shoes completa perché non è facile da installare dentro Ruby specialmente se usate Microsoft Windows^{tm}. \\

Cominciamo con una cosa semplicissima:

#+begin_src ruby :tangle source/scarpe.rb :noweb yes

Shoes.app { 
  button "Ciao, premi..." 
}

#+end_src

Salvatelo come /scarpe.rb/ ed eseguitelo con: /shoes scarpe.rb/.

Alleluja! Il vostro primo programma grafico! Con Anche un bottone!

La finestra la potete spostare, ingrandire, rimpicciolire... Insomma ha un po' tutto.
Tutto quello che è dentro /Shoes.app/ è la nostra applicazione /Shoes/.

Aggiungiamo un altro bottone?

#+begin_src ruby :tangle source/scarpe2.rb :noweb yes

Shoes.app { 
  button "Ciao, premi..."
  button "Io sono il secondo bottone, premi..." 
}

#+end_src

Salvatelo come /scarpe2.rb/ ed eseguitelo con: /shoes scarpe2.rb/.

Vogliamo disegnare un cerchio? Via!

#+begin_src ruby :tangle source/scarpe3.rb :noweb yes

Shoes.app { 
  button "Ciao, premi..."
  button "Io sono il secondo bottone, premi..." 

  oval(left: 20, top: 40, radius: 50)

}

#+end_src

Salvatelo come /scarpe3.rb/ ed eseguitelo con: /shoes scarpe3.rb/.

Lo vogliamo rosso?

#+begin_src ruby :tangle source/scarpe4.rb :noweb yes

Shoes.app { 
  button "Ciao, premi..."
  button "Io sono il secondo bottone, premi..." 
  
  fill(red)
  oval(left: 20, top: 40, radius: 50)

  fill(green)
  rect(left: 20, top: 100, width: 50)

}

#+end_src

Salvatelo come /scarpe4.rb/ ed eseguitelo con: /shoes scarpe4.rb/.

Ho fatto anche un quadrato verde. Shoes ha numerosi oggetti grafici già disegnati: 

+ *oval* per disegnare ovali, quindi anche cerchi
+ *rect* per i rettangoli e quadrati
+ *star* per fare delle stelle
+ *image* per caricare immagini, anche via internet
+ *arrow* per fare delle frecce
+ *video* per guardare dei video
+ *...*

Oltre questi metodi per avere cose già fatte, possiamo sempre disegnarle noi con /stroke/ (tratto) e /fill/ (riempi).
Insomma, con penna e colore potete disegnare.

#+begin_src ruby :tangle source/scarpe5.rb :noweb yes

  Shoes.app do
    @stella = star(points: 5)
    motion do |sinistra, alto|
      @stella.move sinistra, alto
    end
  end

#+end_src

Salvatelo come /scarpe5.rb/ ed eseguitelo con: /shoes scarpe5.rb/.
Muovete il mouse. la stella vi viene dietro.

#+begin_src ruby :tangle source/scarpe6.rb :noweb yes

  Shoes.app do
    fill(yellow)
    @cerchio = oval(left: 40, top: 40, radius: 40)
    animate do |i|
      @cerchio.top += (-20..20).rand
      @cerchio.left += (-20..20).rand
    end
  end

#+end_src

Salvatelo come /scarpe6.rb/ ed eseguitelo con: /shoes scarpe6.rb/.
Abbiamo animato con il metodo /animate/ ed avremo un cerchio giallo che ballonzola in giro in maniera casuale.

La forma: /(-20..20)/ è un /Range/, serve per esprimere un intervallo di numeri. Il metodo /rand/ ne prende uno a caso dentro questo /Range/.

L'espressione:

#+begin_src ruby

variabile = 1

#questa forma è equivalente a quella dopo
variabile += 1

#questa forma è equivalente a quella prima
variabile = variabile + 1
#+end_src

utilizza un /operatore/ che chiameremo di /incremento/ /+=/. Ruby ha una serie di /operatori misti/ come questo, per esempio utile è:

#+begin_src ruby

variabile ||= 1

#+end_src

che assegnerà il valore 1 alla variabile solo se non contiene già un valore. Utile per inizializzare le variabili.

Ritorniamo al nostro bottone di prima:

#+begin_src ruby :tangle source/scarpe7.rb :noweb yes

Shoes.app { 
  button("premi...") {
    alert("Ciao Mondo!")
  }
}

#+end_src

Salvatelo come /scarpe7.rb/ ed eseguitelo con: /shoes scarpe7.rb/.

Premete il bottone... Avete aperto una /finestra di dialogo/, una di quelle che se non le chiudete non potete fare più niente (in gergo difficile si dice /finestra modale/).

#+begin_src ruby :tangle source/scarpe8.rb :noweb yes

Shoes.app { 
  button("premi...") {
    alert("Ciao Mondo1!")
  }
  button("premi...") {
    alert("Ciao Mondo2!")
  }
}

#+end_src

Salvatelo come /scarpe8.rb/ ed eseguitelo con: /shoes scarpe8.rb/.

/Siore e Siori/ abbiamo due bottoni che funzionano!

Vediamo un campo di input, salvate come /scarpe8.rb/ e lanciate:

#+begin_src ruby :tangle source/scarpe9.rb :noweb yes

  Shoes.app do

    background "#00ffff"
    border("#ff0000", strokewidth: 6)

    stack(margin: 12) do
      title("Giochino")
      para("Inserisci il tuo nome:")
      flow do
        @input_field = edit_line
        button("OK") do
           alert("Ciao " + @input_field.text)
        end
      end
    end
  end

#+end_src

Se lo eseguite, scrivete il vostro nome e premete il bottone; una finestra modale vi dirà: - Ciao ... -.

Qui possiamo notare diversi elementi.
il metodo /stack/ che /impila/ gli elementi che contiene, a cui possiamo fornire un margine e cioè di quanto è rientrato rispetto all'elemento che lo contiene (in questo caso la finestra principale). Il metodo /flow/ invece permette di allineare, /far fluire/, i due elementi /edit_line/ e /button/ mantenendoli uno accanto all'altro.
Il contenuto del /campo di input/ che ho chiamato /edit_field/ è recuperato con il metodo /text/ del campo di input.
Il metodo /para/ sta per paragrafo (/paragraph/) e serve per scrivere una linea di testo, mentre /title/ mette del testo in un carattere più grande.

Per /colorare la finestra/ abbiamo usato /background/ e /border/, il primo riempe di colore lo sfondo e il secondo costruisce un bordo intorno (la proprietà /strokewidth/ (/larghezza del tratto/) è lo spessore del bordo.

Ci sono altri metodi per i testi che possono essere usati insieme, salvate come /scarpe10.rb/:

#+begin_src ruby :tangle source/scarpe10.rb :noweb yes

  Shoes.app {
    stack(margin: 6) {
      title("Formattazione del testo")
      para(strong("Domanda"), " Quanto sei alto?")
      para(em(strong("Risposta"), " Sono alto un metro e mezzo."))
    }
  }

#+end_src

/strong/ metterà il testo in /grassetto/ mentre /em/ lo metterà in corsivo. 


#+begin_src ruby :tangle source/scarpe11.rb :noweb yes


  Shoes.app(title: "Il bottone") {
  
    stack {
      @bottone = button( "Premi") 
      @note = para(em("Non hai ancora premuto"))
    }

    num = 0
    
    @bottone.click {
      num += 1
      @note.text = "Hai premuto " + num.to_s + " volte"
    }

  }

#+end_src

Se salvate come /scarpe11.rb/ ed eseguite, vedrete che vi comunicherà il numero delle volte che avete premuto il bottone.

Adesso riprendiamo del codice che avevamo già scritto, le nostre /tabelline/:

#+begin_src ruby :tangle source/scarpe12.rb :noweb yes

  Shoes.app(title: "la tabellina", width: 340, height: 280) {
  
  def tabellina
    numeri = [1,2,3,4,5,6,7,8,9,10]
    (numeri.map { |numero|
            (numeri.map { |moltiplicatore|
               valore = numero * moltiplicatore
              (valore < 10 ? '0' : '') + valore.to_s + ' | '
            }).join
          }).join("\n")
   end
  
    stack(margin: 10) {
      @tabellina = para(strong(tabellina))
      @tabellina.style(fill: red, stroke: white)
    }
    
  }

#+end_src

Scrivete, salvate come /scarpe12.rb/ ed eseguite.
Qui ho usato anche il metodo /style/ per colorare il paragrafo: di rosso lo sfondo e bianco il testo.

Adesso rifacciamola ancora, un po' meglio (forse).

#+begin_src ruby :tangle source/scarpe13.rb :noweb yes

Shoes.app(title: "la tabellina", width: 412, height: 412, resizable: true) {
  
  def tabellina
    numeri = [1,2,3,4,5,6,7,8,9,10]
    numeri.map { |numero|
      numeri.map { |moltiplicatore|
        numero * moltiplicatore
      }
    }
  end
  
  width = 40
  height = 40
  top = 0
  
  tabellina.each_index { |numero_riga|
    stack(margin_left: 2) { 
      flow {
        left = 0        
        tabellina[numero_riga].each_index { |numero_colonna|
          valore =  tabellina[numero_riga][numero_colonna]
          pad = if valore < 10
                  '  '
                elsif valore >= 10 && valore < 100
                  ' '
                else
                  ''
                end          
          button = button(valore.to_s + ' ')
          button.style(top: top, left: left, width: width, height: height)
          button.instance_variable_set(:@coord, [numero_riga + 1, numero_colonna + 1])
          button.click { |btn|
            coord = btn.instance_variable_get(:@coord)      
            alert("Si ottiene moltiplicando #{ coord.join(' x ')}, oppure #{ coord.reverse.join(' x ')}")
          }
          
          left += width + 1
        }
      }
      top += height + 1
    }
  }
}

#+end_src

Salvate come /scarpe13.rb/ ed eseguite.

Qui ho usato anche delle caratteristiche particolari di Ruby, la sua dinamicità. Ho creato una variabile di istanza mentre il programma funziona. Può sembrare /normale/, ma vi assicuro che non lo è nei linguaggi di programmazione. 
Ruby, per questo (ma ce ne sono anche altri) è considerato un linguaggio /dinamico/.
Con il metodo /instance_variable_set/ ho impostato la variabile ed il suo valore mentre con /instance_variable_get/ l'ho letto in seguito.

Si possono fare molte cose con le caratteristiche /dinamiche/, come per esempio creare al volo metodi, o eliminarli da una istanza.

Guardate come una espressione /if..else..end/ restituisca un valore e per questo la chiamo /espressione/. Guardate come si possono fare test multipli con la sintassi /elsif/ che sta per /else if/. 

Con questo esempio abbiamo concluso questa superficiale panoramica su /Shoes/ e vi rimando al sito ufficiale per imparare ulteriormente.

/Shoes/ è decisamente lenta, ve ne sarete accorti, ma era nata per una scopo bene preciso che non è ovviamente quello di creare applicazioni complesse. È interessante per imparare alcune delle regole base della programmazione ad eventi per le interfacce grafiche; le cose più serie sono possibili anche  in Ruby, ma bisogna andare su librerie notevolmente più complesse.


