test.html


<div id="outline-container-sec-3-5-6-2-2" class="outline-6">
<h6 id="sec-3-5-6-2-2"><span class="section-number-6">3.5.6.2.2</span> Le scarpette rosse</h6>
<div class="outline-text-6" id="text-3-5-6-2-2">
<p>
In questo mini corso vedremo come usare <i>Shoes</i> (<a href="http://shoesrb.com/">http://shoesrb.com/</a>). <br >
</p>

<p>
Dovete scaricare una distribuzione di <i>Shoes</i> per il vostro sistema <a href="http://shoesrb.com/downloads/">http://shoesrb.com/downloads/</a>). Una volta installata avrete un eseguibile che si chiama <i>shoes</i> con cui potete lanciare i vostri programmi. 
Se volte potete lanciare anche i vecchi programmi che avete fatto fino ad adesso, <i>Shoes</i> è una libreria per Ruby che fornisce un comando per convenienza. Ruby c'è ancora e funziona.
</p>

<div class="org-src-container">

<pre class="src src-sh">shoes tabellina.rb
</pre>
</div>

<p>
L'unica cosa è che il programma non termina da solo ma dovete fermarlo con la combinazione di tasti: <i>CRTL+c</i> (CTRL è il tasto Control, cercatelo sulla tastiera e premete prima quello e tenendolo premuto battete il tasto c, poi lasciateli tutti e due). <br >
</p>

<p>
Vi ho fatto scaricare una distribuzione di Shoes completa perché non è facile da installare dentro Ruby specialmente se usate Microsoft Windows<sup>tm</sup>. <br >
</p>

<p>
Cominciamo con una cosa semplicissima:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-type">Shoes</span>.app { 
  button <span class="org-string">"Ciao, premi..."</span> 
}
</pre>
</div>

<p>
Salvatelo come <i>scarpe.rb</i> ed eseguitelo con: <i>shoes scarpe.rb</i>.
</p>

<p>
Alleluja! Il vostro primo programma grafico! Con Anche un bottone!
</p>

<p>
La finestra la potete spostare, ingrandire, rimpicciolire&#x2026; Insomma ha un po' tutto.
Tutto quello che è dentro <i>Shoes.app</i> è la nostra applicazione <i>Shoes</i>.
</p>

<p>
Aggiungiamo un altro bottone?
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-type">Shoes</span>.app { 
  button <span class="org-string">"Ciao, premi..."</span>
  button <span class="org-string">"Io sono il secondo bottone, premi..."</span> 
}
</pre>
</div>

<p>
Salvatelo come <i>scarpe2.rb</i> ed eseguitelo con: <i>shoes scarpe2.rb</i>.
</p>

<p>
Vogliamo disegnare un cerchio? Via!
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-type">Shoes</span>.app { 
  button <span class="org-string">"Ciao, premi..."</span>
  button <span class="org-string">"Io sono il secondo bottone, premi..."</span> 

  oval(<span class="org-constant">left</span>: 20, <span class="org-constant">top</span>: 40, <span class="org-constant">radius</span>: 50)

}
</pre>
</div>

<p>
Salvatelo come <i>scarpe3.rb</i> ed eseguitelo con: <i>shoes scarpe3.rb</i>.
</p>

<p>
Lo vogliamo rosso?
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-type">Shoes</span>.app { 
  button <span class="org-string">"Ciao, premi..."</span>
  button <span class="org-string">"Io sono il secondo bottone, premi..."</span> 

  fill(red)
  oval(<span class="org-constant">left</span>: 20, <span class="org-constant">top</span>: 40, <span class="org-constant">radius</span>: 50)

  fill(green)
  rect(<span class="org-constant">left</span>: 20, <span class="org-constant">top</span>: 100, <span class="org-constant">width</span>: 50)

}
</pre>
</div>

<p>
Salvatelo come <i>scarpe4.rb</i> ed eseguitelo con: <i>shoes scarpe4.rb</i>.
</p>

<p>
Ho fatto anche un quadrato verde. Shoes ha numerosi oggetti grafici già disegnati: 
</p>

<ul class="org-ul">
<li><b>oval</b> per disegnare ovali, quindi anche cerchi
</li>
<li><b>rect</b> per i rettangoli e quadrati
</li>
<li><b>star</b> per fare delle stelle
</li>
<li><b>image</b> per caricare immagini, anche via internet
</li>
<li><b>arrow</b> per fare delle frecce
</li>
<li><b>video</b> per guardare dei video
</li>
<li><b>&#x2026;</b>
</li>
</ul>

<p>
Oltre questi metodi per avere cose già fatte, possiamo sempre disegnarle noi con <i>stroke</i> (tratto) e <i>fill</i> (riempi).
Insomma, con penna e colore potete disegnare.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-type">Shoes</span>.app <span class="org-keyword">do</span>
  <span class="org-variable-name">@stella</span> = star(<span class="org-constant">points</span>: 5)
  motion <span class="org-keyword">do</span> |sinistra, alto|
    <span class="org-variable-name">@stella</span>.move sinistra, alto
  <span class="org-keyword">end</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Salvatelo come <i>scarpe5.rb</i> ed eseguitelo con: <i>shoes scarpe5.rb</i>.
Muovete il mouse. la stella vi viene dietro.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-type">Shoes</span>.app <span class="org-keyword">do</span>
  fill(yellow)
  <span class="org-variable-name">@cerchio</span> = oval(<span class="org-constant">left</span>: 40, <span class="org-constant">top</span>: 40, <span class="org-constant">radius</span>: 40)
  animate <span class="org-keyword">do</span> |i|
    <span class="org-variable-name">@cerchio</span>.top += (-20..20).rand
    <span class="org-variable-name">@cerchio</span>.left += (-20..20).rand
  <span class="org-keyword">end</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Salvatelo come <i>scarpe6.rb</i> ed eseguitelo con: <i>shoes scarpe6.rb</i>.
Abbiamo animato con il metodo <i>animate</i> ed avremo un cerchio giallo che ballonzola in giro in maniera casuale.
</p>

<p>
La forma: <i>(-20..20)</i> è un <i>Range</i>, serve per esprimere un intervallo di numeri. Il metodo <i>rand</i> ne prende uno a caso dentro questo <i>Range</i>.
</p>

<p>
L'espressione:
</p>

<div class="org-src-container">

<pre class="src src-ruby">variabile = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">questa forma &#232; equivalente a quella dopo</span>
variabile += 1

<span class="org-comment-delimiter">#</span><span class="org-comment">questa forma &#232; equivalente a quella prima</span>
variabile = variabile + 1
</pre>
</div>

<p>
utilizza un <i>operatore</i> che chiameremo di <i>incremento</i> <i>+=</i>. Ruby ha una serie di <i>operatori misti</i> come questo, per esempio utile è:
</p>

<div class="org-src-container">

<pre class="src src-ruby">variabile ||= 1
</pre>
</div>

<p>
che assegnerà il valore 1 alla variabile solo se non contiene già un valore. Utile per inizializzare le variabili.
</p>

<p>
Ritorniamo al nostro bottone di prima:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-type">Shoes</span>.app { 
  button(<span class="org-string">"premi..."</span>) {
    alert(<span class="org-string">"Ciao Mondo!"</span>)
  }
}
</pre>
</div>

<p>
Salvatelo come <i>scarpe7.rb</i> ed eseguitelo con: <i>shoes scarpe7.rb</i>.
</p>

<p>
Premete il bottone&#x2026; Avete aperto una <i>finestra di dialogo</i>, una di quelle che se non le chiudete non potete fare più niente (in gergo difficile si dice <i>finestra modale</i>).
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-type">Shoes</span>.app { 
  button(<span class="org-string">"premi..."</span>) {
    alert(<span class="org-string">"Ciao Mondo1!"</span>)
  }
  button(<span class="org-string">"premi..."</span>) {
    alert(<span class="org-string">"Ciao Mondo2!"</span>)
  }
}
</pre>
</div>

<p>
Salvatelo come <i>scarpe8.rb</i> ed eseguitelo con: <i>shoes scarpe8.rb</i>.
</p>

<p>
<i>Siore e Siori</i> abbiamo due bottoni che funzionano!
</p>

<p>
Vediamo un campo di input, salvate come <i>scarpe8.rb</i> e lanciate:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-type">Shoes</span>.app <span class="org-keyword">do</span>

  background <span class="org-string">"#00ffff"</span>
  border(<span class="org-string">"#ff0000"</span>, <span class="org-constant">strokewidth</span>: 6)

  stack(<span class="org-constant">margin</span>: 12) <span class="org-keyword">do</span>
    title(<span class="org-string">"Giochino"</span>)
    para(<span class="org-string">"Inserisci il tuo nome:"</span>)
    flow <span class="org-keyword">do</span>
      <span class="org-variable-name">@input_field</span> = edit_line
      button(<span class="org-string">"OK"</span>) <span class="org-keyword">do</span>
         alert(<span class="org-string">"Ciao "</span> + <span class="org-variable-name">@input_field</span>.text)
      <span class="org-keyword">end</span>
    <span class="org-keyword">end</span>
  <span class="org-keyword">end</span>
<span class="org-keyword">end</span>
</pre>
</div>

<p>
Se lo eseguite, scrivete il vostro nome e premete il bottone; una finestra modale vi dirà: - Ciao &#x2026; -.
</p>

<p>
Qui possiamo notare diversi elementi.
il metodo <i>stack</i> che <i>impila</i> gli elementi che contiene, a cui possiamo fornire un margine e cioè di quanto è rientrato rispetto all'elemento che lo contiene (in questo caso la finestra principale). Il metodo <i>flow</i> invece permette di allineare, <i>far fluire</i>, i due elementi <i>edit_line</i> e <i>button</i> mantenendoli uno accanto all'altro.
Il contenuto del <i>campo di input</i> che ho chiamato <i>edit_field</i> è recuperato con il metodo <i>text</i> del campo di input.
Il metodo <i>para</i> sta per paragrafo (<i>paragraph</i>) e serve per scrivere una linea di testo, mentre <i>title</i> mette del testo in un carattere più grande.
</p>

<p>
Per <i>colorare la finestra</i> abbiamo usato <i>background</i> e <i>border</i>, il primo riempe di colore lo sfondo e il secondo costruisce un bordo intorno (la proprietà <i>strokewidth</i> (<i>larghezza del tratto</i>) è lo spessore del bordo.
</p>

<p>
Ci sono altri metodi per i testi che possono essere usati insieme, salvate come <i>scarpe10.rb</i>:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-type">Shoes</span>.app {
  stack(<span class="org-constant">margin</span>: 6) {
    title(<span class="org-string">"Formattazione del testo"</span>)
    para(strong(<span class="org-string">"Domanda"</span>), <span class="org-string">" Quanto sei alto?"</span>)
    para(em(strong(<span class="org-string">"Risposta"</span>), <span class="org-string">" Sono alto un metro e mezzo."</span>))
  }
}
</pre>
</div>

<p>
<i>strong</i> metterà il testo in <i>grassetto</i> mentre <i>em</i> lo metterà in corsivo. 
</p>


<div class="org-src-container">

<pre class="src src-ruby"><span class="org-type">Shoes</span>.app(<span class="org-constant">title</span>: <span class="org-string">"Il bottone"</span>) {

  stack {
    <span class="org-variable-name">@bottone</span> = button( <span class="org-string">"Premi"</span>) 
    <span class="org-variable-name">@note</span> = para(em(<span class="org-string">"Non hai ancora premuto"</span>))
  }

  num = 0

  <span class="org-variable-name">@bottone</span>.click {
    num += 1
    <span class="org-variable-name">@note</span>.text = <span class="org-string">"Hai premuto "</span> + num.to_s + <span class="org-string">" volte"</span>
  }

}
</pre>
</div>

<p>
Se salvate come <i>scarpe11.rb</i> ed eseguite, vedrete che vi comunicherà il numero delle volte che avete premuto il bottone.
</p>

<p>
Adesso riprendiamo del codice che avevamo già scritto, le nostre <i>tabelline</i>:
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-type">Shoes</span>.app(<span class="org-constant">title</span>: <span class="org-string">"la tabellina"</span>, <span class="org-constant">width</span>: 340, <span class="org-constant">height</span>: 280) {

<span class="org-keyword">def</span> <span class="org-function-name">tabellina</span>
  numeri = [1,2,3,4,5,6,7,8,9,10]
  (numeri.map { |numero|
          (numeri.map { |moltiplicatore|
             valore = numero * moltiplicatore
            (valore &lt; 10 ? <span class="org-string">'0'</span> : <span class="org-string">''</span>) + valore.to_s + <span class="org-string">' | '</span>
          }).join
        }).join(<span class="org-string">"\n"</span>)
 <span class="org-keyword">end</span>

  stack(<span class="org-constant">margin</span>: 10) {
    <span class="org-variable-name">@tabellina</span> = para(strong(tabellina))
    <span class="org-variable-name">@tabellina</span>.style(<span class="org-constant">fill</span>: red, <span class="org-constant">stroke</span>: white)
  }

}
</pre>
</div>

<p>
Scrivete, salvate come <i>scarpe12.rb</i> ed eseguite.
Qui ho usato anche il metodo <i>style</i> per colorare il paragrafo: di rosso lo sfondo e bianco il testo.
</p>

<p>
Adesso rifacciamola ancora, un po' meglio (forse).
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span class="org-type">Shoes</span>.app(<span class="org-constant">title</span>: <span class="org-string">"la tabellina"</span>, <span class="org-constant">width</span>: 412, <span class="org-constant">height</span>: 412, <span class="org-constant">resizable</span>: <span class="org-variable-name">true</span>) {

  <span class="org-keyword">def</span> <span class="org-function-name">tabellina</span>
    numeri = [1,2,3,4,5,6,7,8,9,10]
    numeri.map { |numero|
      numeri.map { |moltiplicatore|
        numero * moltiplicatore
      }
    }
  <span class="org-keyword">end</span>

  width = 40
  height = 40
  top = 0

  tabellina.each_index { |numero_riga|
    stack(<span class="org-constant">margin_left</span>: 2) { 
      flow {
        left = 0        
        tabellina[numero_riga].each_index { |numero_colonna|
          valore =  tabellina[numero_riga][numero_colonna]
          pad = <span class="org-keyword">if</span> valore &lt; 10
                  <span class="org-string">'  '</span>
                <span class="org-keyword">elsif</span> valore &gt;= 10 &amp;&amp; valore &lt; 100
                  <span class="org-string">' '</span>
                <span class="org-keyword">else</span>
                  <span class="org-string">''</span>
                <span class="org-keyword">end</span>          
          button = button(valore.to_s + <span class="org-string">' '</span>)
          button.style(<span class="org-constant">top</span>: top, <span class="org-constant">left</span>: left, <span class="org-constant">width</span>: width, <span class="org-constant">height</span>: height)
          button.instance_variable_set(<span class="org-constant">:@coord</span>, [numero_riga + 1, numero_colonna + 1])
          button.click { |btn|
            coord = btn.instance_variable_get(<span class="org-constant">:@coord</span>)      
            alert(<span class="org-string">"Si ottiene moltiplicando </span><span class="org-variable-name">#{ coord.join(' x ')}</span><span class="org-string">, oppure </span><span class="org-variable-name">#{ coord.reverse.join(' x ')}</span><span class="org-string">"</span>)
          }

          left += width + 1
        }
      }
      top += height + 1
    }
  }
}
</pre>
</div>

<p>
Salvate come <i>scarpe13.rb</i> ed eseguite.
</p>

<p>
Qui ho usato anche delle caratteristiche particolari di Ruby, la sua dinamicità. Ho creato una variabile di istanza mentre il programma funziona. Può sembrare <i>normale</i>, ma vi assicuro che non lo è nei linguaggi di programmazione. 
Ruby, per questo (ma ce ne sono anche altri) è considerato un linguaggio <i>dinamico</i>.
Con il metodo <i>instance_variable_set</i> ho impostato la variabile ed il suo valore mentre con <i>instance_variable_get</i> l'ho letto in seguito.
</p>

<p>
Si possono fare molte cose con le caratteristiche <i>dinamiche</i>, come per esempio creare al volo metodi, o eliminarli da una istanza.
</p>

<p>
Guardate come una espressione <i>if..else..end</i> restituisca un valore e per questo la chiamo <i>espressione</i>. Guardate come si possono fare test multipli con la sintassi <i>elsif</i> che sta per <i>else if</i>. 
</p>

<p>
Con questo esempio abbiamo concluso questa superficiale panoramica su <i>Shoes</i> e vi rimando al sito ufficiale per imparare ulteriormente.
</p>

<p>
<i>Shoes</i> è decisamente lenta, ve ne sarete accorti, ma era nata per una scopo bene preciso che non è ovviamente quello di creare applicazioni complesse. È interessante per imparare alcune delle regole base della programmazione ad eventi per le interfacce grafiche; le cose più serie sono possibili anche  in Ruby, ma bisogna andare su librerie notevolmente più complesse.
</p>
</div>
</div>
</div>
</div>
</div>
