test.org
** Conclusioni

Abbiamo solo grattato la superficie e spero di avervi almeno fatto venire la /curiosità/ su cosa voglia dire programmare. Ora qui, abbiamo terminato.

Vi rimando alla documentazione ufficiale dove troverete molte cose interessanti: http://www.ruby-doc.org/

*Ruby* è un linguaggio potente, adatto a molteplici usi. Se vogliamo trovare un difetto è che /non è veloce/, anche se nelle varie versioni lo è sempre di più.

Ruby ha caratteristiche che non fanno rimpiangere quello, perché rende programmare /divertente/ e /produttivi fin da subito/ il che non è niente male.

Potete fare della /Metaprogrammazione/ per esempio e fare cose davvero /magiche/. 
Potete creare metodi /al volo/ mentre il programma sta funzionando, estendere classi esistenti senza derivarle. Modificare comportamenti prefissati. \\

Il limite è davvero /solo la fantasia/. \\

Vorrei ringraziare Yukihiro Matsumoto, per averlo pensato ed inizialmente creato ed aver aperto le porte ad una selva di programmatori contenti e rilassati. \\

Lo dico molto spesso, *Ruby è magico e divertente*. \\
