test.html


<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Conclusioni</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Abbiamo solo grattato la superficie e spero di avervi almeno fatto venire la <i>curiosità</i> su cosa voglia dire programmare. Ora qui, abbiamo terminato.
</p>

<p>
Vi rimando alla documentazione ufficiale dove troverete molte cose interessanti: <a href="http://www.ruby-doc.org/">http://www.ruby-doc.org/</a>
</p>

<p>
<b>Ruby</b> è un linguaggio potente, adatto a molteplici usi. Se vogliamo trovare un difetto è che <i>non è veloce</i>, anche se nelle varie versioni lo è sempre di più.
</p>

<p>
Ruby ha caratteristiche che non fanno rimpiangere quello, perché rende programmare <i>divertente</i> e <i>produttivi fin da subito</i> il che non è niente male.
</p>

<p>
Potete fare della <i>Metaprogrammazione</i> per esempio e fare cose davvero <i>magiche</i>. 
Potete creare metodi <i>al volo</i> mentre il programma sta funzionando, estendere classi esistenti senza derivarle. Modificare comportamenti prefissati. <br >
</p>

<p>
Il limite è davvero <i>solo la fantasia</i>. <br >
</p>

<p>
Vorrei ringraziare Yukihiro Matsumoto, per averlo pensato ed inizialmente creato ed aver aperto le porte ad una selva di programmatori contenti e rilassati. <br >
</p>

<p>
Lo dico molto spesso, <b>Ruby è magico e divertente</b>. <br >
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Data: 2014-10-21</p>
<p class="author">Autore: Massimo Maria Ghisalberti - pragmas.org</p>
<p class="date">Created: 2014-11-02 dom 15:38</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.51.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
